[
    {
        "title": "Dota 2 vs. League Of Legends: Which Is Better?",
        "content": "The only downside to Dota 2 is that it isn't the freshest and, even though it's free, finding random people to join you is much harder due to its slightly more cult-like audience. League of Legends didn't start the genre, but it proved how successful it could be. The game has expanded massively among both casual and competitive players."
    },
    {
        "title": "Vengeful Spirit - Dota 2 Wiki",
        "content": "Vengeful Spirit's fun name, \"820\", is a tribute to former professional DotA player 820. In DotA 1, she was the sister of Mortred, the Phantom Assassin, and her name was Shendelzare Silkwood. In Dota 2, her lore was changed so that she became affiliated with the Skywrath, thus switching her affiliations to Dragonus, the Skywrath Mage."
    },
    {
        "title": "League of Legends vs Dota 2 - GamerzClass",
        "content": "Complexity. DOTA 2 boasts a steep learning curve, while League of Legends is fairly easy to pick up on. While this might seem like a disadvantage on DOTA 2's part, the game's complexity makes it far more rewarding once you've put in the time to understand the game's mechanics and successfully execute some unusual builds and plays."
    },
    {
        "title": "History of Woman Suffrage/Volume 3/Chapter 43",
        "content": ""
    },
    {
        "title": "crit",
        "content": ""
    },
    {
        "title": "Mirad Grammar/Vocabulary Formation",
        "content": ""
    },
    {
        "title": "endow",
        "content": ""
    },
    {
        "title": "Mirad Grammar/print version",
        "content": ""
    },
    {
        "title": "Dota 2 Matches, eSports events and tournaments",
        "content": "06.12.2021 · All current, upcoming and completed Dota 2 eSports events and tournaments, live scores, results, schedules, VODs and news"
    },
    {
        "title": "Ghost King Voice lines in League of Legends vs Dota 2"
    },
    {
        "title": "Day 23: Diana vs Luna(LoL vs Dota 2)"
    },
    {
        "title": "Day 21:Corki vs Gyrocopter(LoL vs Dota 2)"
    },
    {
        "title": "Jax vs Juggernaut (LoL vs Dota 2)"
    },
    {
        "title": "CS:GO vs Dota 2: Does Valve Really Have a Favourite Child? Exploring favouritism in prize pools, matchfixing bans, and Gaben himself."
    },
    {
        "title": "Game/Interface Options Warcraft 3 Reforged vs DOTA 2"
    },
    {
        "title": "League vs Dota 2 input delay (Riot did an amazing job)"
    },
    {
        "title": "LoL vs Dota 2 vs steel beam"
    },
    {
        "title": "League of Legends vs. Dota 2",
        "content": "DOTA 2 offers many different game modes to play and even custom ones. League's TFT was created as a custom game mode in DOTA 2, then called DOTA Autochess. In terms of variety, versatility, and freedom of gameplay, DOTA 2 is the king."
    },
    {
        "title": "Mirad/Print version",
        "content": ""
    },
    {
        "title": "B8 vs Creepwave Dota 2, Nov 12, 2021 - Live Stream, Score ...",
        "content": "12.11.2021 · Nov 12, 2021 B8 vs Cwave (D2CL) Dota 2 Match. All B8 Creepwave match info - livescore, results, lineups, encounters, history, analytics"
    },
    {
        "title": "Dota 2",
        "content": "Every day, millions of players worldwide enter the battle as one of over a hundred Dota Heroes in a 5v5 team clash. Dota is the deepest multi-player action RTS ...‎The Dota Pro Circuit 2021... · ‎Dota Patch Notes - 7.30e · ‎Heroes · ‎News"
    },
    {
        "title": "Dota 2 ranks: ranking system explained, MMR, and more ...",
        "content": "Dota 2's ranking system might look complex from the outset, but it works just like any other competitive game out there. Ranked will need to be unlocked over time by new players by playing 100 hours worth of casual games, but after that, the grind can begin."
    },
    {
        "title": "Cultural Anthropology/Print version",
        "content": ""
    },
    {
        "title": "Dota 2 vs League of Legends - Prize Pools & Players ...",
        "content": "09.07.2013 · Dota 2 vs League of Legends: $187,118,722.85 difference in prize money, detailed side-by-side comparison of prize pools, tournaments, players and countries."
    },
    {
        "title": "Dota 2 on Steam",
        "content": "... that ensure a constant evolution of gameplay, features, and heroes, Dota 2 has taken on a life of its own. ... Learn the ropes playing co-op vs. bots.Publisher: ValveReleased: Jul 9, 2013"
    },
    {
        "title": "League of Legends VS. Dota 2 - Which is Better? - Fonezie",
        "content": "In the comparison of Dota vs. League of Legends, it is safe to say Dota has been highlighted by some of the largest events ever held in the history of gaming. The Annual World Championship for Dota 2 is the largest tournament witnessed by the gaming world."
    },
    {
        "title": "Execration vs Army Geniuses Dota 2, Oct 31, 2021 - Live ...",
        "content": "31.10.2021 · Oct 31, 2021 XCTN vs AG (BTS) Dota 2 Match. All Execration Army Geniuses match info - livescore, results, lineups, encounters, history, analytics"
    },
    {
        "title": "Dota 2 - Wikipedia",
        "content": "During a match players collect experience points and items for their heroes to successfully defeat the opposing team's heroes in player versus player combat. A ...Release: Windows; July 9, 2013; Linux‎, ‎OS X‎; ...‎Platform(s): Microsoft Windows; ‎Linux‎; ‎OS X‎Genre(s): MOBAEngine: Source 2"
    },
    {
        "title": "LoL vs. Dota 2 | League of Legends and Dota 2 comparison",
        "content": "LoL vs Dota 2: Game mechanic differences Despite having similar traits, a few key differences stand out across both games when it comes to the game mechanics. For example, in LoL, a Champion can turn and move instantly when the player right clicks, however, in Dota 2, players must wait for the animation to play of the Hero rotating before the ..."
    },
    {
        "title": "Wewatch.gg ⇒ Esports Live Score ⋙ eSports Games & Matches ...",
        "content": "07.12.2021 · eSports Livescore ⋙ Live Stream Esports Games Schedule & Results ⋙ Dota 2, CS:GO ️Matches ️Calendar ️Bets & predictions 🥉 Best eSports betting site ⭐ LIVE ⭐ Live broadcast of events on Wewatch.gg"
    },
    {
        "title": "Dota 2 - Twitch",
        "content": "2 hours ago — Dota 2 is a multiplayer online battle arena video game and the stand-alone sequel ... LIVE: OG vs Team Liquid - DPC WEU Winter Tour - DreamLeague Season 16."
    },
    {
        "title": "Dota 2 vs LoL: What are the Differences? - Bitspawn",
        "content": "Dota was a modification of WC3, and League of Legends eventually became a spinoff of Dota itself. That's why the games are so strikingly similar - at least on the surface. Over the years, the games have evolved in different directions with a lot of small in-game elements and mechanics. The Dota 2 vs LoL debate is still ongoing."
    },
    {
        "title": "Dota 2 | GosuGamers",
        "content": "Dota 2 25/11/2021, 17:00 Pandoradota2 Top 5 offlaners in pubs from the past month for Dota 2 patch 7.30 Dota 2 24/11/2021, 02:50 Gopya"
    },
    {
        "title": "DotA 2 | VS Battles Wiki | Fandom",
        "content": "Defense of the Ancients (DotA) was originally a multiplayer online battle arena mod for the video game Warcraft III: Reign of Chaos and its expansion, Warcraft III: The Frozen Throne, based on the \"Aeon of Strife\" map for StarCraft. The sequel DotA 2 was picked up by Valve. The scenario objective is for each team to destroy the opponents' Ancient, heavily guarded structures at opposing corners ..."
    },
    {
        "title": "[Dota 2 Live] Boom Esports VS Polaris - BTS Pro Series S9 ...",
        "content": "Saweria: https://saweria.co/ANONIMBracket: https://liquipedia.net/dota2/BTS/Pro_Series/9/Southeast_AsiaDiskusi grup burung : https://www.facebook.com/groups/..."
    },
    {
        "title": "Arcane vs dragons blood : DotA2",
        "content": "Dota fans might not like it, but I think Arcane is a much better show. The animation quality is way above anything I have seen in most animated work and the plot is very engaging. Not to mention a very human and engaging set of characters. Riot hit it out of the park. Do yourself a favour and stop worrying about this dota vs lol thing."
    },
    {
        "title": "[Dota 2 Live] Talon vs TWN ( You K) - DPC SEA OPEN ...",
        "content": "Saweria: https://saweria.co/ANONIMBracket: https://epulze.com/dota2/tournaments/73935/bracketDiskusi grup burung : https://www.facebook.com/groups/6906123846..."
    },
    {
        "title": "LOL vs Dota 2",
        "content": "dota 1 in yapımcıları ayrılıp lolü kurduktan sonra, valve potansiyeli görüp, lolden artan oyuncuları çekmek için dota2 kuruldu. lol vs dota2 \\- lol daha önce kuruldu. \\- lol'de kostümler daha ucuz dota2'de pahalı \\- lol'de yabancı toksikler yok (rus, brezilyalı, arap vs..) \\- lol daha çabuk öğreniliyor \\- lol'de rekleksler daha önemli daha söylenecek çok şey var da hadi canınız sıkılmasın. &#x200B; hahhaha oyunun adı bile \"dota 2\", yancı olmak için doğmuş, yancılıktan h..."
    },
    {
        "title": "OG - Liquipedia Dota 2 Wiki",
        "content": "OG was created as the new team of former (monkey) Business players. The team's breakthrough came at the Frankfurt Major in late November, 2015. They fought through the lower bracket, defeating TI5 champions Evil Geniuses and runner-ups CDEC Gaming. By winning the 2017 Kiev Major, OG became the first team in Dota 2 history to win four Dota Major Championships."
    },
    {
        "title": "Virtus.pro vs HellRaisers on Dota 2 Dota Pro Circuit 2021 ...",
        "content": "01.12.2021 · Match statistics 5 Dec 2021 Virtus.pro vs HellRaisers on Dota 2 Dota Pro Circuit 2021/2022 Tour 1."
    },
    {
        "title": "Laws of the Dota Universe according to the show VS Dota 2 lore (contains SPOILERS!)",
        "content": "The show starts with an introduction explaining how Radiant (thought) and Dire (action) are the remnants of a single primordial mind, then reveals Terrorblade's plan to remake the universe by fusing Radiant and Dire back together. Now according to Invoker's monologue from episode 6 (at 7:47) the \"mortal\" realm is right in the middle, nested between seven hells and seven heavens. This already slightly contradicts with Dota 2's lore, where the mortal realm is supposed to be part of the Seven Pla..."
    },
    {
        "title": "Root - Dota 2 Wiki",
        "content": "Root (formerly known as Ensnare and Entangle) is a status effect that prevents affected units from moving, and from casting most mobility spells. Root does not prevent a unit from moving by setting its movement speed to 0. It instead impairs movement in the same way as stuns do. They do not interrupt the move order either, so that the unit resumes moving towards its destination as soon as the ..."
    },
    {
        "title": "Among Us vs Dota 2 [SFM]",
        "content": ""
    },
    {
        "title": "Dota 2 VS Dota 1 AFTER 10 YEARS! - YouTube",
        "content": "Submit your Tricks/Replays here: https://docs.google.com/forms/d/e/1FAIpQLSe6MOJdQLQUvUCh3-s1D6K_XVTI4vIUU_cim8-r4Pn-gZ69Lw/viewform"
    },
    {
        "title": "CSGO players vs Dota 2 players",
        "content": "I’ve been scrolling past a lot of CSGO and Dota posts lately and one thing i’ve noticed in r/CSGO is that there’s a lot of clips from players that feature good plays and when asked their rank its often very high (lems , supremes and globals). But in r/Dota2 most of the clips come from players of low ranks like Crusaders/Legends , rarely the average/mediocre ranks Ancient/Divines(and ofc 0 immortals) and in the comments as well. Are CSGO players just better at games or is it because Dota 2 is s..."
    },
    {
        "title": "DOTA vs Dota 2: Valve and Blizzard go to war | PC Gamer",
        "content": "DOTA vs Dota 2: Valve and Blizzard go to war. Never mind the fuss over Scrolls/The Elder Scrolls - if you want trademark confusion, look to DOTA. To recap. There's the original DOTA, aka Defense ..."
    },
    {
        "title": "[Academic] League of Legends vs DOTA 2 (Gamers)",
        "content": "This is a survey for my Data Analytics class. Responses will not require an email address. Thank you for taking the time out of your day to do this survey! https://docs.google.com/forms/d/e/1FAIpQLSfu1g4wJAc50tB2Hq-AZQRJ8v1KsHRQav_a08KwSRvguQKmOg/viewform?usp=sf_link"
    },
    {
        "title": "OpenAI Five vs Dota 2 Explained - YouTube",
        "content": "How did OpenAI's team of 5 neural networks manage to beat some of the world's best DOTA 2 players? Also, why would OpenAI dedicate so much time and energy to..."
    },
    {
        "title": "[Repost][Academic] League of Legends vs DOTA 2 (Gamers)",
        "content": ""
    },
    {
        "title": "League of Legends vs Dota 2 player count: Is League of ...",
        "content": "Dota 2. Dota 2 was released in 2013 as a sequel to the original Defense of the Ancients.Published by Valve, this gives us the benefit of all the player data from Steam, to give us an idea of its popularity.At the time of writing, Dota 2 was the second most popular game on Steam, behind CSGO, with peak players in the last 30 days of 672,307, and an all time high of 1.29 million concurrent players."
    },
    {
        "title": "CS:GO vs Dota 2: Does Valve Really Have a Favourite Child?",
        "content": ""
    },
    {
        "title": "League of Legends vs Dota 2",
        "content": "All champions vs heroes 1. Lorefeats 2. Game stats"
    },
    {
        "title": "League of Legends vs Dota 2: Which MOBA Game Is Better?",
        "content": "Dota 2 continues to be hindered by a toxic supremacist community but if you're counting on this game dying any time soon, you'll have to wait a lot longer since it hasn't reach a decline in popularity just yet. 5. Esports Environment. League of Legends vs Dota 2 is the biggest competition in terms of esports' MOBA community."
    },
    {
        "title": "[TOMT] [Video] A meme video comparing the teamwork in rainbow six siege hostage rescue vs dota 2",
        "content": "I remember watching a funny video that pokes fun at dota 2's chaotic or lack of teamwork. It starts out with a fps game (I think it was rainbow six seige but not sure) that shows coordination between team players and then it cuts to dota 2 that shows the complete opposite of teamwork. As a regular dota 2 player I found it pretty funny. Want to show my other mates but I can't seem to find the video. Help!"
    },
    {
        "title": "Potato PC vs DotA 2 Error",
        "content": "Umm hello again, i think... im back again with another annoying and confusing problem. So yesterday around 1 am my time, i had a problem with my dota. The problem is not the entire game i think, because i can open the game with 0 error. But when i want to play with my friends its keep disconnecting me from the lobby, and make me have to wait around 1 hour bcs of the punishment (lol its sound weird but i forget what its called). Another problem is i cant watch my friends game, even i cant see t..."
    },
    {
        "title": "League of Legends Vs. Dota 2 - Esports Home",
        "content": "Dota 2. Starting off with the sequel of the original Dota, Dota 2, in its essence, is the spiritual successor of the original, the community created Dota, and was released in 2013. Now, Dota 2, despite being the successor, is quite different from the original community Mod, and due to some legal reasons, Valve was not able to carry some niches ..."
    },
    {
        "title": "League of Legends vs Dota 2",
        "content": "Hi guys, I recently had to say farewell to my 10 years old LoL account. I was wondering on if I should make a new account or just quit the game for good, and try out Dota 2, and if everything goes smooth, maybe make Dota 2 my everyday game. I was wondering what the community thinks about the two. I know there are tons of comparison on many websites but wanted to hear it from myself. Cn I LoL player become good at/used to Dota 2 if started from the beginning. I know I will never be able to forge..."
    },
    {
        "title": "Counter Strike VS Dota 2: Let's Compare ...",
        "content": "Dota 2; This game is an independent extenuation of Dota, which in its turn was a part of Warcraft. Dota 2 came out in 2013 and became very popular. It is a real- time online strategy which is based on two teams' competition. World of Dota 2 is magical and you can play for definite hero who has certain special abilities to develop further."
    },
    {
        "title": "DOTA vs DOTA 2",
        "content": ""
    },
    {
        "title": "Pollywog Games | Dota 2 vs. League of Legends: Gameplay ...",
        "content": "Dota 2 vs. League of Legends: Gameplay Differences. JanPaul Bergeson. June 26, 2018. League of Legends and Dota 2 players are constantly talking trash about each other's game. They did, after all, come from the same game. The generally held consensus is that League of Legends is a simplified version of Dota, but few players can actually name ..."
    },
    {
        "title": "DotA vs Dota 2 Models: Dire Agility Heroes",
        "content": ""
    },
    {
        "title": "League of Legends VS Dota 2 - BUFF",
        "content": "The fact that DOTA 2 does not have a paywall makes it the easy alternative for others, whilst some will look at the rules of the game and make a judgement about what they consider is the best game. DOTA 2 boasts a steep learning curve, though it is very easy to pick up on League of Legends. Although this can sound like a downside on the part of ..."
    },
    {
        "title": "DOTA 1 vs DOTA 2 Hero Model Comparisons",
        "content": ""
    },
    {
        "title": "OpenAI Five",
        "content": "At OpenAI, we've used the multiplayer video game Dota 2 as a research platform for general-purpose AI systems. Our Dota 2 AI, called OpenAI Five, learned by playing over 10,000 years of games against itself. It demonstrated the ability to achieve expert-level performance, learn human-AI cooperation, and"
    },
    {
        "title": "WC3 Reforged Dota 1 VS Dota 2 (Strength Heroes)",
        "content": ""
    },
    {
        "title": "Dota 2 vs Fortnite : DotA2 - reddit",
        "content": "Dota 2 vs Fortnite. Okay Ive been playing Dota2 for about 5 years now, not sure how many hours ive sunk into this game and at this point im too afraid to look. My point being, I played this game ALOT. For about 3 months now Ive kinda lost my drive to play. It might have to do something with alot of my friends leaving the game but thats not just it."
    },
    {
        "title": "[D] OpenAI 5 vs DOTA 2 World Champions happening now!",
        "content": "First game is over, but I won't spoil it :) livestream: [https://www.twitch.tv/openai](https://www.twitch.tv/openai) &#x200B; EDIT: top comment is a spoiler, just a heads up"
    },
    {
        "title": "Hokori vs Lava Dota 2, Nov 07, 2021 - Live Stream, Score ...",
        "content": "On 07 Nov 02:10 (UTC) (in 4 weeks) within Regular Stage of the BTS Pro Series Season 9 Americas Dota 2 Tournament Hokori and Lava will play a fight. Team HKR (rank #35) is 6 places above Lava (rank #41). Teams had no previous encounters. HKR current winrate is 70.00% against Lava's 50.00%. The favorite for this one looks to be Lava with maximum ..."
    },
    {
        "title": "Dark stars and Cosmics skins(League of Legends) vs Dota 2 S-tier",
        "content": "All Dark star and Cosmic characters vs Dota 2 S tiers, aka the Fundamentals, Weaver, Oracle, Outworld devourer, Elder titan, Arc warden, Ancient Apparition, Faceless Void, and Spectre. Lore feats used. https://vsbattles.fandom.com/wiki/Thresh https://vsbattles.fandom.com/wiki/Jhin https://vsbattles.fandom.com/wiki/Ashe_(League_of_Legends) https://vsbattles.fandom.com/wiki/Oracle https://vsbattles.fandom.com/wiki/Weaver Some links of their powers, feel free to add on if you like. Takes pla..."
    },
    {
        "title": "DotA 2 vs HotS - The Definitive Comparison - GamerWelfare",
        "content": "DotA 2 vs HotS - The Definitive Comparison. This comparison is gonna be on the more amusing side, due to Defense of the Ancients 2 (DotA 2) being based on Defense of the Ancients, which was built on Blizzard's Warcraft 3 servers, the same Blizzard who develops Heroes of the Storm (HotS). In fact, you will find that most of DotA's Heroes ..."
    },
    {
        "title": "DotA vs DOTA 2 | HIVE",
        "content": "As for the whole DotA vs DotA 2 thing: DotA 2 will never be popular if DotA was never made. So to those who say that DotA is old and its less than DotA 2, please respect DotA. BlinkBoy. BlinkBoy. Level 20 Joined Nov 11, 2004 Messages 1,985. Resources: 14. Resources"
    },
    {
        "title": "Invictus Gaming vs OG Dota 2, Oct 10, 2021 - Live Stream ...",
        "content": "Oct 10, 2021 iG vs OG (TI10) Dota 2 Match. All Invictus Gaming OG match info - livescore, results, lineups, encounters, history, analytics"
    },
    {
        "title": "OG vs Virtus.pro: Upcoming Dota 2 Matches: Win Rates ...",
        "content": "Dota 2: OG vs Virtus.pro teams head to head comparison: schedule, recent esports results, full match history, odds and other statistics."
    },
    {
        "title": "Dota 2 - Twitch",
        "content": "2 hours ago — Dota 2 is a multiplayer online battle arena video game and the stand-alone sequel ... LIVE: OG vs Team Liquid - DPC WEU Winter Tour - DreamLeague Season 16."
    },
    {
        "title": "League of Legends vs. Dota 2",
        "content": "Sep 26, 2021 — But generally, League of Legends tends to have a younger audience than Dota 2. As an older title, Dota 2 has amassed years and years of ..."
    },
    {
        "title": "Should I play League of Legends or Dota 2? - Quora",
        "content": "1. Graphics-:Dota2 has better graphics than Lol. · 2. Player pool-:Lol has 134 champions while dota has around 112 heroes. So lol is more vast wrt hero pool. · 3.68 answers · 299 votes: Im a DOTA 2 player (1955 hours) but i recently have dabbled a bit in League of Legends (87 ..."
    },
    {
        "title": "Dota 2 vs. League of Legends - A beginner´s guide by Germia",
        "content": "That´s one of the reasons, jungling (having a hero, that fights against neutral monsters in forest) is so much more important in LoL than in Dota 2. There are ..."
    },
    {
        "title": "League of Legends VS Dota 2 - BUFF",
        "content": "To sum up, DOTA 2 will opt for a player who prefers sluggish and complicated gameplay, while League of Legends will opt for a player who prefers quicker ..."
    },
    {
        "title": "Liquipedia:Upcoming and ongoing matches",
        "content": "4 hours ago — December 8, 2021 - 07:00 PST ​14h 59m 54s -. Dota 2 Champions League 2021 Season 6. D2CL 2021 Season 6 · CF · Chicken Fighters. 1:0 ... vs. ( Bo3 )."
    },
    {
        "title": "Vengeful Spirit - Ranged, Disabler, Escape, Initiator, Nuker ...",
        "content": "7 hours ago — 2Runes. 26/55/87LH @ 10/20/30 ... Yangon Galacticos vs Polaris Esports. BTS Pro Series 9 ... Dota 2 is a registered trademark of Valve Corporation."
    },
    {
        "title": "Dota 2 vs LOL: Ceb seems to have an answer to the Eternal ...",
        "content": "Oct 25, 2021 — Dota 2 professional player Sebastian “Ceb” Debs has posted a video on social media stating his stance on Dota 2 versus League of Legends."
    },
    {
        "title": "Official DotA Downloads",
        "content": "Official DotA Allstars downloads. DotA is an RTS/RPG hybrid primarily focused on team vs team based combat. While it has a bit of learning curve, the game has ..."
    },
    {
        "title": "LoL vs Dota 2 communities | Dota2 funny, Dota 2, Lol - Pinterest",
        "content": "Dota 2 - The most-played game on Steam.Every day, millions of players worldwide enter battle as one of over a hundred Dota heroes. And no matter if it's ..."
    },
    {
        "title": "Dota 1 vs. Dota 2 : r/DotA2 - Reddit",
        "content": "I don't think new players realise how much Dota has changed over the years. So, fellow ex-Dota1 players what are your fondest memories of Dota 1…"
    },
    {
        "title": "Team V (V Gaming) Dota 2, roster, matches, statistics - ggScore",
        "content": "V Roster: Naive-, hAze, destroyed, antoha, ArrOw.Matches: 117 / 122Record lose streak: 5 lose 1y agoRecord win streak: 12 wins 5m agoWin Rate: 67% / 64%"
    },
    {
        "title": "Dota 2 versus League of Legends - Different yet the same?",
        "content": "Where the term ARTS tells us that Dota 2 is supposed to be a game where strategy is very important. The term MOBA that League of Legends uses ...Feb 4, 2021 · Uploaded by VideoGamerTV"
    },
    {
        "title": "Dota 2 vs LoL: What are the Differences? - Bitspawn Network",
        "content": "Dota 2 vs LoL: Differences in the Game ... When you open the game, you'll see two very different types of graphics. League of Legends is colorful, ...Jun 8, 2021"
    },
    {
        "title": "Breaking down the comparison between Dota 2 and League ...",
        "content": "Apr 7, 2020 — Dota 2 items generally tend to offer players more than those in League of Legends. Items like Force Staff and Blink Dagger offer incredible ..."
    },
    {
        "title": "Fortnite vs Dota 2 - Prize Pools & Players Compared - Esports ...",
        "content": "Fortnite vs Dota 2: $168441461.13 difference in prize money, detailed side-by-side comparison of prize pools, tournaments, players and countries."
    },
    {
        "title": "League of Legends vs Dota 2 - Which Community Is More ...",
        "content": "Aug 18, 2021 — We ask the important questions. ➤ Which is more toxic Dota or LoL? Is the Dota 2 community better than LoL? ⬆ We then we flame both sides."
    },
    {
        "title": "A comprehensive comparison of Dota 2 and League of Legends",
        "content": "Jul 9, 2013 — The distinction between the two types of gold is reason enough to declare that Dota 2 is a far more punishing game. At the same time, getting ..."
    },
    {
        "title": "CS:GO vs Dota 2: Does Valve Really Have a Favourite Child?",
        "content": "Dec 10, 2020 — Whether it is Valve's tournament prize pools, updates to the game, match fixing bans or the disinterest from Gaben, the consensus amongst ..."
    },
    {
        "title": "A comprehensive comparison of Dota 2 and League of Legends",
        "content": "Jul 9, 2013 — The distinction between the two types of gold is reason enough to declare that Dota 2 is a far more punishing game. At the same time, getting ..."
    },
    {
        "title": "CS:GO vs Dota 2: Does Valve Really Have a Favourite Child?",
        "content": "Dec 10, 2020 — Whether it is Valve's tournament prize pools, updates to the game, match fixing bans or the disinterest from Gaben, the consensus amongst ..."
    },
    {
        "title": "The best games like LoL – all the best MOBAs on PC",
        "content": "Nov 22, 2021 — The title of 'best MOBA game' is a hotly contested one, and often reduced to two warring champions: League of Legends and Dota 2."
    },
    {
        "title": "Dota 2 vs. League Of Legends: Which Is Better? - TheGamer",
        "content": "Mar 8, 2021 — The only downside to Dota 2 is that it isn't the freshest and, even though it's free, finding random people to join you is much harder due to ..."
    },
    {
        "title": "Vengeful Spirit DOTA 2 Hero Guides on DOTAFire",
        "content": "Wave of Terror. Vengeful Spirit lets loose a wicked cry, weakening the armor of enemies and giving vision of the... Vengeance Aura.Damage: 41 - 49INT: 64 at 30 (19 + 1.5/level)Health: 1960 at 30AGI: 116 at 30 (20 + 3.2/level)"
    },
    {
        "title": "League of Legends vs Dota 2 player count - Stealth Optional",
        "content": "Jun 1, 2021 — In the Multiplayer Online Battle Arena, is League of Legends more popular than Dota 2? Find out which game is the top dog in our report."
    },
    {
        "title": "DOTA 2 (@DOTA2) / Twitter",
        "content": "Support your favorite Dota Pro Circuit (DPC) teams! Bronze Supporters Club bundles and Fantasy team card packs are now available for teams that have ..."
    },
    {
        "title": "Dota 2 - Steam Charts",
        "content": "MonthAvg. PlayersGain% GainPeak PlayersLast 30 Days430,414.7‑18,445.8‑4.11%718,658November 2021448,860.5‑1,900.9‑0.42%747,506October 2021450,761.4+59,679.4+15.26%752,482View 111 more rows"
    },
    {
        "title": "Dota 2 vs. League of Legends: Updating the numbers - Critical ...",
        "content": "Sep 22, 2016 — DOTA2 system encourages you to be the best. LOL system helps you become one of the best. Eventually DOTA2 will even out pools among pros when ..."
    },
    {
        "title": "Guide :: CS:GO Ranks vs Dota 2 MMR - Steam Community",
        "content": "Jun 11, 2015 — Comparison table: Counter-Strike:Global Offensive Ranks with Dota 2 MMR..."
    }
]