[
    {
        "title": "Dota 2 vs. League Of Legends: Which Is Better?",
        "content": "The only downside to Dota 2 is that it isn't the freshest and, even though it's free, finding random people to join you is much harder due to its slightly more cult-like audience. League of Legends didn't start the genre, but it proved how successful it could be. The game has expanded massively among both casual and competitive players."
    },
    {
        "title": "History of Woman Suffrage/Volume 3/Chapter 43",
        "content": ""
    },
    {
        "title": "crit",
        "content": ""
    },
    {
        "title": "Mirad Grammar/Vocabulary Formation",
        "content": ""
    },
    {
        "title": "Dota 2 | GosuGamers",
        "content": "Dota 2 25/11/2021, 17:00 Pandoradota2 Top 5 offlaners in pubs from the past month for Dota 2 patch 7.30 Dota 2 24/11/2021, 02:50 Gopya"
    },
    {
        "title": "League of Legends vs Dota 2 - GamerzClass",
        "content": "So to sum up, a player who prefers slow and complex gameplay will opt for DOTA 2, while a player who prefers faster gameplay and simplified mechanics will opt ..."
    },
    {
        "title": "League of Legends vs. Dota 2 - Key Differences - LeagueFeed",
        "content": "Sep 26, 2021 — Now, the playable characters in both of these games are termed differently. LoL has its champions, and Dota 2 has its heroes. When you first ...‎The Key Differences Between... · ‎Design · ‎Heroes and Champions · ‎Gameplay"
    },
    {
        "title": "endow",
        "content": ""
    },
    {
        "title": "Mirad Grammar/print version",
        "content": ""
    },
    {
        "title": "Davion, the Dragon Knight (DOTA 2) vs Shyvana, the Half-dragon (LOL)"
    },
    {
        "title": "Dota 2 vs genshin Impact"
    },
    {
        "title": "Biggest Esports Prize Pool | Dota 2 vs Fortnite vs LoL vs CS:GO"
    },
    {
        "title": "Biggest Esports Prize Pool | Dota 2 vs Fortnite vs LoL vs CS:GO"
    },
    {
        "title": "Dota 2 vs CS:GO - Does Valve have a favorite child?"
    },
    {
        "title": "Dota 2 vs CS:GO"
    },
    {
        "title": "LoL vs Dota 2 vs steel beam"
    },
    {
        "title": "Versus Screens - Dota 2 Wiki",
        "content": "Custom Versus Screens alter the video appearance of the screen shown in the pre-game sequence."
    },
    {
        "title": "LoL vs. Dota 2 | League of Legends and Dota 2 comparison",
        "content": "LoL vs Dota 2: Game mechanic differences Despite having similar traits, a few key differences stand out across both games when it comes to the game mechanics. For example, in LoL, a Champion can turn and move instantly when the player right clicks, however, in Dota 2, players must wait for the animation to play of the Hero rotating before the ..."
    },
    {
        "title": "Mirad/Print version",
        "content": ""
    },
    {
        "title": "[Dota 2 Live] Boom Esports VS Polaris - BTS Pro Series S9 ...",
        "content": "Saweria: https://saweria.co/ANONIMBracket: https://liquipedia.net/dota2/BTS/Pro_Series/9/Southeast_AsiaDiskusi grup burung : https://www.facebook.com/groups/..."
    },
    {
        "title": "DotA 2 | VS Battles Wiki | Fandom",
        "content": "Defense of the Ancients (DotA) was originally a multiplayer online battle arena mod for the video game Warcraft III: Reign of Chaos and its expansion, Warcraft III: The Frozen Throne, based on the \"Aeon of Strife\" map for StarCraft. The sequel DotA 2 was picked up by Valve. The scenario objective is for each team to destroy the opponents' Ancient, heavily guarded structures at opposing corners ..."
    },
    {
        "title": "Cultural Anthropology/Print version",
        "content": ""
    },
    {
        "title": "Dota 2 Ranks List - The Ultimate MMR Table (MMR RANKS)",
        "content": "29.01.2019 · Dota 2 Ranks are connected to the MMR Height: Behind every rank, there is an ELO calculation.In Dota 2 this means, the MMR that is split into support and core MMR is calculated and you get the rank for that MMR number. Update: MMR is split into a single rank with role performance now.. By working with this ranking table you can always have a look which MMR …"
    },
    {
        "title": "Should I play League of Legends or Dota 2? - Quora",
        "content": "1. Graphics-:Dota2 has better graphics than Lol. · 2. Player pool-:Lol has 134 champions while dota has around 112 heroes. So lol is more vast wrt hero pool. · 3.68 answers · 299 votes: Im a DOTA 2 player (1955 hours) but i recently have dabbled a bit in League of Legends (87 ..."
    },
    {
        "title": "Dota 2 vs LoL : Is Dota 2 Harder Than LoL? Settling the Debate",
        "content": "Dota 2 also has a brutal death timer than can easily last more than a minute, making the risk of doing plays even higher. Winner: Dota 2 (by a hairline) Who Wins . Dota 2 takes the cake for being a tougher game to master. But by no means does that mean that LoL is automatically a bad game."
    },
    {
        "title": "[Dota 2 Live] Army Geniuses vs OB Neon - BTS Pro Series S9 ...",
        "content": "Saweria: https://saweria.co/ANONIMBracket: https://liquipedia.net/dota2/BTS/Pro_Series/9/Southeast_AsiaDiskusi grup burung : https://www.facebook.com/groups/..."
    },
    {
        "title": "Dota 2 - Twitch",
        "content": "2 hours ago — Dota 2 is a multiplayer online battle arena video game and the stand-alone sequel ... LIVE: OG vs Team Liquid - DPC WEU Winter Tour - DreamLeague Season 16."
    },
    {
        "title": "Dota 2 vs. Heroes of the Storm: Which MOBA is right for ...",
        "content": "Dota 2 vs. Heroes of the Storm: Which MOBA is right for you? The multiplayer online battle arena genre of games is tough to get into, but whether you choose a classic or modern version, the work ..."
    },
    {
        "title": "How can I see my MMR in Dota 2? (Quick Guide) 2021 Update",
        "content": "MMR stands for Match Making Rating, in Dota 2 it shows the progress of your Ranked matches and defines you as a beginner, moderate or professional player. To see your Dota 2 MMR check the following step by step guide: How to see your MMR …"
    },
    {
        "title": "Dota 2 versus League of Legends - Different yet the same?",
        "content": "Where the term ARTS tells us that Dota 2 is supposed to be a game where strategy is very important. The term MOBA that League of Legends uses ...Feb 4, 2021 · Uploaded by VideoGamerTV"
    },
    {
        "title": "Dota 2 vs LOL: Which MOBA Is For You | Robots.net",
        "content": "Of course, the Dota 2 vs LOL debate will require us to take a look at their differences. There are a lot of things that make each game unique from the other. Learning Curve. Let's talk about the learning curve between the two games. After all, this is a big factor in picking a side in the Dota 2 vs LOL debate."
    },
    {
        "title": "Dota 2 Offseason Roster Shuffle Tracker - Hotspawn",
        "content": "21.11.2021 · On October 20th, SG esports announced the release of its Dota 2 roster. This, according to their announcement, was a decision made by the players, and the organization wished them well. The team also announced it would be continuing in Dota 2 for the next season."
    },
    {
        "title": "Dota 2 ranks: ranking system explained, MMR, and more ...",
        "content": "Dota 2's ranking system might look complex from the outset, but it works just like any other competitive game out there. Ranked will need to be unlocked over time by new players by playing 100 hours worth of casual games, but after that, the grind can begin."
    },
    {
        "title": "[Top 10] Dota 2 Best Support Heroes | GAMERS DECIDE",
        "content": "22.01.2020 · Support heroes in DotA 2 can be quite satisfying to pull off right, even if it can be a thankless and drudging job sometimes. However, as the saying goes, a job well done is its own reward, and it can be extremely satisfying to outplay the enemy support, whether it’s in warding or play-making."
    },
    {
        "title": "Dota 2 vs. LoL: Where the real money is made",
        "content": "The best LoL players are sooooo good, some even reach high ranks in competitive games like League of Legends. Some can play LoL at a master level, but many are below 4.5k MMR But the majority of LoL players play Dota 2 at a master level. And some play it like a god. You can be a good LoL player, but you are not as good as a good Dota 2 player. The reason? Dota 2 has better items and more heroes. It also has better heroes. The game is also free, and more people play it. And if you compare LoL ..."
    },
    {
        "title": "Dota 2 OpenGL vs. Dx9 vs. Dx11 vs. Vulkan - YouTube",
        "content": "Dota 2 Gameplay Benchmark. GeForce GTX 1060 6GB. Processor i7-6800K 4.2GHz. Graphics settings: Ultra (Max) | Resolution: 1920x1080 | Grab games here: http://..."
    },
    {
        "title": "The International (Dota 2) vs World Championship (LoL)",
        "content": "The debate between which game is better has always divided the gaming community. However looking at recent data, LoL daily active players has jumped from 3.5 million to a stunning 11 million between 2019 and end of 2020. Dota 2 however has been more consistent with an average of 600K players a day at peak in the last years. Tencent owns LoL and professional players in the LoL community tend to be more located in Asia compared to Valve with HQ in Seattle has a more distributed professional core..."
    },
    {
        "title": "Dota 2 - Wikipedia",
        "content": "Dota 2 is a multiplayer online battle arena (MOBA) video game developed and published by Valve.The game is a sequel to Defense of the Ancients (DotA), which was a community-created mod for Blizzard Entertainment's Warcraft III: Reign of Chaos. Dota 2 is played in matches between two teams of five players, with each team occupying and defending their own separate base on the map."
    },
    {
        "title": "DOTA 2 VS LOL",
        "content": "Come talk about Dota 2 with me It's my safe place what about you guys Not alot of people play Dota 2 unfortunately [https://twitch.tv/cielthedazzler](https://twitch.tv/cielthedazzler)"
    },
    {
        "title": "Vengeful Spirit - Dota 2 Wiki",
        "content": "Vengeful Spirit's fun name, \"820\", is a tribute to former professional DotA player 820. In DotA 1, she was the sister of Mortred, the Phantom Assassin, and her name was Shendelzare Silkwood. In Dota 2, her lore was changed so that she became affiliated with the Skywrath, thus switching her affiliations to Dragonus, the Skywrath Mage."
    },
    {
        "title": "Dota 2 vs Smite",
        "content": "Which MOBA game do you recommend? I know it's played different so it's for different players. Dota is top down view while Smite is third person afterall. That being that I would still like to know what you prefer. My standard isn't high so I wouldn't mind both playstyle. And with enough research it led to between Dota and Smite so I'm asking y'all instead now. In the Metacritic Smite won with way better reviews but that might have been cause Dota 2 didn't start out as well back in the day, and..."
    },
    {
        "title": "Dota 2 vs. League of Legends : gaming",
        "content": "Dota 2 is a bit harder than LoL since it has more mechanics (turn rate, denying, runes, etc) and I felt like the heroes were more balanced than the champions in LoL, but LoL was much easier for me to get into. Both are very hardcore games with a steep learning curve, but LoL seems a bit more casual than Dota 2."
    },
    {
        "title": "DOTA 2 vs league of legends (lol)",
        "content": "Hello everybody!! So I have decided to play an MOBA game but I have never played any MOBA game so can you pls help me decide which will be a better option for a new player !! Also can you tell me which one is easier to understand and not so complex."
    },
    {
        "title": "League of Legends vs Dota 2 player count: Is League of ...",
        "content": "Dota 2. Dota 2 was released in 2013 as a sequel to the original Defense of the Ancients.Published by Valve, this gives us the benefit of all the player data from Steam, to give us an idea of its popularity.At the time of writing, Dota 2 was the second most popular game on Steam, behind CSGO, with peak players in the last 30 days of 672,307, and an all time high of 1.29 million concurrent players."
    },
    {
        "title": "Dota 2 vs Smite",
        "content": "Which MOBA game do you recommend? I know it's played different so it's for different players. Dota is top down view while Smite is third person afterall. That being that I would still like to know what you prefer. My standard isn't high so I wouldn't mind both playstyle. And with enough research it led to between Dota and Smite so I'm asking y'all instead now. In the Metacritic Smite won with way better reviews but that might have been cause Dota 2 didn't start out as well back in the day, and..."
    },
    {
        "title": "League of Legends vs Dota 2 - Which Community Is More Toxic?",
        "content": "Dota 2, just like League of Legends, is a complex MOBA game played in a team vs team format. It also involves people emotionally, like watching Schindler's List for the first time level of emotional reponse."
    },
    {
        "title": "DOTA 2 vs CHICAGO BULLS 1995-98",
        "content": ""
    },
    {
        "title": "Dota 2 VS Dota 1 AFTER 10 YEARS! - YouTube",
        "content": "Submit your Tricks/Replays here: https://docs.google.com/forms/d/e/1FAIpQLSe6MOJdQLQUvUCh3-s1D6K_XVTI4vIUU_cim8-r4Pn-gZ69Lw/viewform"
    },
    {
        "title": "Dota 2 vs Lol",
        "content": "Dota 2'yi seçenler neden dota 2'yi seçtiklerini,lolü seçenler de neden lolü seçtiklerini yorumlara yazarsa müteşekkir olurum. [View Poll](https://www.reddit.com/poll/ltz8ai)"
    },
    {
        "title": "OpenAI Five",
        "content": "At OpenAI, we've used the multiplayer video game Dota 2 as a research platform for general-purpose AI systems. Our Dota 2 AI, called OpenAI Five, learned by playing over 10,000 years of games against itself. It demonstrated the ability to achieve expert-level performance, learn human-AI cooperation, and"
    },
    {
        "title": "monkey king(dota 2) vs kid goku",
        "content": "round 1 21 budokai goku vs level 15 monkey king round 2 22 budokai goku vs level 30 monkey king round 3 22 budokai goku vs level 30 monkey king with full item support"
    },
    {
        "title": "Neptune Gaming vs ShenZhen on Dota 2 Dota Pro Circuit 2021 ...",
        "content": "Match statistics 3 Dec 2021 Neptune Gaming vs ShenZhen on Dota 2 Dota Pro Circuit 2021/2022 Tour 1."
    },
    {
        "title": "Dota 2 Vs Lol hero release since 2017. Lol almost has as many in 2020 as Dota from 2017!",
        "content": ""
    },
    {
        "title": "Pollywog Games | Dota 2 vs. League of Legends: Gameplay ...",
        "content": "Dota 2 vs. League of Legends: Gameplay Differences. JanPaul Bergeson. June 26, 2018. League of Legends and Dota 2 players are constantly talking trash about each other's game. They did, after all, come from the same game. The generally held consensus is that League of Legends is a simplified version of Dota, but few players can actually name ..."
    },
    {
        "title": "Dota 2 vs LoP lore comparison: Which is better??",
        "content": "Which is more detailed and cooler in your opinion?? For me I find that Dota focuses more on cosmic beings and abstracts while League's is limited to their planet and its politics. If they fought who do u think would win lorewise??"
    },
    {
        "title": "Choose My MOBA: LoL vs. Dota 2 vs. SMITE | Massively ...",
        "content": "I've also experienced more waiting times in Dota 2 than in League of Legends, and it can be frustrating to see your match queue stuck on 9/10 when you've got limited play time. This isn't particularly surprising given that Dota 2's population lags far behind League's (nearly 8 million per month in May of 2015 as opposed to LoL's 67 ..."
    },
    {
        "title": "EPIC MOBA SHOWDOWN # DOTA 2 VS LOL",
        "content": "Dota'nın pek şansı yok ama burası kgb umut var! [View Poll](https://www.reddit.com/poll/kk41uh)"
    },
    {
        "title": "League of Legends vs Dota 2: Which MOBA Game Is Better?",
        "content": "Dota 2 continues to be hindered by a toxic supremacist community but if you're counting on this game dying any time soon, you'll have to wait a lot longer since it hasn't reach a decline in popularity just yet. 5. Esports Environment. League of Legends vs Dota 2 is the biggest competition in terms of esports' MOBA community."
    },
    {
        "title": "Dota 2 vs LOL",
        "content": "Does Dota 2 have rune pages? Are there five roles as well in Dota 2? Are heros sort of grouped into top/mid/bot/ADC/support/jungle types of heroes? Do you need to select Roles when queueing? Are there seperate ranks for each roles?"
    },
    {
        "title": "Dota 2 vs LoL: What are the Differences? - Bitspawn",
        "content": "Dota was a modification of WC3, and League of Legends eventually became a spinoff of Dota itself. That's why the games are so strikingly similar - at least on the surface. Over the years, the games have evolved in different directions with a lot of small in-game elements and mechanics. The Dota 2 vs LoL debate is still ongoing."
    },
    {
        "title": "DotA 2 vs DotA (1) heroes",
        "content": "Has Valve added in all the heroes from the original DotA? Have they added in any new heroes beyond what DotA 1 had?"
    },
    {
        "title": "DotA 2 vs League of Legends: best MOBA game? - netivist",
        "content": "DotA 2 vs LoL which is the best MOBA game? Vote and tell us why. DotA 2 vs League of Legends. Multiplayer online battle arena (MOBA) games have become increasingly popular over the last few years. This genre consists of a mix of action, real time strategy and cooperation among team-players."
    },
    {
        "title": "Dota 2 Vs LOL career in eSports for an AVG. Pro player.",
        "content": "From these 2 which one will have stable and good earning for an AVG. Pro player in eSports ?? And which of them will grow further in future ? Please predict and reply with logic"
    },
    {
        "title": "Team Liquid - Liquipedia Dota 2 Wiki",
        "content": "Team Liquid is a professional team, founded in the Netherlands in 2000. Originally a Brood War clan, the team switched to StarCraft II during the SC2 Beta in 2010, and became one of the most successful western teams. On December 6, 2012, it was announced that the team had formed a Dota 2 division. Team Liquid is also strongly associated with its website, TL.net. Launched on May 1, 2001, it has ..."
    },
    {
        "title": "outworld destroyer(dota 2) vs zatanna(dc comic)",
        "content": "Round 1. level 15 outworld vs zatanna round 2 level 30 outworld vs zatanna round 3 level 30 outworld with Aghanim,s Shard Aghanim,s specter and arcane blink battle in gotham city both in character who will win"
    },
    {
        "title": "The Lich (Adventure Time) VS Szass Tam (Forgotten Realms) VS The Lich King (WoW) VS Xykon (Order of the Stick) VS Voldemort (HP) VS Lich (Dota 2) VS Nagash (Warhammer)",
        "content": "Who wins in a battle between the most famous Liches that I could think of? Lame little list linking lots of lovely Lich lords! *** #The Liches: **[The Lich](https://www.reddit.com/r/respectthreads/comments/9dp6ha/respect_the_lich_adventure_time/)** from Adventure Time **[Szass Tam](https://www.realmshelps.net/npc/szass.shtml)** from The Forgotten Realms **[The Lich King](https://www.reddit.com/r/WhoWouldWinWorkshop/comments/92cebq/prototype_respect_arthas_menethil_the_lich_king/)** from..."
    },
    {
        "title": "T1 vs TNC Predator Dota 2, Dec 01, 2021 - Live Stream ...",
        "content": "On 01 Dec 08:07 (UTC) (9 hours ago) T1 will fight against TNC Predator in the Regular Stage of the 2021 BTS DPC Southeast Asia Winter: Division 1 Dota 2 Tournament Team T1 is ranked #10 among Dota 2 teams in CQ.Rating which is 7 places higher than TnC place #17. T1 match line-up is . TnC line-up is .. Teams had 9 encounters in the past, T1 won 2 times."
    },
    {
        "title": "DOTA 2 vs LOL vs WoW : which should I chose?",
        "content": "By the sounds of it these 3 games are similar, but I have never played these types of games so Which game should I invest my time into for entertainment? Any tips for starting out playing arena styled games?"
    },
    {
        "title": "CHILLAX vs Slot Seekers on Dota 2 Dota Pro Circuit 2021 ...",
        "content": "Match statistics 24 Nov 2021 CHILLAX vs Slot Seekers on Dota 2 Dota Pro Circuit 2021/2022 Tour 1."
    },
    {
        "title": "Nemiga vs Team Empire Dota 2, Nov 10, 2021 - Live Stream ...",
        "content": "On 10 Nov 12:03 (UTC) (3 weeks ago) Nemiga will fight against Team Empire in the Regular Stage of the 2021 Dota 2 Champions League S5 Dota 2 Championship Most of bookies agree that the team Team Empire will win a Match with maximum odd of 2.18 offered by Pinnacle.. Before this match team Nemiga had won over team Empire 4 times, while Team Empire had 9 victories over Nemiga."
    },
    {
        "title": "Is Dota 2 really harder than League of Legends?",
        "content": "DotA was obviously the prototype for Dota 2. More importantly, though, one of the lead developers in League of Legends , Steve 'Guinsoo' Feak, was a core part of the DotA Allstars community."
    },
    {
        "title": "League of Legends VS. Dota 2 - Which is Better? - Fonezie",
        "content": "In the comparison of Dota vs. League of Legends, it is safe to say Dota has been highlighted by some of the largest events ever held in the history of gaming. The Annual World Championship for Dota 2 is the largest tournament witnessed by the gaming world."
    },
    {
        "title": "Dota 2 - Twitch",
        "content": "Dota 2 is a multiplayer online battle arena video game and the stand-alone sequel to the Defense of the Ancients (DotA) mod. With regular updates that ensure a constant evolution of gameplay, features, and heroes, Dota 2 has taken on a life of its own."
    },
    {
        "title": "Dota 2 - Wikipedia",
        "content": "During a match players collect experience points and items for their heroes to successfully defeat the opposing team's heroes in player versus player combat. A ...Release: Windows; July 9, 2013; Linux‎, ‎OS X‎; ...‎Platform(s): Microsoft Windows; ‎Linux‎; ‎OS X‎Genre(s): MOBAEngine: Source 2"
    },
    {
        "title": "Dota 2 vs LoL: What are the Differences? - Bitspawn Network",
        "content": "Dota 2 vs LoL: Differences in the Game ... When you open the game, you'll see two very different types of graphics. League of Legends is colorful, ...Jun 8, 2021"
    },
    {
        "title": "Dota 2 vs LOL: Ceb seems to have an answer to the Eternal ...",
        "content": "Oct 25, 2021 — Dota 2 professional player Sebastian “Ceb” Debs has posted a video on social media stating his stance on Dota 2 versus League of Legends."
    },
    {
        "title": "Dota 2 vs. League Of Legends: Which Is Better? - TheGamer",
        "content": "Mar 8, 2021 — The only downside to Dota 2 is that it isn't the freshest and, even though it's free, finding random people to join you is much harder due to ..."
    },
    {
        "title": "Dota 2",
        "content": "Every day, millions of players worldwide enter the battle as one of over a hundred Dota Heroes in a 5v5 team clash. Dota is the deepest multi-player action RTS ..."
    },
    {
        "title": "Liquipedia:Upcoming and ongoing matches",
        "content": "4 hours ago — December 8, 2021 - 07:00 PST ​14h 59m 54s -. Dota 2 Champions League 2021 Season 6. D2CL 2021 Season 6 · CF · Chicken Fighters. 1:0 ... vs. ( Bo3 )."
    },
    {
        "title": "League of Legends VS Dota 2 - BUFF",
        "content": "To sum up, DOTA 2 will opt for a player who prefers sluggish and complicated gameplay, while League of Legends will opt for a player who prefers quicker ..."
    },
    {
        "title": "Dota 2 on Steam",
        "content": "... that ensure a constant evolution of gameplay, features, and heroes, Dota 2 has taken on a life of its own. ... Learn the ropes playing co-op vs. bots."
    },
    {
        "title": "DOTA 2 v/s League of Legends(in-depth comparison)",
        "content": "Maybe DOTA vs League, or PUBG vs Fortnite, or CS GO vs Call of Duty, etc. I'm a gamer that wants to try out as many games as possible and I've tried many ..."
    },
    {
        "title": "Dota 2 vs. League of Legends - A beginner´s guide by Germia",
        "content": "There are a lot of monsters in the forest, you can kill, that give you money and different abilities. That´s one of the reasons, jungling (having a hero, that ..."
    },
    {
        "title": "Dota 2 Match Schedule | GosuGamers",
        "content": "4 hours ago — Detailed calendar of all live, upcoming, and completed Dota 2 matches and their results. ... C Fighters vs CHILLAX. Dota Pro Circuit 2021/2022 Tour 1 ..."
    },
    {
        "title": "DOTA 2 vs LOL vs WoW : which should I chose? - Reddit",
        "content": "By the sounds of it these 3 games are similar, but I have never played these types of games so Which game should I invest my time into for…"
    },
    {
        "title": "Is Dota 2 really harder than League of Legends? - Sportskeeda",
        "content": "Jun 8, 2021 — Dota 2 and League of Legends are the two most-played MOBAs ever. ... DOTA 2 vs LOL: The Difference and The Similarities Between Dota2 and ..."
    },
    {
        "title": "OpenAI's Dota AI beats pro team OG as first AI to defeat ... - Vox",
        "content": "Apr 13, 2019 — In Dota 2, each team has five players, each player directing their own ... versions of the game — 1 player versus 1 instead of 5 versus 5, ..."
    },
    {
        "title": "What is the Difference Between League of Legends and Dota 2",
        "content": "Dota 2 also features Runes, though, but in a different way. Perhaps the most noticeable gameplay difference between League and Dota 2 is friendly fire. Yes, as ..."
    },
    {
        "title": "Dota 2 vs League of Legends - Prize Pools & Players Compared",
        "content": "Dota 2 vs League of Legends: $187118722.85 difference in prize money, detailed side-by-side comparison of prize pools, tournaments, players and countries."
    },
    {
        "title": "LoL vs Dota 2 communities | Dota2 funny, Dota 2, Lol - Pinterest",
        "content": "Dota 2 - The most-played game on Steam.Every day, millions of players worldwide enter battle as one of over a hundred Dota heroes. And no matter if it's ..."
    },
    {
        "title": "Face Off: Is League of Legends a better game than Dota 2?",
        "content": "Feb 27, 2013 — The \"my MOBA vs. your MOBA\" argument is a heated one, so we reached outside our walls to SOE game designer and former PC Gamer Senior Editor ..."
    },
    {
        "title": "Dota 2 vs. Heroes of the Storm: Which MOBA is right for you?",
        "content": "Jul 4, 2015 — Most MOBAs use similar gameplay elements to Dota 2: leveling heroes, buying items and managing your resources. But Blizzard decided to do ..."
    },
    {
        "title": "Ceb on Twitter: \"DotA2 vs LoL: THE ULTIMATE CONCLUSION ...",
        "content": "DotA2 vs LoL: THE ULTIMATE CONCLUSION. Embedded video. 1:06. 315.4K views. 6:15 PM · Dec 26, 2019·Twitter for iPhone."
    },
    {
        "title": "Dota 2 vs League of Legends - Prize Pools & Players Compared",
        "content": "Dota 2 vs League of Legends: $187118722.85 difference in prize money, detailed side-by-side comparison of prize pools, tournaments, players and countries."
    },
    {
        "title": "Dota 2 or LoL: Which MOBA is better? | EarlyGame",
        "content": "May 23, 2020 — Dota 2 oder League of Legends Dota 2 or League of Legends? Not such a tough decision after all. (Image credit: Valve Corporation/Riot Games)."
    },
    {
        "title": "Breaking down the comparison between Dota 2 and League ...",
        "content": "Apr 7, 2020 — Most champions take Flash as a standard because of the massive boost in mobility it offers. Roles in Dota 2 vs. League of Legends. Roles in ..."
    },
    {
        "title": "League of Legends vs Dota 2 player count - Stealth Optional",
        "content": "Jun 1, 2021 — In the Multiplayer Online Battle Arena, is League of Legends more popular than Dota 2? Find out which game is the top dog in our report."
    },
    {
        "title": "Dota 2 - Steam Charts",
        "content": "MonthAvg. PlayersGain% GainPeak PlayersLast 30 Days430,414.7‑18,445.8‑4.11%718,658November 2021448,860.5‑1,900.9‑0.42%747,506October 2021450,761.4+59,679.4+15.26%752,482View 111 more rows"
    },
    {
        "title": "Doublelift explains why League of Legends is harder than ...",
        "content": "Dec 23, 2019 — One of the most popular subjects is the fierce Dota 2 vs LoL rivalry, where fans want to prove their game is best. Usually, LoL pros stay ..."
    },
    {
        "title": "Difference Between Dota and Warcraft (With Table)",
        "content": "Difference Between Dota and Warcraft (With Table) ... Dota vs Warcraft ... which means that a 7-month player can easily beat-up a 2 years player, whereas, ..."
    }
]