[
    {
        "title": "Dota 2 on Steam",
        "content": "Valve. Released. Jul 9, 2013. Every day, millions of players worldwide enter battle as one of over a hundred Dota heroes. And no matter if it's their 10th hour of play or 1,000th, there's always something new to discover. With regular updates that ensure a constant evolution of gameplay, features, and heroes, Dota 2 has taken on a life of its own."
    },
    {
        "title": "Gabe Newell",
        "content": ""
    },
    {
        "title": "History of video games/Esports",
        "content": ""
    },
    {
        "title": "Birds of North and Middle America, part V/Genus 8. Dysithamnus Cabanis",
        "content": ""
    },
    {
        "title": "Dota",
        "content": ""
    },
    {
        "title": "Dota 2",
        "content": "Every day, millions of players worldwide enter the battle as one of over a hundred Dota Heroes in a 5v5 team clash. Dota is the deepest multi-player action RTS ...‎News · ‎Marci · ‎The Dota Pro Circuit 2021... · ‎Dota Patch Notes - 7.30e"
    },
    {
        "title": "Dota 2 vs. League Of Legends: Which Is Better?",
        "content": "The only downside to Dota 2 is that it isn't the freshest and, even though it's free, finding random people to join you is much harder due to its slightly more cult-like audience. League of Legends didn't start the genre, but it proved how successful it could be. The game has expanded massively among both casual and competitive players."
    },
    {
        "title": "League of Legends vs Dota 2 - GamerzClass",
        "content": "Complexity. DOTA 2 boasts a steep learning curve, while League of Legends is fairly easy to pick up on. While this might seem like a disadvantage on DOTA 2's part, the game's complexity makes it far more rewarding once you've put in the time to understand the game's mechanics and successfully execute some unusual builds and plays."
    },
    {
        "title": "Open individualism",
        "content": ""
    },
    {
        "title": "Long time lurker 👀 but feeling the self-confidence to post on here! Anyone here happen to play smite? Or games in the family like league or dota 2? Looking for fun teammates ☺️😃"
    },
    {
        "title": "Spotify #1 Gaming Playlist. Get hyped for your sessions in Valorant, Fortnite, Warzone, CS:GO, League of Legends, Fifa, PUBG or DOTA 2!"
    },
    {
        "title": "Tinker scripting or DOTA 2 mechanic fault?"
    },
    {
        "title": "Is it just me or DOTA 2 pops are underrated? They're heavy and have quality design. Best types of pops for out of box display."
    },
    {
        "title": "Lentis/Electronic Sports (eSports)",
        "content": ""
    },
    {
        "title": "Birds of North and Middle America, part V/Genus 13. Ramphocænus Vieillot",
        "content": ""
    },
    {
        "title": "dota",
        "content": ""
    },
    {
        "title": "League of Legends VS. Dota 2 - Which is Better? - Fonezie",
        "content": "In the comparison of Dota vs. League of Legends, it is safe to say Dota has been highlighted by some of the largest events ever held in the history of gaming. The Annual World Championship for Dota 2 is the largest tournament witnessed by the gaming world."
    },
    {
        "title": "Radiation Oncology/Radioimmunotherapy",
        "content": ""
    },
    {
        "title": "Birds of North and Middle America, part V/Genus 10. Myrmopagis Ridgway",
        "content": ""
    },
    {
        "title": "DotA",
        "content": ""
    },
    {
        "title": "Dota 2 - Wikipedia",
        "content": "Dota 2 is a multiplayer online battle arena (MOBA) video game developed and published by Valve. The game is a sequel to Defense of the Ancients (DotA), ...Release: Windows; July 9, 2013; Linux‎, ‎OS X‎; ...‎Platform(s): Microsoft Windows; ‎Linux‎; ‎OS X‎Genre(s): MOBAEngine: Source 2‎Gameplay · ‎Development · ‎Esports · ‎Reception"
    },
    {
        "title": "What should you play League of Legends or Dota 2 - Which ...",
        "content": "League of Legends vs. Dota 2. Without any doubt, League of Legends veteran would opt the LoL as the best game ever, while the question is asked by the Dota Veteran the answer would be Dota 2. Seriously, it is quite tough to convince the LoL player to play Dota 2."
    },
    {
        "title": "History of video games/Print version/Specialty topics",
        "content": ""
    },
    {
        "title": "Federal Reporter/Second series/Volume 482",
        "content": ""
    },
    {
        "title": "normalin",
        "content": ""
    },
    {
        "title": "Should I play League of Legends or Dota 2? - Quora",
        "content": "Answer (1 of 68): Im a DOTA 2 player (1955 hours) but i recently have dabbled a bit in League of Legends (87 hours). While both games were fun, i felt like DOTA 2 was a better game overall. Many guides on the internet often describe League as being easier than DOTA 2 to pickup, however, I felt th..."
    },
    {
        "title": "Mirad Grammar/Vocabulary Formation",
        "content": ""
    },
    {
        "title": "Federal Reporter/Second series/Volume 513",
        "content": ""
    },
    {
        "title": "dotas",
        "content": ""
    },
    {
        "title": "Dota 2 Wiki - Fandom",
        "content": "From DotA? Compare Dota 2/DotA items · Changes from DotA. From Heroes of Newerth? Compare Dota ..."
    },
    {
        "title": "Looking to get into either League of Legends or Dota 2 casually (playing mostly unranked). Which is the better option as of right now?",
        "content": "I’ve played both only very briefly and League seems much easier to understand but I really hate that champions are locked."
    },
    {
        "title": "Download Dota 2 for Windows - Free - 7.30e",
        "content": "Dota 2 is a free action-fantasy strategy game released in 2011, and its gameplay is derived from the widely successful Warcraft 3: Defense of the Ancients by Blizzard. Fight with honor Take control of your character from a top-down perspective as you progress through 25 levels of challenging gameplay."
    },
    {
        "title": "24/GMT+2 Looking for friendly casual gamers on TBC WoW or DotA 2",
        "content": "Hey there, I'm from Germany and looking for some friendly people to chat and game with. I have many interests from movies, shows, instruments to DnD and obviously video games. Lost a lot of online friends in the last year as people got busy and their interests changed, so I'd love to meet some new people. I'm more of a casual gamer, I like to play coop games from time to time like Borderlands, Minecraft, Terraria, etc. but lately more hooked on DotA 2 (6000+ hours) and just started playing TBC ..."
    },
    {
        "title": "Why Dota 2 is better than LoL - DOTA 2 | esports.com",
        "content": "Here is a (totally non-biased of course) opinion on why Valve's Dota 2 is the superior game to Riot's League of Legends."
    },
    {
        "title": "24 [M4A] Looking for folks who play Stardew valley or Dota 2",
        "content": "I got displaced during quarantine season so while waiting and looking for a place to work might as well look for folks who has spare time with games. DM me so I can add you on steam! Edit: I mostly play at night till midnight. But still DM me so we can set a schedule."
    },
    {
        "title": "Dota 2 ranks: ranking system explained, MMR, and more ...",
        "content": "Dota 2's ranking system might look complex from the outset, but it works just like any other competitive game out there. Ranked will need to be unlocked over time by new players by playing 100 hours worth of casual games, but after that, the grind can begin."
    },
    {
        "title": "[H] Searing Plasma Bumble Beenie ,Orbiting Fire Tough Stuff Muffs ,Strange SPC KS ***Festive ***Stickybomb Launcher ,Specialized Killstreak Rainblower °°***DOUBLE SPELLED***°° [W] Read the post OR Dota 2 Items in similiar value",
        "content": "Hello I am looking to Sell few things ,\\*\\*\\*ALL Offers are considered \\_\\_Hight Or Low\\_\\_. Soo Hit me up with any offer \\*\\*\\*: &#x200B; Searing Plasma Bumble Beenie \\-for 36 keys Orbiting Fire Tough Stuff Muffs \\-for 30 keys Strange SPC KS \\*\\*\\*Festive \\*\\*\\*Stickybomb Launcher + \\*\\*Parts \\*\\* (Domi. \\~4 k ,Build. Des. \\~2.5 k ,Dmg Dealt \\~4.8k ) (12+keys) \\-for 19 keys Specialized Killstreak Rainblower °°\\*\\*\\*DOUBLE SPELLED\\*\\*\\*°° \\-for 7 keys &#x200B; &#x200B..."
    },
    {
        "title": "What came first? LOL or Dota? :: Dota 2 General Discussions",
        "content": "DOTA 1 came first as a mod for Warcraft 3, then two guys split off from the DOTA team and made LoL. Since DOTA was a mod, they couldn't sue League (I don't know if they wanted to, but they couldn't). After they made League, VALVE came to IceFrog (The original maker of DOTA, and no, no one actually knows his real name) and together they made DOTA 2."
    },
    {
        "title": "#1 Gaming Playlist. Get hyped for your sessions in Valorant, Fortnite, Warzone, CS:GO, League of Legends, Fifa, PUBG or DOTA 2!",
        "content": ""
    },
    {
        "title": "Do you personally prefer DOTA 2 or League of Legends? Why ...",
        "content": "Played DOTA 1 then went to HON and then played League, then went to DOTA 2. The turn rates take getting used to as it just felt like your hero was lagging - a balance choice to make melee viable so ranged can't just kite, this is why all ADC in League are just ranged champs."
    },
    {
        "title": "Why a game like League of Legends that made like 1.75 bilions in 2020 had such a low prize pool at their biggest tournament (2.25 milions) ?.In comparison games like Fortnite or Dota 2 had 30+ milions prize pool",
        "content": ""
    },
    {
        "title": "League of Legends vs Dota 2 - Which Community Is More Toxic?",
        "content": "August 18, 2021. Kieran Lee. In League of Legends and Dota 2, the Elo and MMR craze has always driven players to invest time and effort into the respective genres. This unfortunately results in a toxic environment for players. Like in most competitive sports, victories are always the priority, and we are emotionally invested in securing one."
    },
    {
        "title": "24/SEA/Laptop Looking to play Don't Starve Together, Valorant or Dota 2 with chilled out people.",
        "content": "I am open to trying new games as well as long as my laptop survives it. Hopefully non-toxic people please cause I have ADHD."
    },
    {
        "title": "Dota 2 vs. Heroes of the Storm: Which MOBA is right for ...",
        "content": "In Dota 2, the graphics look a little dated, but the gameplay is deep. Screenshot by Jason Parker/CNET What is a MOBA?"
    },
    {
        "title": "League or Dota 2?",
        "content": "看看大家更倾向于哪个Moba [View Poll](https://www.reddit.com/poll/jmun5l)"
    },
    {
        "title": "Is Dota 2 Dying? - Verdict from a decade-old fan and some ...",
        "content": "Furthermore, Dota 2's average player age is quite higher then other game titles. Dota 2 is mostly retaining veteran players around, but the lack of interest from the younger players is the main factor here. As years go by, Dota 2 needs to attract younger generations to fill the void."
    },
    {
        "title": "If you have some interesting ideas that i can implement in the game feel free to post them, also you can post about things that you love or don't love in moba games (league of legends or dota 2 or smite, etc)",
        "content": ""
    },
    {
        "title": "LoL vs. Dota 2 | League of Legends and Dota 2 comparison",
        "content": "In Dota 2 the majority of Heroes have three unique basic abilities and their ultimate, however, certain Heroes can have a much larger number of abilities, which makes the overall game mechanics of those Heroes complicated (for example, the Hero Invoker is seen as one of the more complicated Heroes to control in the game with a staggering 14 ..."
    },
    {
        "title": "Which game is better League of legends or Dota 2?",
        "content": ""
    },
    {
        "title": "[H] Insurgeny Game [W] Offer or Dota 2 Items",
        "content": ""
    },
    {
        "title": "League of Legends vs Dota 2: Which MOBA Game Is Better?",
        "content": "The staff-wielding Monkey King! Before Dota 2 was created, the need for a standalone MOBA game was already in great demand. Steve \"Guinsoo\" Feak (one of the three original Dota developers alongside IceFrog) got in touch with Riot Games to help develop League of Legends. The game rapidly became a hit across the globe and a lot of Dota 1 loyalists became upset about this development."
    },
    {
        "title": "[H] Paypal F&F [W] Steam wallet or dota 2 arcanas",
        "content": "Buying for 95% comment then pm"
    },
    {
        "title": "Dota 2 vs LOL: Which MOBA Is For You | Robots.net",
        "content": "A match in Dota 2 and League of Legends begins with two opposing teams of five players. The players in each team must work together to destroy their enemy's base before their opponents get to theirs first. Usually, both teams have their main structures that are found at the opposite corners of the game map."
    },
    {
        "title": "Which game is better League of legends or Dota 2?",
        "content": ""
    },
    {
        "title": "Why LoL is better than Dota 2 - League of Legends ...",
        "content": "League of Legends . CS:GO . DOTA 2"
    },
    {
        "title": "Drag scroll like wc3 or dota 2",
        "content": "Is there any way to make the drag scroll similar to wc3 or dota 2? I get confused when I use drag scroll in sc2 as my cursor disappears and pops back up in the same spot when i expect it to be where I moved my mouse. I have to lift my mouse and reposition it on my mousepad each time I use drag scroll. It just doesnt make as much sense to me."
    },
    {
        "title": "Dota 2 OpenGL vs. Dx9 vs. Dx11 vs. Vulkan - YouTube",
        "content": "Dota 2 Gameplay Benchmark. GeForce GTX 1060 6GB. Processor i7-6800K 4.2GHz. Graphics settings: Ultra (Max) | Resolution: 1920x1080 | Grab games here: http://..."
    },
    {
        "title": "[H] TF2 keys or Dota 2 items [W] Assassin's creed Valhalla Code",
        "content": "\\[H\\] TF2 keys or Dota 2 items \\[W\\] Assassin's creed Valhalla Code"
    },
    {
        "title": "League of Legends vs Dota 2 - The Definitive Comparison",
        "content": "Dota 2 has a larger map than League of Legends. That translates to a longer average duration of games compared to League of Legends. That isn't necessarily good or bad. Just like the lore, this also depends on the preferences of each person that plays the game. Another difference is the balancing of the champions/heroes in both games."
    },
    {
        "title": "League of Legends or Dota 2?",
        "content": "[View Poll](https://www.reddit.com/poll/j5jif1)"
    },
    {
        "title": "10 Thing You Should Know from Animajor Dota 2 #22 - YouTube",
        "content": "Who are you supporting this major? Watch Stream Now: https://www.twitch.tv/weplaydotaWePlay AniMajor Details: https://bit.ly/3i96DzY Watch 10 Things You Shou..."
    },
    {
        "title": "LoL or Dota 2?",
        "content": "This might create a little bit of controversy because I'm positing this on this subreddit but I'm posting in both Dota and LoL subreddits to compare things"
    },
    {
        "title": "Is Dota 2 really harder than League of Legends?",
        "content": "DotA was obviously the prototype for Dota 2. More importantly, though, one of the lead developers in League of Legends , Steve 'Guinsoo' Feak, was a core part of the DotA Allstars community."
    },
    {
        "title": "[H] $60 Total of Starbucks Gift Cards [W] 80% PayPal, Amazon GC(s), or Steam, in GC or Dota 2 Items",
        "content": "I have 5 $10 Starbucks giftcards, and 2 $5 giftcards looking for 80% Unfortunately due to the way these were received, they will not work to add to your account. I will give the barcode, number and security code, meaning you can freely spend them and check their balance on Starbucks website. Post will be edited to reflect current number of cards"
    },
    {
        "title": "The Ultimate Dota 2 Guide Part 4: How To Make A Living ...",
        "content": "Dota 2 has a vast and enthralling macrocosm that captivates you with its charm and magic. So, give it a shot! We hope you stay for good! ABOUT THE AUTHOR. Anomaluna is an avid Dota 2 fan who started playing the game in 2014. Known for making quirky guides and posting on reddit, they've been working as a writer/editor in the scene since 2017."
    },
    {
        "title": "A dubstep playlist for ranked matches on LoL or Dota 2",
        "content": ""
    },
    {
        "title": "[H] 15 tf2 keys [W] csgo skin offer or dota 2 arcanas https://steamcommunity.com/tradeoffer/new/?partner=964224452&token=uUbMtryL",
        "content": "[H] 15 tf2 keys [W] csgo skin offer https://steamcommunity.com/tradeoffer/new/?partner=964224452&token=uUbMtryL"
    },
    {
        "title": "Is Dota 2 down? Here's how to check server status",
        "content": "If the Dota 2 Game Coordinator and Steam Community are up and running, it may also be a decent idea to check the server you generally play in. Check the servers in your region by the city names ..."
    },
    {
        "title": "World Of Warcraft or Dota 2 KWGT",
        "content": "Is there dota 2 oe wow kwgt? If not how to make some"
    },
    {
        "title": "A comprehensive comparison of Dota 2 and League of Legends ...",
        "content": "Dota 2 does things a little differently with the number keys reserved for control groups—similarly to StarCraft—and Z, X, C, V, B and N bound to your item slots. Some champions with more than ..."
    },
    {
        "title": "League of Legends vs. Dota 2 - Key Differences - LeagueFeed",
        "content": "DOTA 2 offers many different game modes to play and even custom ones. League's TFT was created as a custom game mode in DOTA 2, then called DOTA Autochess. In terms of variety, versatility, and freedom of gameplay, DOTA 2 is the king."
    },
    {
        "title": "I will always play Crystal Maiden in 'Dota 2' and I'm not ...",
        "content": "Dota 2 is a complex, strategic multiplayer game with over 120 different playable characters. Combined with their individual catalogues of skills and upgrades, as well as a vast inventory of ..."
    },
    {
        "title": "Dota 2 vs LOL: Ceb seems to have an answer to the Eternal ...",
        "content": "Dota 2 professional player Sebastian \"Ceb\" Debs has posted a video on social media stating his stance on Dota 2 versus League of Legends. It is a minute-long video. It is a minute-long video. The debate between MOBA purists on what is better between LOL and Dota 2."
    },
    {
        "title": "dotat",
        "content": ""
    },
    {
        "title": "Federal Reporter/Second series/Volume 480",
        "content": ""
    },
    {
        "title": "Cultural Anthropology/Play, Sport and Arts",
        "content": ""
    },
    {
        "title": "DOTA 2 (@DOTA2) / Twitter",
        "content": "Dota 2 is a multiplayer Action RTS game developed by @valvesoftware. Instagram: @dota2."
    },
    {
        "title": "friþotacen",
        "content": ""
    },
    {
        "title": "Federal Reporter/Second series/Volume 746",
        "content": ""
    },
    {
        "title": "Mirad Grammar/print version",
        "content": ""
    },
    {
        "title": "Liquipedia Dota 2 Wiki",
        "content": "Comprehensive Dota wiki with articles covering everything from heroes and buildings, to strategies, to tournaments, to competitive players and teams."
    },
    {
        "title": "doat",
        "content": ""
    },
    {
        "title": "Dictionary of Greek and Roman Biography and Mythology/Homerus 1.",
        "content": ""
    },
    {
        "title": "Mirad Grammar/Mirad-English Dictionary A-M",
        "content": ""
    },
    {
        "title": "Dota 2 - Twitch",
        "content": "Dota 2 is a multiplayer online battle arena video game and the stand-alone sequel to the Defense of the Ancients (DotA) mod. With regular updates that ..."
    },
    {
        "title": "dotaczać",
        "content": ""
    },
    {
        "title": "Federal Reporter/Third series/Volume 33",
        "content": ""
    },
    {
        "title": "Mirad/Print version",
        "content": ""
    },
    {
        "title": "Dota 2 Tournaments - Online 1v1, 5v5 Tournaments - Weplay ...",
        "content": "Free to join Dota 2 Tournaments at WePlay Esports Tournament Platform. Formats: 1v1, 5v5. Register, choose a tournament, participate and win prizes!"
    },
    {
        "title": "dotati",
        "content": ""
    },
    {
        "title": "History of Woman Suffrage/Volume 3/Chapter 43",
        "content": ""
    },
    {
        "title": "Mirad Grammar/English-Mirad Dictionary N-Z",
        "content": ""
    },
    {
        "title": "Should I play League of Legends or Dota 2? - Quora",
        "content": "68 answersIm a DOTA 2 player (1955 hours) but i recently have dabbled a bit in League of Legends (87 hours). While both games were fun, i felt like DOTA 2 was a ..."
    },
    {
        "title": "8 tips to get better at Dota 2 - Red Bull",
        "content": "Sep 7, 2021 — Indian Dota 2 gamers Krish 'Moon' Gupta and Ganesha 'Anx1e8y' Manjunath suggest a few tips that can help beginners get better at the game ..."
    },
    {
        "title": "Dota 2 for PC Reviews - Metacritic",
        "content": "Jul 9, 2013 — Metacritic Game Reviews, Dota 2 for PC, Dota 2 features the characters and factions from the original Defense of the Ancients title with new ... Rating: 90% · ‎33 votes"
    },
    {
        "title": "Dota 2 is dropping support for 32-bit systems | PC Gamer",
        "content": "Sep 18, 2021 — Dota 2 is dropping support for some older hardware in the coming months, including older 32-bit operating systems."
    },
    {
        "title": "History of Woman Suffrage/Volume 1/Chapter 6",
        "content": ""
    },
    {
        "title": "English-Mirad Lexicon N-Z",
        "content": ""
    },
    {
        "title": "dotar",
        "content": ""
    },
    {
        "title": "Dota 2 versus League of Legends - Different yet the same?",
        "content": "Both Dota 2 and League of Legends are games with quite a bit of history behind them. Let's take a look at both franchises and compare where ...Feb 4, 2021 · Uploaded by VideoGamerTV"
    },
    {
        "title": "Cultural Anthropology/Print version",
        "content": ""
    },
    {
        "title": "doto",
        "content": ""
    },
    {
        "title": "OpenAI's Dota 2 defeat is still a win for artificial intelligence",
        "content": "Aug 28, 2018 — AI bots made by the Elon Musk-founded research lab OpenAI were defeated by human pro gamers at Dota 2 at The International."
    },
    {
        "title": "Mirad Grammar/print version of dictionary",
        "content": ""
    },
    {
        "title": "carrozar",
        "content": ""
    },
    {
        "title": "OG signs entirely new Dota 2 roster led by Misha and Taiga ...",
        "content": "Nov 21, 2021 — OG built one of the biggest names in esports by dominating the competitive Dota 2 scene, surviving turmoil, and becoming the first team in ..."
    },
    {
        "title": "toad",
        "content": ""
    },
    {
        "title": "Dota 2 Accessories - Amazon.com",
        "content": "Results 1 - 48 of 721 — Price and other details may vary based on product size and color. · Amazon Basics Gaming Computer Mouse Pad - Black · ArtkticaSupply DOTA 2 ..."
    },
    {
        "title": "daughter",
        "content": ""
    },
    {
        "title": "Dota 2 vs. League of Legends - A beginner´s guide by Germia",
        "content": "Dota 2 · 1) Map is larger, more detailed and divided in different height levels. · 2) Friendly monsters = creeps. · 3) Your base = ancient. · 4) Game characters = ..."
    },
    {
        "title": "Dota 2 - Steam Charts",
        "content": "MonthAvg. PlayersGain% GainPeak PlayersLast 30 Days430,414.7‑18,445.8‑4.11%718,658November 2021448,860.5‑1,900.9‑0.42%747,506October 2021450,761.4+59,679.4+15.26%752,482View 111 more rows"
    },
    {
        "title": "Dota 2 (@dota2) • Instagram photos and videos",
        "content": "Official Instagram for Dota 2 from Valve Corporation. dota2.com/esports. Dragon's Blood's profile picture. Dragon's Blood. 1,979 posts · 575k followers ..."
    },
    {
        "title": "Dota 2 - Steam Community",
        "content": "Dota 2 - The most-played game on Steam.Every day, millions of players worldwide enter battle as one of over a hundred Dota heroes."
    },
    {
        "title": "DOTABUFF - Dota 2 Statistics",
        "content": "Dotabuff is the leading statistics and community website for Dota 2."
    },
    {
        "title": "OpenAI's Dota 2 bot defeated 99.4% of players in public ...",
        "content": "Apr 22, 2019 — San Francisco-based OpenAI says its AI-imbued Dota 2 bot beat a whopping 99.4% of players in public matches over the course of several days."
    },
    {
        "title": "Dotter",
        "content": ""
    },
    {
        "title": "Dota 2 Europe | ESL Play",
        "content": "ESL Play is the world's largest independent league for esports. Established in 1997, we're proud to be the home to those who love competitive gaming."
    },
    {
        "title": "crit",
        "content": ""
    },
    {
        "title": "Dota 2 | GosuGamers",
        "content": "We bring you the latest Dota 2 editorial & data coverage, match schedules, and world rankings."
    },
    {
        "title": "C位",
        "content": ""
    },
    {
        "title": "Secretlab x Dota 2",
        "content": "Secretlab returns to support Dota 2's biggest stage and the world's largest esports tournament. Shop the Secretlab The International 10 Edition chair."
    },
    {
        "title": "dote",
        "content": ""
    },
    {
        "title": "Dota 2 - Home | Facebook",
        "content": "Dota 2. 4715004 likes · 1735 talking about this. Dota is a competitive game of action and strategy, played both professionally and casually by..."
    },
    {
        "title": "dos",
        "content": ""
    },
    {
        "title": "What in the hell is a Dota 2? (BSJ will tell you) - Team Liquid",
        "content": "Oct 8, 2021 — I don't normally fear learning new things, but Dota 2… Dota 2 is intimidating. Dota 2 is immense and old and angry. It is full of heroes (who ..."
    },
    {
        "title": "Teamfight Tactics, Underlords, or Dota 2 Auto Chess - Polygon",
        "content": "Jun 27, 2019 — ... a faster paced and less room for error, will help you determine whether, Dota 2 Auto Chess, Underlords, or Teamfight Tactics, is for you."
    },
    {
        "title": "Dota 2 requires strategy, skill and luck - ESPN",
        "content": "Jan 14, 2016 — While League of Legends might have a higher profile, Dota 2 boasts a gigantic purse and a different strategy. The bar for entry is high, ..."
    },
    {
        "title": "Dota 2 - OpenAI",
        "content": "Aug 11, 2017 — Dota 2. We've created a bot which beats the world's top professionals at 1v1 matches of Dota 2 under standard tournament rules."
    },
    {
        "title": "The Story of DOTA - Eurogamer",
        "content": "Aug 16, 2011 — This genre includes Heroes of Newerth, Demigod, in-development StarCraft 2 mod Blizzard DOTA, League of Legends and the forthcoming Dota 2 from ..."
    },
    {
        "title": "Dota 2 - GameSpot",
        "content": "Jul 9, 2013 — Dota 2 features the characters and factions from the original Defense of the Ancients title with new features."
    }
]