[
    {
        "title": "Dota 2 on Steam",
        "content": "Every day, millions of players worldwide enter battle as one of over a hundred Dota heroes. And no matter if it's their 10th hour of play or 1,000th, there's always something new to discover. With regular updates that ensure a constant evolution of gameplay, features, and heroes, Dota 2 has taken on a life of its own."
    },
    {
        "title": "Dota",
        "content": ""
    },
    {
        "title": "History of video games/Esports",
        "content": ""
    },
    {
        "title": "Gabe Newell",
        "content": ""
    },
    {
        "title": "Birds of North and Middle America, part V/Genus 8. Dysithamnus Cabanis",
        "content": ""
    },
    {
        "title": "Dota 2",
        "content": "Every day, millions of players worldwide enter the battle as one of over a hundred Dota Heroes in a 5v5 team clash. Dota is the deepest multi-player action RTS ...‎News · ‎The Dota Pro Circuit 2021... · ‎Dota Patch Notes - 7.30e · ‎Heroes"
    },
    {
        "title": "Dota 2 vs. League Of Legends: Which Is Better?",
        "content": "The only downside to Dota 2 is that it isn't the freshest and, even though it's free, finding random people to join you is much harder due to its slightly more cult-like audience. League of Legends didn't start the genre, but it proved how successful it could be. The game has expanded massively among both casual and competitive players."
    },
    {
        "title": "League of Legends vs Dota 2 - GamerzClass",
        "content": "DOTA 2 boasts a steep learning curve, while League of Legends is fairly easy to pick up on. While this might seem like a disadvantage on DOTA 2's part, the game's complexity makes it far more rewarding once you've put in the time to understand the game's mechanics and successfully execute some unusual builds and plays."
    },
    {
        "title": "dota",
        "content": ""
    },
    {
        "title": "Think this can run Dota 2 or Valorant?"
    },
    {
        "title": "Lentis/Electronic Sports (eSports)",
        "content": ""
    },
    {
        "title": "Open individualism",
        "content": ""
    },
    {
        "title": "Birds of North and Middle America, part V/Genus 13. Ramphocænus Vieillot",
        "content": ""
    },
    {
        "title": "Why is there no \"Bonus pool\" like system in Dota 2? Or personal performance taken into account when winning/losing?",
        "content": "So this question is *mostly* aimed towards the losing part of the game. Many games out there have very good ranking/ladder systems in place, where a bad day wont ruin your MMR completely. First games that come to mind are Starcraft 2 and Overwatch, which have different but both very good laddering systems. Sc2 has a Bonuspool system which helps you on a bad day, if you're losing and gives you a little bonus MMR when you win(I think, been a while since i played). Overwatch has a different ..."
    },
    {
        "title": "League of Legends vs Dota 2 - Which Community Is More Toxic?",
        "content": "August 18, 2021. Kieran Lee. In League of Legends and Dota 2, the Elo and MMR craze has always driven players to invest time and effort into the respective genres. This unfortunately results in a toxic environment for players. Like in most competitive sports, victories are always the priority, and we are emotionally invested in securing one."
    },
    {
        "title": "League of Legends vs. Dota 2 - Key Differences - LeagueFeed",
        "content": "DOTA 2 offers many different game modes to play and even custom ones. League's TFT was created as a custom game mode in DOTA 2, then called DOTA Autochess. In terms of variety, versatility, and freedom of gameplay, DOTA 2 is the king."
    },
    {
        "title": "DotA",
        "content": ""
    },
    {
        "title": "Radiation Oncology/Radioimmunotherapy",
        "content": ""
    },
    {
        "title": "Birds of North and Middle America, part V/Genus 10. Myrmopagis Ridgway",
        "content": ""
    },
    {
        "title": "What does \"removing support for Dota on 32 bit systems? Does it mean that if you are using a 32 bit system would not be able to run Dota 2 or Are you still able to run Dota but if you encounter problems using a 32 bit system , you're on your own?",
        "content": ""
    },
    {
        "title": "Dota 2 ranks: ranking system explained, MMR, and more ...",
        "content": "Dota 2's ranking system might look complex from the outset, but it works just like any other competitive game out there. Ranked will need to be unlocked over time by new players by playing 100 hours worth of casual games, but after that, the grind can begin."
    },
    {
        "title": "normalin",
        "content": ""
    },
    {
        "title": "History of video games/Print version/Specialty topics",
        "content": ""
    },
    {
        "title": "Federal Reporter/Second series/Volume 482",
        "content": ""
    },
    {
        "title": "Dota 2 - Wikipedia",
        "content": "Dota 2 is a multiplayer online battle arena (MOBA) video game developed and published by Valve. The game is a sequel to Defense of the Ancients (DotA), ...Release: Windows; July 9, 2013; Linux‎, ‎OS X‎; ...‎Platform(s): Microsoft Windows; ‎Linux‎; ‎OS X‎Genre(s): MOBAEngine: Source 2‎Gameplay · ‎Development · ‎Esports · ‎Reception"
    },
    {
        "title": "Is this Dota 2 or LOL?",
        "content": ""
    },
    {
        "title": "dotas",
        "content": ""
    },
    {
        "title": "Mirad Grammar/Vocabulary Formation",
        "content": ""
    },
    {
        "title": "Federal Reporter/Second series/Volume 513",
        "content": ""
    },
    {
        "title": "Should I play League of Legends or Dota 2? - Quora",
        "content": "Mar 12, 2017 — 1. Graphics-:Dota2 has better graphics than Lol. · 2. Player pool-:Lol has 134 champions while dota has around 112 heroes. So lol is more vast wrt hero pool. · 3.68 answers · 299 votes: Im a DOTA 2 player (1955 hours) but i recently have dabbled a bit in League of Legends (87 ...Should I play Dota 2 or League of Legends if I want ...28 answersMar 30, 2017Which one should I play: CSGO or Dota 2? - Quora17 answersDec 5, 2016More results from www.quora.com"
    },
    {
        "title": "An actual BOT in Dota 2? or the next level grief?",
        "content": "This PA just afks in one place then just cast dagger to last hit. Never hit a hero once, never pinged, never used chatwheel, never chat and rushed Battlefury. He was trying though (not completely griefing) because he was farming and avoided the enemy if he can. We never flamed him other than ES (who flamed everyone) but that was only when we're about to lose. Could just be an account buyer but laning is just very weird, I don't think heralds lane like that so it must be a bot. Try to see his lan..."
    },
    {
        "title": "LoL vs. Dota 2 | League of Legends and Dota 2 comparison",
        "content": "In Dota 2, talents are traits unique to each Hero that become available every five levels and are separate from regular abilities that you put points into each level. From level 10, it provides a buff to Heroes attributes, additional gold, or experience gain. It can also boost Heroes abilities, adding a new dynamic to the game."
    },
    {
        "title": "Dota 2 versus League of Legends - Different yet the same?",
        "content": "Where the term ARTS tells us that Dota 2 is supposed to be a game where strategy is very important. The term MOBA that League of Legends uses ...Feb 4, 2021 · Uploaded by VideoGamerTV"
    },
    {
        "title": "21/EST/PC - Looking for another Dota 2 (or anything) beginner.",
        "content": "I literally just started playing. And seeing it's going to be some time until I learn all the mechanics, I would like someone to join me. Probably more fun if there's a person laughing about how bad I am at this game because, jeeze, my first match was a complete disaster, it was depressing (and I mean Dota). I also dowloaded val, apex, league, csgo,... I expect same or worse results but I literally want to play these so bad I don't care how much it takes. I've been playing genshin and osu until ..."
    },
    {
        "title": "Dota 2 or LoL? : DotA2 - reddit",
        "content": "Dota 2. I have over 1500+ hours on lol and just reached 1000+ hours on dota 2. I love both games and I play strictly casual, no competitive games what so ever. However, recently I have been playing dota more (I haven't played lol in months) mainly because league feels really stale and repetitive after a while."
    },
    {
        "title": "Dota 2 or LoL ?",
        "content": "I am bored of Fps games so I'll try MOBA games so which one of them is better for beginners? and thanks"
    },
    {
        "title": "Is Dota 2 Dying? - Verdict from a decade-old fan and some ...",
        "content": "Dota 2 is mostly retaining veteran players around, but the lack of interest from the younger players is the main factor here. As years go by, Dota 2 needs to attract younger generations to fill the void. After all, we can't just rely on Dota 2 fans in their late 30s to maintain the player base."
    },
    {
        "title": "[LoL and DotA 2] What are the unbiased pros and cons of each?",
        "content": "*LoL has a ranking system. In DoTA you will never really know how good you are compared to other players because Valve hides their rankings. In LoL you can ..."
    },
    {
        "title": "Real state of the PvP Ranked, I'm starting to think I'm in the wrong game, this looks like more the Dota 2 or LoL community :/",
        "content": ""
    },
    {
        "title": "Dota 2 - Wikipedia",
        "content": "Dota 2 is a multiplayer online battle arena (MOBA) video game developed and published by Valve.The game is a sequel to Defense of the Ancients (DotA), which was a community-created mod for Blizzard Entertainment's Warcraft III: Reign of Chaos. Dota 2 is played in matches between two teams of five players, with each team occupying and defending their own separate base on the map."
    },
    {
        "title": "Hacking Dota 2 or I'm being watched?",
        "content": "Hello everyone. I have an interesting situation. I noticed that the same players are joining my game. When I checked my profile I noticed 10 players I don't know. [ 10 players ](https://preview.redd.it/bs51a7urmnu61.png?width=1920&format=png&auto=webp&s=81be86af59a0d039748718ab673485dc05153b8b) I play 4-6 games a day for 30 minutes (turbo) but only these 10 players played 5-8 games with me in 2021. I wrote a letter to support. I wrote a letter to support and the answer is \"Steam..."
    },
    {
        "title": "Do you personally prefer DOTA 2 or League of Legends? Why ...",
        "content": "Played DOTA 1 then went to HON and then played League, then went to DOTA 2. The turn rates take getting used to as it just felt like your hero was lagging - a balance choice to make melee viable so ranged can't just kite, this is why all ADC in League are just ranged champs."
    },
    {
        "title": "Why aren’t there any in-game items such as skins (dota 2 or cs:go, for example) listed on Opensea platform or any other?",
        "content": ""
    },
    {
        "title": "خرید آیتم دوتا 2 تحویل فوری | فروش آیتم دوتا 2 ارزان ...",
        "content": "خرید آیتم دوتا 2. در خرید آیتم یکی از مهمترین مسائل بحث اعتماد است. ممکن است در بعضی از سایتهای دیگر قیمت هایی دیده باشید که خرید آیتم ارزان قیمت داشته باشند اما ممکن است بعضی از آنها از اعتماد شما سو استفاده کنند و خرید ..."
    },
    {
        "title": "Dota 2 or LOL which one to play",
        "content": "Which moba to play LOL or Dota 2 i know lol has many players but i am a bit skeptical about garena servers and i am quite aware about the toxicity of dota2 so which one to play"
    },
    {
        "title": "Should I play League of Legends or Dota 2? - Quora",
        "content": "Answer (1 of 68): Im a DOTA 2 player (1955 hours) but i recently have dabbled a bit in League of Legends (87 hours). While both games were fun, i felt like DOTA 2 was a better game overall. Many guides on the internet often describe League as being easier than DOTA 2 to pickup, however, I felt th..."
    },
    {
        "title": "I need some advice what o should start playing dota 2 or league of legends?",
        "content": "So I’m totally knew to these kind of Games they seem fun but also really serious and hard to learn. So I was wondering if you guys could give me advice on which one is better for a newbie like me I want people opinions who have played both. Also could you guys tell me a little about the game/games and maybe link me to YouTube videos that will help me learn. Thanks in advance have a nice day"
    },
    {
        "title": "Dota 2 audio stuttering or no sound issue after the recent ...",
        "content": "Dota 2, one of the most popular MOBAs out there, is experiencing certain problems. These would have arrived after the most recent game update. Many Dota 2 players are reporting sound issues after updating on November 16. The issues can present themselves in a number of ways, such as stuttering sound, loud sound, or no sound at all."
    },
    {
        "title": "Dota 2 or Just My PC?",
        "content": "So after the update I have played 1 game of turbo and it went well, but after a few minutes I queued for Unranked Normal and when the ban phase for the heroes was about to end my screen freezes, but I can still hear the game running and the announcer as well as the picking sounds in game, after that I tried to end task the game and reconnect, but I am just faced with a black screen and the cursor while I can hear the game even the heroes using their skills, Is the problem my PC? or Dota 2 Itself..."
    },
    {
        "title": "DOTA 2 or League of Legends? 5 Key Differences - GamerzClass",
        "content": "DOTA 2's depth makes it notoriously difficult to pick up for new players whereas Riot games prioritize a fun, beginner-friendly environment in a bid to cater to the game's newer players. League of Legends requires a ton of time and effort to get really good at - but because of its sheer depth, DOTA 2 requires a whole different level of ..."
    },
    {
        "title": "Why aren’t there any in-game items such as skins (dota 2 or cs:go, for example) listed on Opensea platform or any other? (xpost from /r/opensea)",
        "content": ""
    },
    {
        "title": "DOTA 2 (NVIDIA) - DirectX 9 vs DirectX 11 vs Vulkan vs ...",
        "content": "DOTA 2 NVIDIA GeForce API Test (GTX 1060)1080p maxAMD API Test: https://youtu.be/4raMkzwwU7QRyzen 5 2400GASUS Prime X370-Pro2x8GB DDR4-3200Palit GeForce GTX ..."
    },
    {
        "title": "Dota 2 or LoL",
        "content": "I read a lot about them and I just can't decide which one to play. The results are pretty mixed."
    },
    {
        "title": "Dota 2 vs LOL: Which MOBA Is For You | Robots.net",
        "content": "A match in Dota 2 and League of Legends begins with two opposing teams of five players. The players in each team must work together to destroy their enemy's base before their opponents get to theirs first. Usually, both teams have their main structures that are found at the opposite corners of the game map."
    },
    {
        "title": "Should i get Dota 2 or League of Legends?",
        "content": ""
    },
    {
        "title": "Dota 2 OpenGL vs. Dx9 vs. Dx11 vs. Vulkan - YouTube",
        "content": "Dota 2 Gameplay Benchmark. GeForce GTX 1060 6GB. Processor i7-6800K 4.2GHz. Graphics settings: Ultra (Max) | Resolution: 1920x1080 | Grab games here: http://..."
    },
    {
        "title": "Are DOTA 2 or Heroes of the Storm worth playing?",
        "content": "Like are they fun and all that? Which one of the two? I’ve never played a MOBA before"
    },
    {
        "title": "Is Dota 2 really harder than League of Legends?",
        "content": "DotA was obviously the prototype for Dota 2. More importantly, though, one of the lead developers in League of Legends , Steve 'Guinsoo' Feak, was a core part of the DotA Allstars community."
    },
    {
        "title": "Dota 2 or league of legends ?? Which should I play first??",
        "content": "Comment down guys..👍🙏"
    },
    {
        "title": "DOTA 2 or League of Legends: Which is Better? - CYBERPOWERPC",
        "content": "DotA 2 heroes are also highly specialized in certain ways and lacking in others, and each one of them has very unique play style. • Map Layout. Dota 2 and League of Legends have maps with the same basic layouts. This map in LoL is called Summoner's Rift, which has the same basic look as DotA 2 has: each has a top, middle and bottom lane ..."
    },
    {
        "title": "how hot does the t14s amd get when light gaming like dota 2 or cs go?",
        "content": "I've heard complaints about the temperatures of the t14s and t14 amd, and I was wondering if the surface temperatures are really that bad when gaming? I'm not too familiar with how temperatures can affect cpu, but I've heard reports of the cpu reaching 90 C when gaming, is that bad?"
    },
    {
        "title": "Dota 2: Which Are The Best Items For Batrider?",
        "content": "Veselin 'Noiselessx' is an esports expert, mostly focusing on Dota 2, where he has achieved 5800 MMR. Having more than 12 years of Dota 2 experience and playing on multiple tier 2 & 3 teams, he has the needed knowledge to analyze details."
    },
    {
        "title": "If you have some interesting ideas that i can implement in the game feel free to post them, also you can post about things that you love or don't love in moba games (league of legends or dota 2 or smite, etc)",
        "content": ""
    },
    {
        "title": "Do you play DOTA 2 or R6S",
        "content": "Hi guys I'm just a guy from the KC area looking for some new friends to play with. I'm an average gamer, Archon rank and Gold 3 in R6S! Please let me know if you want to play!"
    },
    {
        "title": "I will always play Crystal Maiden in 'Dota 2' and I'm not ...",
        "content": "Dota 2 is a complex, strategic multiplayer game with over 120 different playable characters. Combined with their individual catalogues of skills and upgrades, as well as a vast inventory of ..."
    },
    {
        "title": "What is better? Dota 2 or League Of Legends?",
        "content": "Hey there I was wondering What people on here Think is the better MOBA. Based on Twitch Lol is the more watched but What do you Think?"
    },
    {
        "title": "Which is better to play Dota 2 or LoL ? Also do u need a lot of friends in irl to start playing these games ?",
        "content": ""
    },
    {
        "title": "Dota 2 32bit or 64 bit on default ? :: Dota 2 General ...",
        "content": "Dota 2. All Discussions Screenshots Artwork Broadcasts Videos Workshop News Guides Reviews. Dota 2 > General Discussions > Topic Details ~Lalisa Manoban. Jan 5, 2017 @ 1:03pm Dota 2 32bit or 64 bit on default ? Hi guys, does dota 2 run on 32 or 64 bit on default? thanks in advance.. < > Showing 1-9 ..."
    },
    {
        "title": "Am I getting worse at dota 2 or is everyone suddenly really good?",
        "content": "So I've been in this weird fucking state of decline for the past while. Last season I was Archon V. I actually started as IV and managed to climb my way there. Not terrible, I was once in the legend 3k area, but I accepted my skill degrading. This season I finally calibrated at a grand... Crusador IV. Fuck me. I mean, I know what I'm doing wrong, to an extent. Do I feel like it should land me at 2200 mmr? God no. I know for instance, that I don't have amazing late game making skills and it oft..."
    },
    {
        "title": "Dota 2 Guide for Beginners | How to Play Dota | DMarket | Blog",
        "content": "Dota 2 is a world-famous online MOBA played by millions of people across the globe. The title was formally announced in October 2010, and released as a free-to-play game three years later. The game is based on an enormously popular Warcraft 3 mod, the Defense of the Ancients (hence the name DotA)."
    },
    {
        "title": "Why is TF2 less popular than Dota 2 or CSGO?",
        "content": ""
    },
    {
        "title": "Is Dota 2 down? Here's how to check server status - MSN",
        "content": "Dota 2's Twitter page only posts about major updates and important events, making it a last resort for server-related updates. What can you do if the servers are up but still can't play Dota 2 ..."
    },
    {
        "title": "A comprehensive comparison of Dota 2 and League of Legends ...",
        "content": "Dota 2 does things a little differently with the number keys reserved for control groups—similarly to StarCraft—and Z, X, C, V, B and N bound to your item slots. Some champions with more than ..."
    },
    {
        "title": "A Guide to Dota 2 Launch Options for Improved Performance",
        "content": "Dota 2 is a great esport with almost 500,000 average concurrent players. Many people enjoy it with their friends, watch professional tournaments, or even bet on it. If you have a high-end PC, Dota 2 launch options are the last thing you think about when you first start playing the game."
    },
    {
        "title": "Dota 2: The Best Items for Phantom Assassin",
        "content": "There are a few heroes in Dota 2 that have the firepower and presence of Phantom Assassin. This is a hero that has been in Dota 2 for many years and has earned its name as one of the best carries in the game. Phantom Assassin is one of the few heroes in Dota 2 that is not influenced by the meta."
    },
    {
        "title": "Dota 2 Key Terms - Hotspawn",
        "content": "Dota 2 is one of the oldest competitive titles in gaming, with a reputation for its steep learning curve and huge list of key terms. As it is a sequel to DotA Allstars, the original custom map for Blizzard's Warcraft 3, its jargon dates all the way back to the mid-2000s."
    },
    {
        "title": "Federal Reporter/Second series/Volume 480",
        "content": ""
    },
    {
        "title": "dotat",
        "content": ""
    },
    {
        "title": "Cultural Anthropology/Play, Sport and Arts",
        "content": ""
    },
    {
        "title": "Dota 2 Wiki - Fandom",
        "content": "Dota 2 is an Action RTS game, developed by Valve Corporation. The title was formally announced on October 13, 2010; and was released as a Free to Play game ..."
    },
    {
        "title": "Federal Reporter/Second series/Volume 746",
        "content": ""
    },
    {
        "title": "friþotacen",
        "content": ""
    },
    {
        "title": "Mirad Grammar/print version",
        "content": ""
    },
    {
        "title": "DOTA 2 (@DOTA2) / Twitter",
        "content": "Dota 2 is a multiplayer Action RTS game developed by @valvesoftware. Instagram: @dota2."
    },
    {
        "title": "Dictionary of Greek and Roman Biography and Mythology/Homerus 1.",
        "content": ""
    },
    {
        "title": "doat",
        "content": ""
    },
    {
        "title": "Mirad Grammar/Mirad-English Dictionary A-M",
        "content": ""
    },
    {
        "title": "Dota 2 or LoL: Which MOBA is better? | EarlyGame",
        "content": "May 23, 2020 — Out of the two, LoL is definitely the game with the bigger player count and it's also more popular globally. Dota 2 is certainly not a small ..."
    },
    {
        "title": "Federal Reporter/Third series/Volume 33",
        "content": ""
    },
    {
        "title": "dotaczać",
        "content": ""
    },
    {
        "title": "Mirad/Print version",
        "content": ""
    },
    {
        "title": "Dota 2 - Twitch",
        "content": "Dota 2 is a multiplayer online battle arena video game and the stand-alone sequel to the Defense of the Ancients (DotA) mod. With regular updates that ..."
    },
    {
        "title": "History of Woman Suffrage/Volume 3/Chapter 43",
        "content": ""
    },
    {
        "title": "dotati",
        "content": ""
    },
    {
        "title": "Mirad Grammar/English-Mirad Dictionary N-Z",
        "content": ""
    },
    {
        "title": "Is Dota 2 really harder than League of Legends? - Sportskeeda",
        "content": "Jun 8, 2021 — League is designed to be smooth and fast-paced with its skillshot-heavy repertoire of low-cooldown abilities. In Dota 2, the big moments usually ..."
    },
    {
        "title": "8 tips to get better at Dota 2 - Red Bull",
        "content": "Sep 7, 2021 — Indian Dota 2 gamers Krish 'Moon' Gupta and Ganesha 'Anx1e8y' Manjunath suggest a few tips that can help beginners get better at the game ..."
    },
    {
        "title": "Dota 2 · AppID: 570 - SteamDB",
        "content": "Dota 2 Steam charts, data, update history. ... that ensure a constant evolution of gameplay, features, and heroes, Dota 2 has taken on a life of its own.App Type: GamePublisher: ValveLast Record Update: 6 December 2021 – 20:3... Rating: 83.3% · ‎1,629,755 reviews"
    },
    {
        "title": "Liquipedia Dota 2 Wiki",
        "content": "Oct 21, 2021 — Comprehensive Dota wiki with articles covering everything from heroes and buildings, to strategies, to tournaments, to competitive players ..."
    },
    {
        "title": "English-Mirad Lexicon N-Z",
        "content": ""
    },
    {
        "title": "History of Woman Suffrage/Volume 1/Chapter 6",
        "content": ""
    },
    {
        "title": "dotar",
        "content": ""
    },
    {
        "title": "Dota 2 vs. League of Legends - A beginner´s guide by Germia",
        "content": "There are a lot of monsters in the forest, you can kill, that give you money and different abilities. That´s one of the reasons, jungling (having a hero, that ..."
    },
    {
        "title": "Cultural Anthropology/Print version",
        "content": ""
    },
    {
        "title": "doto",
        "content": ""
    },
    {
        "title": "Dota 2: the 1,000-hour review | The Verge",
        "content": "Sep 29, 2014 — Welcome to Dota 2, the Hotel California of online gaming. Late last December, I was naïve enough to dip a toe in its beguiling waters and ..."
    },
    {
        "title": "Mirad Grammar/print version of dictionary",
        "content": ""
    },
    {
        "title": "carrozar",
        "content": ""
    },
    {
        "title": "GOSU Voice Assistant for Dota 2",
        "content": "Try the World`s first Dota 2 voice assistant to master the game effortlessly. Learn more - how it works and how can it help you."
    },
    {
        "title": "toad",
        "content": ""
    },
    {
        "title": "Dota 2 will soon remove support for 32-bit systems, Valve warns",
        "content": "Sep 17, 2021 — So, in the coming months, Dota 2 players will need to have a 64-bit machine and operating system to run the game."
    },
    {
        "title": "daughter",
        "content": ""
    },
    {
        "title": "Dota 2 vs. League Of Legends: Which Is Better? - TheGamer",
        "content": "Mar 8, 2021 — The only downside to Dota 2 is that it isn't the freshest and, even though it's free, finding random people to join you is much harder due to ..."
    },
    {
        "title": "Dota 2 for PC Reviews - Metacritic",
        "content": "Jul 9, 2013 — Metacritic Game Reviews, Dota 2 for PC, Dota 2 features the characters and factions from the original Defense of the Ancients title with new ... Rating: 90% · ‎33 votes"
    },
    {
        "title": "Dota 2 - Steam Community",
        "content": "Dota 2 - The most-played game on Steam.Every day, millions of players worldwide enter battle as one of over a hundred Dota heroes."
    },
    {
        "title": "Dota 2 | NME",
        "content": "Dota 2. 'Dota 2''s next battle pass is coming “in the next few weeks”. “We've got a special conundrum cooking and we can't wait to share it” ..."
    },
    {
        "title": "[2103.02943] The Dota 2 Bot Competition - arXiv",
        "content": "by JM Font · 2021 · Cited by 15 — The Dota 2 AI framework makes use of the actual Dota 2 game modding capabilities to enable to connect external AI controllers to actual Dota 2 ...Journal reference: IEEE Transactions on Games ..."
    },
    {
        "title": "Breaking down the comparison between Dota 2 and League ...",
        "content": "Apr 7, 2020 — These games might look the same from the outside, but they have many differences for both casual and professional players. - Dota 2, GENERAL ..."
    },
    {
        "title": "Dotter",
        "content": ""
    },
    {
        "title": "Wildcard Gaming enters Dota 2, signs D2 Hustlers to compete",
        "content": "7 days ago — Once they secured a spot in the lower division for the season, the team continued its branding by becoming the D2 Hustlers. ‼️‼️ WC x DotA 2 ..."
    },
    {
        "title": "crit",
        "content": ""
    },
    {
        "title": "Dota 2 Tournaments - Online 1v1, 5v5 Tournaments - Weplay ...",
        "content": "Free to join Dota 2 Tournaments at WePlay Esports Tournament Platform. Formats: 1v1, 5v5. Register, choose a tournament, participate and win prizes!"
    },
    {
        "title": "C位",
        "content": ""
    },
    {
        "title": "Learn Dota 2: Coming from LoL - DOTABUFF",
        "content": "I want to learn Dota 2. So I can watch replays. Hero SuggestionsChoose 6 or more LoL Champions you enjoy playing."
    },
    {
        "title": "dote",
        "content": ""
    },
    {
        "title": "Dota 2 review - Polygon",
        "content": "Aug 15, 2017 — Dota 2 is a multiplayer game primarily consisting of five-on-five battles to destroy the other team's \"Ancient.\" Before the game begins, each ...Developers: Valve Corporation Rating: 8.5/10 · ‎Review by Arthur Gies"
    },
    {
        "title": "dos",
        "content": ""
    },
    {
        "title": "What in the hell is a Dota 2? (BSJ will tell you) - Team Liquid",
        "content": "Oct 8, 2021 — I don't normally fear learning new things, but Dota 2… Dota 2 is intimidating. Dota 2 is immense and old and angry. It is full of heroes (who ..."
    },
    {
        "title": "Dota 2 Accessories - Amazon.com",
        "content": "Results 1 - 48 of 721 — Price and other details may vary based on product size and color. · Amazon Basics Gaming Computer Mouse Pad - Black · ArtkticaSupply DOTA 2 ..."
    },
    {
        "title": "Dota 2 | PCGamesN",
        "content": "Valve's second pass at the MOBA ignited a genre rivalry that continues to this day, but a stratospheric skill ceiling makes Dota 2 the quintessential 5v5 ..."
    },
    {
        "title": "League of Legends vs Dota 2 - Which Community Is More ...",
        "content": "Aug 18, 2021 — We ask the important questions. ➤ Which is more toxic Dota or LoL? Is the Dota 2 community better than LoL? ⬆ We then we flame both sides."
    },
    {
        "title": "Dota 2 (for PC) Review | PCMag",
        "content": "Jul 20, 2016 — Incredibly fun and expertly designed, Dota 2 is the definitive isometric MOBA. Rating: 4.5 · ‎Review by Michael Ajibade"
    },
    {
        "title": "Dota 2 is dropping support for 32-bit systems | PC Gamer",
        "content": "Sep 18, 2021 — Dota 2 is dropping support for some older hardware in the coming months, including older 32-bit operating systems."
    }
]