[
    {
        "title": "Open individualism",
        "content": ""
    },
    {
        "title": "endow",
        "content": ""
    },
    {
        "title": "Birds of North and Middle America, part V/Genus 8. Dysithamnus Cabanis",
        "content": ""
    },
    {
        "title": "Lentis/Electronic Sports (eSports)",
        "content": ""
    },
    {
        "title": "Dota 2 - Wikipedia",
        "content": "Dota 2 is a multiplayer online battle arena (MOBA) video game developed and published by Valve.The game is a sequel to Defense of the Ancients (DotA), which was a community-created mod for Blizzard Entertainment's Warcraft III: Reign of Chaos. Dota 2 is played in matches between two teams of five players, with each team occupying and defending their own …"
    },
    {
        "title": "Kpoptosis - Liquipedia Dota 2 Wiki",
        "content": "Jul 22, 2020 — Showing signs of promise, he continued to appear with BeyondTheSummit in notable tournaments such as Dota 2 Super League and Alienware Cup.Kpoptosis: Links"
    },
    {
        "title": "Identity & Access Management System - CMS Warning",
        "content": "Identity & Access Management System. You are accessing a U.S. Government information system, which includes: (1) this computer, (2) this computer network, (3) all computers connected to this network, and (4) all devices and storage media attached to this network or to a computer on this network."
    },
    {
        "title": "I built an android app that sends notifications when games such as Dota 2 update, and provides you with patch notes!",
        "content": "I built an android app that sends notifications when games such as Dota 2 update, and provides you with patch notes!"
    },
    {
        "title": "Gabe Newell",
        "content": ""
    },
    {
        "title": "BitGame combines world-class international sports matches with the convenience, transparency, and openness of blockchain-supported cryptocurrencies. The platform supports betting on thousands of games across both mainstream sports and E-sports such as soccer, basketball, and Dota 2. Powerful project"
    },
    {
        "title": "dowry",
        "content": ""
    },
    {
        "title": "Dictionary of Greek and Roman Biography and Mythology/Homerus 1.",
        "content": ""
    },
    {
        "title": "Mirad Grammar/English-Mirad Dictionary N-Z",
        "content": ""
    },
    {
        "title": "Dota 2 Betting, Esport Bets at GG.BET",
        "content": "Dota 2 is an online multiplayer game in the MOBA genre and it was developed by Valve Corporation. It is free to download on the Steam platform. Most popular Steam game. In a standard game of Dota the player’s objective is to destroy the main enemy construction called the Ancient, which is located inside their base."
    },
    {
        "title": "Dota 2 need to be clear about Interaction such as Dispel after today game OG vs Secret",
        "content": "After OG vs Secret game, people questioning the Manta build from Timbersaw . The Manta build is very simple, it's purpose is to doge/dispel Grim's Phantom bug because Timbersaw can't attack while casting Chakram However both in game and Dota 2 wiki has the same quote: Can't not be displed and persist till death There are also many cases like this such as Eul dispel X mark, Hex, mana burn, and many more skills can dispell normal illusions from manta where the wiki page clearly said, illusions..."
    },
    {
        "title": "Do you agree that MOBA games such as DOTA 2 is the new ...",
        "content": "Sep 4, 2018 — Do you agree that MOBA games such as DOTA 2 is the new modern Chess or GO in terms of new strategic concepts that can be used for business or military (and ...2 answers · Top answer: I've personally developed tactical analysis software for DOTA and League before. In fact, ...Why does Dota 2 have such a large prize pool of ...4 answersApr 10, 2017Is it healthy to play games such as Dota2/LOL ? - Quora6 answersOct 20, 2015What should I play, CSGO, League of Legends or ...40 answersMar 22, 2017More results from www.quora.com"
    },
    {
        "title": "using for example, for instance, e.g., eg, and such as in ...",
        "content": "These phrases are often used incorrectly. for example. for instance. such as. e.g. These phrases essentially have the same meaning, but they are not used in the same way. For our purposes, let's break them up into 2 groups: phrases used within a sentence and phrases used to begin a new sentence ."
    },
    {
        "title": "dota",
        "content": ""
    },
    {
        "title": "Birds of North and Middle America, part V/Genus 13. Ramphocænus Vieillot",
        "content": ""
    },
    {
        "title": "Mirad Grammar/Mirad-English Dictionary A-M",
        "content": ""
    },
    {
        "title": "Dota 2 Workshop - Technical Requirements",
        "content": "Please refer to the links on the Dota 2 Item Workshop Guidelines Homepage for information about couriers, wards, images, music and other types of submissions as well as general asset creation guidelines. These hero pages contain Lore for each hero; Budgets for models and textures."
    },
    {
        "title": "Bitgame Platform supports betting on thousands of games across both mainstream sports and E-sports such as soccer, basketball, and Dota 2.",
        "content": "Bitgame provides up to 10% greater odd than other platforms in the industry while utilizing a multi-party verification mechanism to ensure the precision and punctuality of prize disclosure. The platform supports betting on thousands of games across both mainstream sports and E-sports such as soccer, basketball, and Dota 2. For more information; **bitgame.com**"
    },
    {
        "title": "MSI Pro Talk #1: Pro Dota 2 Caster - Toby \"TobiWan\" Dawson",
        "content": "What it is like to make a living from talking about popular games such as Dota 2, CS:GO, or League of Legends? It sounds like a dream job, but is it as easy ..."
    },
    {
        "title": "Netflix - Watch TV Shows Online, Watch Movies Online",
        "content": "Watch Netflix movies & TV shows online or stream right to your smart TV, game console, PC, Mac, mobile, tablet and more."
    },
    {
        "title": "dotar",
        "content": ""
    },
    {
        "title": "Birds of North and Middle America, part V/Genus 10. Myrmopagis Ridgway",
        "content": ""
    },
    {
        "title": "Mirad Grammar/Vocabulary Formation",
        "content": ""
    },
    {
        "title": "Dota 2 - Reborn",
        "content": "Today we are announcing the Dota 2 Reborn beta, which brings with it a new interface, new engine, and Custom Games. Everything in the dashboard has been redesigned utilizing a new UI framework and the engine that powers the game has been fully replaced. On this page we will be giving you a preview of the new interface. Early next week we'll be talking about Custom …"
    },
    {
        "title": "Cr1t- - Dota 2 Wiki",
        "content": "... for a month before their bootcamp in March focusing on more prestigious tournaments such as Dota 2 Asia Championships 2017 and the Kiev Major 2017."
    },
    {
        "title": "A&E | Watch Full Episodes of Your Favorite Shows",
        "content": "A&E Crime Central. Stream hundreds of episodes of A&E's classic crime series and specials, like 60 Days In, After the First 48 and more, with no commercials."
    },
    {
        "title": "DotA",
        "content": ""
    },
    {
        "title": "History of Woman Suffrage/Volume 3/Chapter 43",
        "content": ""
    },
    {
        "title": "Radiation Oncology/Radioimmunotherapy",
        "content": ""
    },
    {
        "title": "Ceb - Liquipedia Dota 2 Wiki",
        "content": "18.11.2021 · Sébastien \"Ceb\" Debs (formerly known as 7ckngMad) is a French/Lebanese professional Dota 2 player who last played for OG. He announced his retirement from the competitive scene on November 18th, 2021."
    },
    {
        "title": "Why aren’t there any in-game items such as skins (dota 2 or cs:go, for example) listed on Opensea platform or any other?",
        "content": ""
    },
    {
        "title": "Map of Dota 2 (from Dota 2 wiki [5]). - ResearchGate",
        "content": "Download scientific diagram | Map of Dota 2 (from Dota 2 wiki [5]). from publication: On Successful Team Formation: Statistical Analysis of a Multiplayer ..."
    },
    {
        "title": "PRACTICING ARTICLES A/AN - An English-Zone.Com Quiz",
        "content": "Check your answers here: 1. a boy 2. an animal 3. a doctor 4. an honest girl 5. an egg 6. a piece 7. an old hairbrush 8. a large country 9. an English dictionary 10. An apple."
    },
    {
        "title": "Dota 2 down? Current outages and problems | Downdetector",
        "content": "2 дн. назад · @appletesterrus has already announced the integration of Wi-Fi Dual Station technology into the Steamworks SDK for games such as Dota 2 and Counter-Strike: Global Offensive. According to Qualcomm, this made it possible to reduce the signal delay value during wireless connection by 4 times."
    },
    {
        "title": "Why aren’t there any in-game items such as skins (dota 2 or cs:go, for example) listed on Opensea platform or any other? (xpost from /r/opensea)",
        "content": ""
    },
    {
        "title": "BEAT esports - Home of the BEAT Invitational",
        "content": "One of Canada's oldest tournament operators. Since 2011, we've operated in several major games such as Dota 2, Overwatch, PUBG and Path of Exile. We've worked ..."
    },
    {
        "title": "A Artist Song Lyrics",
        "content": "1 Lyric & 1 Album. A Bitter Farewell. 3 Lyrics & 3 Albums. A Black Rose Burial. 6 Lyrics & 2 Albums. A Blaze of Feather. 13 Lyrics & 5 Albums. A Blinding Silence. 11 Lyrics & 2 Albums."
    },
    {
        "title": "DOTA 2 Gallery: Wallpapers, fan art, loading screens ...",
        "content": "Welcome to the DOTA 2 HD wallpapers website! Here you will find the best widescreen wallpapers, fan arts & posters with resolutions such as 1920x1080, 2560x1440, 1600x900 and 1366x768 pixels. Any pictures available for download in full resolution (as is) with no registration."
    },
    {
        "title": "Are there any reinforcement learning environments in which actions have specific meanings (such as hero skills in League of Legends and Dota 2)?",
        "content": "Rather than output torque in Mujoco, or front, back, left, and right in atari. And is there a recommended system environment with product description information?"
    },
    {
        "title": "Autism Support Services in Maryland - The Whole Self Center",
        "content": "Our Therapeutic Integration Program for children and adolescents is designed to help individuals develop social skills, enhance self esteem, and practice effective ways of managing their own behavior. Our program is held at The Whole Self FriendShip Center. The building is located at 331 Gambrills Road, Suite 10, Gambrills, MD 21054. Take a tour of our facility and find out about our ..."
    },
    {
        "title": "Dota 2 just experienced its biggest growth in 31 months ...",
        "content": "01.11.2021 · Dota 2 patch 7.30e came out on October 29, and with it, some tweaks to the game. Overpowered heroes received long-awaited nerfs, while heroes who were absent at TI10, such as Spirit Breaker, got some love from IceFrog. While Marci clearly still needs some tweaks, Dota 2 is more balanced than ever, which encourages players to invest in the game."
    },
    {
        "title": "[DOTA 2] How are \"normal\" warriors such as Axe, Sven, Tresdin or Yurnero capable of killing of going toe to toe and even killing beings such as Chaos Knight or Darkterror?",
        "content": "Do the ancient buff them up? Are the fundamentals weakened by the ancients?"
    },
    {
        "title": "Best Dota 2 Betting Sites & Sportsbooks - Basketball Insiders",
        "content": "Nov 2, 2021 — Skin betting are usually cosmetic items that can be purchased through video games, such as Dota 2. Players have long purchased and sold ..."
    },
    {
        "title": "Pass your drug test - pass a marijuana urine drug test ...",
        "content": "Pass Your Drug Test offers Solutions on how to Pass a Drug Test. Pass Your Drug Test offers many ways for everyone over 18 to pass a drug test easily. We don't just offer products to ensure a passing drug test, we go a step further and bring you loads of useful drug testing information to help you understand the whole drug testing process. Employee drug tests are on the rise and corporations ..."
    },
    {
        "title": "Dota 2 hero tier list | TI10 edition (October 2021) - Dot ...",
        "content": "12.10.2021 · Dota 2’s metagame is notorious for shifting and changing courses on a dime given the flexible nature of hero roles and the huge impact items have on the game. These days especially, diverse ..."
    },
    {
        "title": "PSA: In case of a security emergency such as an XSS attack or even remote code execution/denial of service vulnerability with any Valve site or applications (such as Dota 2 or stuff involving the economy), run for Valve's security page and report the vulnerability",
        "content": "### Said page: http://www.valvesoftware.com/security/ Earlier in the evening, a page was discovered on the Steam Community where if a user navigated to a certain user's Dota 2 inventory, there was an XSS attack that executed offsite code. This has however since been fixed by Valve, but although the attack in question was apparently merely just playing audio, XSS attacks are extremely dangerous nonetheless. Valve's security page, linked above, was created after a push a little while ago from se..."
    },
    {
        "title": "ESL Quiz - A, An, The, or (Nothing) (Larry Davies) I-TESL-J",
        "content": "A, An, The, or (Nothing) This coat was designed by ___ famous New York artist. Answer a. Can you tell me how to get to ___ bank from here? Answer a OR the. ___ city museum is closed today. Answer The. He is one of ___ smartest people I know. Answer the."
    },
    {
        "title": "Silencer/Counters - Dota 2 Wiki",
        "content": "Broodmother relies less on abilities and more on right-clicks. Spiderlings can overwhelm Silencer, who has mediocre armor and no escape tool. If Silencer can't prevent Dragon Knight from using Elder Dragon Form, Silencer's spells aren't going to be that effective against him, as Dragon Knight relies on right-clicks and not spells. Dragon Blood's armor bonus and health …"
    },
    {
        "title": "Among Us, a game that was made by small indie development with just 3 developers, has just crossed 1.5 million concurrent players across all platforms. This exceeds the lifetime peak concurrent playerbase of games such as Dota 2 and CS:GO.",
        "content": "I personally find it quite amazing that a game that was effectively made by a small indie development team with only 3 developers, has just exceeded the player counts of CS:GO and Dota 2. To make things even more impressive, only 1 of these 3 developer worked on the game during the majority of it's lifecycle. These games occupy the #2 and #3 spots respectively in terms of peak player counts and are both big budget games with huge dev teams working on them at their peak. Sources: [https://ww..."
    },
    {
        "title": "A & A Engineering Home Page",
        "content": "After 41 years, no more 12 hour work days. Please allow extra time to process all orders. We have moved. Our new address is: 7970 Orchid Drive, Buena Park CA 90620-1930. Effective NOV 2014, company phone and FAX lines have been discontinued. The best way to contact us is via EMAIL to: orderaaengr@aol.com."
    },
    {
        "title": "Among Us, a game that was made by small indie development with just 3 developers, has just crossed 1.5 million concurrent players across all platforms. This exceeds the lifetime peak concurrent playerbase of games such as Dota 2 and CS:GO.",
        "content": "I personally find it quite amazing that a game that was effectively made by a small indie development team with only 3 developers, has just exceeded the player counts of CS:GO and Dota 2. To make things even more impressive, only 1 of these 3 developer worked on the game during the majority of it's lifecycle. These games occupy the #2 and #3 spots respectively in terms of peak player counts and are both big budget games with huge dev teams working on them at their peak. Sources: [https://www...."
    },
    {
        "title": "Welcome to Fashion Inc. | Manufacturer of Canopies, Metal ...",
        "content": "Fashion is the nation's leading manufacturer and installer of Canopies & Fascia Systems, Architectural Metal Roofing, Exterior Wall Panel Systems, Custom Modular Buildings, and Corporate Signage."
    },
    {
        "title": "Macbook pro CPU usage high and macbook itself extremely hot when playing dota 2 and other games such as CS:GO",
        "content": "Hey guys, My macbook pro specs are: MacBook Pro (15-inch, 2019) Processor: 2.3 GHz Intel Core i9 Memory: 16 GB 2400 MHz DDR4 Graphics: Radeon Pro 560X 4 GB. Intel UHD Graphics 630 1536 MB &#x200B; I got a macbook pro fairly recently and I have noticed that whenever I play games such as CS:GO or DOTA 2, my macbook gets very hot and my CPU usage becomes around 200+ %. Not to mention there is a bunch of noise. I just wanted to know is this normal? if not, what can I do to fix it? I ..."
    },
    {
        "title": "AT&T Official Site - Unlimited Data Plans, Internet ...",
        "content": ""
    },
    {
        "title": "There needs to be a term glossary somewhere in the Dota 2 client. It would define things such as \"strong dispel only\" and the function of things like \"root\" and \"mini stun.\"",
        "content": "I looked around and didn't see anything like this. For experienced players most of these terms are fairly common knowledge but with patches changing mechanics regularly I believe there really needs to be an easy place to look up all these terms and mechanics."
    },
    {
        "title": "Labor & Industries (L&I), Washington State",
        "content": "L&I is workers' comp, workplace safety, labor and consumer protection, trades licensing, contractor registration and license lookup for public safety in Washington State."
    },
    {
        "title": "Would a Dota 2 classic mode have any success? Such as having the ability to play 6.79 or 6.81 or something around there?",
        "content": "I stopped playing dota back in summer 2016 after totally losing interest in the game due to the direction it was headed. Every patch seemed to just cater to casuals and eventually it just wasn't fun to me anymore. I don't expect to find many people here who are in my shoes, as people who quit probably don't read the sub. But after games like Runescape and now WoW releasing classic servers, I wonder if there is any chance of such thing in Dota 2? In my opinion this game is a total disgrace right..."
    },
    {
        "title": "Drum & Bass, Dnb, D&B, Oldskool, Jungle ... - Bassjunkees",
        "content": "drum & bass, jungle, oldskool, dubstep, dnb, d&b live internet radio - music for the masses 24/7. once locked addicted for life."
    },
    {
        "title": "What would Dota 2 be like with other game modes such as TDM or CTF?",
        "content": "I'm still relatively new to MOBA games but I was wondering why it hasn't expanded to other game modes other than the classic one and how they could be incorporated in."
    },
    {
        "title": "Welcome to My Activity",
        "content": "Welcome to My Activity. Data helps make Google services more useful for you. Sign in to review and manage your activity, including things you've searched for, websites you've visited, and videos you've watched."
    },
    {
        "title": "ShadowPlay/Share in GFE 3.0 is apparently such a mess that Valve's lumping it in alongside MS' Game DVR in Win10 performance recommendations as of the latest Dota 2 update (and presumably CS:GO soon as well)",
        "content": "Via [the Steam store](http://store.steampowered.com/news/25239/): - Added a dialog on startup to correct a common performance problem on Windows 10. Now, you might think \"well, didn't they already add a notice about Game DVR?\", and you'd be right. However, Valve's effectively replaced it, and instead that notice is now the following: >Your computer has **Nvidia Shadowplay** or Xbox Game DVR enabled. These features have been reported to cause performance problems in games such as reduced FP..."
    },
    {
        "title": "All Elementary Mathematics - Online Mathematical School...",
        "content": "Web high mathematical school. All sections of curriculum of elementary mathematics. Arithmetic, algebra, geometry, trigonometry, functions and graphs, analysis. Theory and solving problems. Versions of examination tests. Online consulting. Preparatory to universities and colleges."
    },
    {
        "title": "What's your relationship with computer games involving a time commitment, such as Dota 2 or WoW?",
        "content": "Life's tough, man. I feel like I'm queued for Dota right now just because I almost can't do anything else."
    },
    {
        "title": "A&L - Windows",
        "content": "A&L - Windows"
    },
    {
        "title": "I will be coaching the legendary Angwe in Dota 2 - With personalities such as Tasteless and others getting interested in the game I want to ask: Who else wants to learn from an experienced player and Dota 2 caster?",
        "content": "For those of you that are unfamiliar with who Angwe is, [here's an AMA the Ganker God did a while ago](http://www.reddit.com/r/IAmA/comments/11dkyd/i_am_angwe_the_ganker_god_of_world_of_warcraft_ama/) In the AMA, he mentioned he plays League of Legends. I offered him Dota 2 coaching and he said he will think about it. Recently I have added him on Steam and hope to be recording a few of our gaming/voice chat sessions for your viewing pleasure in the near future (and/or livestreaming it). Abou..."
    },
    {
        "title": "Alexandria® - Building the Future of Life Science™",
        "content": "ALEXANDRIA'S BEST-IN-CLASS REPORTING. We are proud to be recognized for our best-in-class transparency, quality, and efficiency of communications and reporting to the investment community."
    },
    {
        "title": "Cheapest possible PC for 144hz gaming for games such as Dota 2 and CSGO",
        "content": "Hey guys, &#x200B; I want to upgrade my current PC set up. I am currently rocking an i7-2600k, amd 480 4gb, 8gb ram, 500gb HDD, 2 SSDS, 650w Corsair PSU. I want to upgrade my pc to be able to play e sports games such as dota and csgo at solid 140fps+ &#x200B; Please recommend me the cheapest possible components to reach that fps. I'm from the UK so it would be nice to get the price in british pounds. &#x200B; Also I plan on keeping my current case, my 3 hard drives, and PSU...."
    },
    {
        "title": "Spencer County, IN | Official Website",
        "content": "Provides contacts and forms for departments, access to land records and area resource links."
    },
    {
        "title": "/r/diagonio - Diagon is a decentralized eSports ecosystem that will enable people from all around the globe to test their expertise and contest in 1v1 and group versus group matches for prominent online-based games, such as Destiny 2, League of Legends, Dota 2, and Fort... (31.15% growth)",
        "content": ""
    },
    {
        "title": "Equity Trading Software | Trading Signals | Commodity ...",
        "content": "AbleSys equity trading software provides specific market direction, resistance levels, buy/sell and stop trading signals for any market. The trader needs commodity trade software to manage all activities. Read about trading system and stay up to date with our equity trading software."
    },
    {
        "title": "I'm primarily a 4/5 support player returning to Dota 2 after ~12-18 months away. Can you recommend any resources to catch back up to the game, such as new pull timers, ward spots, game flow, etc.?",
        "content": "Hi all, Looking to get back into Dota after some time away. I've kept up with the game somewhat using resources such as the Dota Alchemy YouTube channel, but I was wondering if you all had additional recommendations to catch back up? Things such as the new jungle setup, neutral items, outposts, etc. are fairly foreign to me at this point. Thanks!"
    },
    {
        "title": "A&I Products: Agricultural, Industrial & Turf Manufacturer ...",
        "content": "Quality aftermarket replacement parts, helpful customer service, top-notch technical staff, and next-day parts delivery makes getting the parts you need affordable, quick, and easy. Next time you need replacement agricultural, lawn & garden, or industrial parts, come see us!"
    },
    {
        "title": "Have you ever been to a professional Dota 2 tournament such as The International or any other smaller events?",
        "content": "I have attended one in my lifetime, for which I am very lucky. MLG Columbus in Columbus, Ohio, USA that was held from November 21st-23, 2013, at the Greater Columbus Convention Center. I got to watch (and almost meet in person!) teams such as Na'vi, Fnatic, Alliance, Speed Gaming (now Cloud 9), and Team Liquid compete for a $50,000 prize pool. (Proof below) The atmosphere was just so comfortable, being surrounded by hundreds of other people like me that live for the game. Free Dr. Pepper all ..."
    },
    {
        "title": "Welcome to S&S Cycle! Proven Performance For The ...",
        "content": "The leader in performance motorcycle parts for Harley-Davidson® motorcycles and the powersports industry."
    },
    {
        "title": "How come Dota 2 streamers get small number except for the 1% such as Bulldog and Arteezy.",
        "content": "It seems odd no one cares to watch Demon who rarely hangs around 1k viewers, or other talented streamers out there that grind everyday. I feel like we either all snowball into one streamer when there's no tournament on, or Dota 2 section on Twitch is just quiet."
    },
    {
        "title": "Tom Petty | Mudcrutch Farm - A Tom Petty Fan Community",
        "content": "Tom Petty and the Heartbreakers fan community all about Tom Petty and his music."
    },
    {
        "title": "Dota 2 is 100% fundamentally broken on the most basic matchmaking mechanic such as behavior score. this is 100% factually proven now.",
        "content": "So maybe my last post was too articulate and intelligent for Valve... I'll try to dumb it down this time... **It's 100% proven that new accounts with perfect Conduct Summaries and pristine behavior automatically have horrendous sub 5k Behavior Scores BY DEFAULT!!!** **That's a FACT!!! I'm not sure if anyone is paying attention yet but that's 100% fact.** **IF YOU NEED THE SCIENTIFIC PROOF (WHICH VALVE DOES NEED BTW...)???** &#x200B; **Here is my original post about it, 100% scientific ..."
    },
    {
        "title": "HTTP/2",
        "content": "What is HTTP/2? HTTP/2 is a replacement for how HTTP is expressed \"on the wire.\" It is not a ground-up rewrite of the protocol; HTTP methods, status codes and semantics are the same, and it should be possible to use the same APIs as HTTP/1.x (possibly with some small additions) to represent the protocol. The focus of the protocol is on performance; specifically, end-user perceived latency ..."
    },
    {
        "title": "19/M/CST/PC I play a variety of games such as Dota 2, Rift, Overwatch, DBFZ and Fortnite.",
        "content": "Just looking for some fun people to game with at all times of the day. I free and down to play all the time. PM me on here and Ill add you on discord so we can chat and have some fun!"
    },
    {
        "title": "Meditation Moments | Minister Darrick D. McGhee",
        "content": "Meditation Moments | Minister Darrick D. McGhee"
    },
    {
        "title": "USDA",
        "content": "Upon login you agree to the following information: You are accessing a U.S. Government information system, which includes (1) this computer, (2) this computer network, (3) all computers connected to this network, and (4) all devices and storage media attached to this network or to a computer on this network. This information system is provided ..."
    },
    {
        "title": "Dark Horse Yarn, Dark Horse Yarns, Novalty Yarns, White ...",
        "content": "Dark Horse Contact Us 6996 HWY. 2, Commerce City, CO 80022 Phone: (303) 288-0788 Fax: (303) 288-0820"
    },
    {
        "title": "So - such - exercises",
        "content": "So, such exercises. English grammar exercises and tests. Elementary and intermediate level exercises"
    },
    {
        "title": "A&W Restaurants | A&W® All American Food",
        "content": "Looking for some hometown goodness? Take a look at what's going on at your local A&W, stop in and lets us know how we're doing!"
    },
    {
        "title": "dotas",
        "content": ""
    },
    {
        "title": "History of Woman Suffrage/Volume 1/Chapter 6",
        "content": ""
    },
    {
        "title": "Cultural Anthropology/Play, Sport and Arts",
        "content": ""
    },
    {
        "title": "Free-to-play - Wikipedia",
        "content": "Free-to-play (F2P or FtP) video games are games that give players access to a significant ... For example, some games, such as Dota 2, Fortnite Battle Royale, and ..."
    },
    {
        "title": "doto",
        "content": ""
    },
    {
        "title": "Federal Reporter/Second series/Volume 482",
        "content": ""
    },
    {
        "title": "History of video games/Esports",
        "content": ""
    },
    {
        "title": "Role Identification for Accurate Analysis in Dota 2",
        "content": "by S Demediuk · 2019 · Cited by 8 — Abstract. Esports is an organised form of video games played com- petitively. The esports industry has grown rapidly in recent."
    },
    {
        "title": "daughter",
        "content": ""
    },
    {
        "title": "Federal Reporter/Second series/Volume 513",
        "content": ""
    },
    {
        "title": "History of video games/Print version/Specialty topics",
        "content": ""
    },
    {
        "title": "exploring gaming jargons used by world's - International ...",
        "content": "by MFFBIN RAMLEE · 2020 — Keywords such as “DotA 2 funny chat”, and “DotA 2 gameplay” were used in order to search for relevant channels. The results were then.118 pages"
    },
    {
        "title": "dos",
        "content": ""
    },
    {
        "title": "Federal Reporter/Second series/Volume 480",
        "content": ""
    },
    {
        "title": "English-Mirad Lexicon N-Z",
        "content": ""
    },
    {
        "title": "BEAT Gaming announces 9th season for DOTA 2 in ...",
        "content": "Apr 23, 2020 — ... Canadian esports company that has organized internationally recognized events such as Dota 2, Overwatch and PUBG BEAT Invitational."
    },
    {
        "title": "dot",
        "content": ""
    },
    {
        "title": "Federal Reporter/Second series/Volume 746",
        "content": ""
    },
    {
        "title": "Mirad/Print version",
        "content": ""
    },
    {
        "title": "Dota 2 & The Game Center (Discord) - Steam Community",
        "content": "Such as Dota 2 voice and text channels with a fantastic Dota 2 stat retrieving bot. Its pretty good, so come and check it out! https://discord.gg/5bjrtnD ..."
    },
    {
        "title": "P1.2 Million Dota 2 Gambling Match Reveals Gaps in PH ...",
        "content": "Dec 10, 2015 — Because of the top-heavy nature of competitive computer games such as Dota 2, teams who join international and local tournaments often face ..."
    },
    {
        "title": "Valve rescinds PH 'Dota 2' tournament's Major designation",
        "content": "Jan 5, 2018 — The decision is 'based on what we feel are unreasonable infringements on the privacy of the players, as a condition to enter the country,' ..."
    },
    {
        "title": "Dota 2 Gets a New Mode for Viewers With Steam VR - NDTV ...",
        "content": "Apr 7, 2016 — Non-VR games such as Dota 2 can be viewed or played on a virtual 100-inch projector screen - courtesy of the Steam VR \"Game Theater\" feature ..."
    },
    {
        "title": "Is Dota 2 dying? - Gaming Section",
        "content": "Method 1. Restore Lost Games from Steam Library. Open up Steam game player on your device and go to Library. Find the lost game name on the left panel, such ..."
    },
    {
        "title": "Federal Reporter/Third series/Volume 33",
        "content": ""
    },
    {
        "title": "toad",
        "content": ""
    },
    {
        "title": "Mirad Grammar/print version",
        "content": ""
    },
    {
        "title": "Master Thesis Survey about MOBA/ARTS such as Dota 2",
        "content": "Important notice: The survey has reached the limit of total responses! I had to close the survey. The power of reddit is too stronk. :D Thank you so…"
    },
    {
        "title": "dotais",
        "content": ""
    },
    {
        "title": "Mirad Grammar/print version of dictionary",
        "content": ""
    },
    {
        "title": "A Bayesian adjusted plus-minus analysis for the esport Dota 2",
        "content": "by N Clark · 2020 · Cited by 2 — We seek to apply an Adjusted Plus Minus (APM) model, an accepted analytic approach used in traditional sports like hockey and basketball, to one ..."
    },
    {
        "title": "Dota",
        "content": ""
    },
    {
        "title": "Cultural Anthropology/Print version",
        "content": ""
    },
    {
        "title": "Bet like a pro with the best Dota 2 Esports Betting Sites 2021",
        "content": "Nov 29, 2021 — Many bookmakers see Dota as a major eSport, and have acted on this to provide some form of betting coverage for Dota. Dota Betting Markets — ..."
    },
    {
        "title": "dote",
        "content": ""
    },
    {
        "title": "At least one player leaves in 11.7 percent of all Dota 2 matches",
        "content": "Jul 16, 2019 — Team games, such as Dota 2, will always be subject to a human element that some single-player competitive games aren't."
    },
    {
        "title": "doter",
        "content": ""
    },
    {
        "title": "OpenAI's Dota 2 AI steamrolls world champion e-sports team ...",
        "content": "Apr 13, 2019 — OpenAI, the nonprofit research organization founded by Elon Musk, can claim a world first: its artificial intelligence system trained to ..."
    },
    {
        "title": "Dota 2 with Large Scale Deep Reinforcement Learning - OpenAI",
        "content": "Dec 13, 2019 — Abstract. On April 13th, 2019, OpenAI Five became the first AI system to defeat the world cham- pions at an esports game. The game of Dota 2 ..."
    },
    {
        "title": "Dota 2 Odds - Betting odds comparison table & guide 2021",
        "content": "This comprehensive Dota 2 odds guide will help you gain a deeper understanding of how odds work, where to boost your bets with the best odds around."
    },
    {
        "title": "Esports teams and events stats: Dota 2, LoL, CS:GO | Esports ...",
        "content": "Esports Charts is a unique analytical service that investigates trends of esports development and streaming in general. Our service makes esports more ..."
    },
    {
        "title": "Where to Watch Dota 2 International 2014 | DOTA2 - Game ...",
        "content": "Jul 8, 2014 — Some of the best teams in eSports will be competing for the top prize, from Alliance to Na'Vi, Evil Geniuses to Cloud 9. No matter who you are ..."
    },
    {
        "title": "An Opinion on Valve's Notorious Silence Around Dota 2 - AFK ...",
        "content": "Jul 13, 2021 — This article discusses the need for a community manager for Dota 2, given Valve's lack of communication on the issues that have piled up in ..."
    },
    {
        "title": "dotat",
        "content": ""
    },
    {
        "title": "“Trouncing in Dota 2: An Investigation of Blowout Matches ...",
        "content": "Aug 10, 2020 — Abstract: “With an increasing popularity, Multiplayer Online Battle Arena games where two teams compete against each other, such as Dota 2, play ..."
    },
    {
        "title": "doat",
        "content": ""
    },
    {
        "title": "Mass Dota 2 purge resets over 17000 'cheat' accounts",
        "content": "Jan 11, 2019 — Games such as Dota 2, and online multiplayer titles in general will always be plagued with problems as people bend the rules to protect ..."
    },
    {
        "title": "carrozar",
        "content": ""
    },
    {
        "title": "VisualizAncients - a DotA 2 visualization",
        "content": "These visualizations aim to inform the viewer of game combat statistics. These statistics include total player and team deaths and kills, average player ..."
    },
    {
        "title": "crit",
        "content": ""
    },
    {
        "title": "Surviving the basics of DOTA 2 | Engadget",
        "content": "DOTA 2 is Valve's updated version of the classic WarCraft 3 custom map Defense of the Ancients, known colloquially as DotA.Nov 8, 2012 · Uploaded by empathe"
    },
    {
        "title": "dato",
        "content": ""
    },
    {
        "title": "How to get into competitive Dota 2 if you have no team?",
        "content": "joinDOTA is a Dota 2-portal dedicated to broadcasting, community, tournaments, news & coverage of Dota 2, the game created by Valve."
    },
    {
        "title": "Keyboard and Mouse suggestion for pc games(such as Dota2)",
        "content": "Dec 4, 2014 — I just got on board the \"gaming peripherals\" train. I got the Razer BlackWidow Chroma 2 weeks ago, and it's really sweet. From what I've heard, ..."
    },
    {
        "title": "Dota 2 down? Current outages and problems | Downdetector",
        "content": "Real-time outages and problems for Dota 2. Can't log in? Is the server down? Here you see what is going on. Rating: 4 · ‎760 votes"
    },
    {
        "title": "Best budget gaming laptops to play Dota 2 in 2021 - DotaHaven",
        "content": "Is it time to upgrade to a new gaming laptop, but you are on a tight budget? Worry not since you can find a decent gaming laptop that can keep up even with ..."
    },
    {
        "title": "BSOD Playing Full Screen Games Such as Dota 2 and CSGO",
        "content": "Jul 3, 2016 — Hello, As of lately I have been getting the Page Fault in Non-Paged Area BSOD error (Most of the time it happens while playing Dota 2 or ..."
    },
    {
        "title": "eGG Network HD | Astro Content",
        "content": "eGG Network is a 24/7 eSports & gaming entertainment network. The channel showcase the biggest eSports leagues and tournaments, and the best in gaming ..."
    }
]