[
    {
        "title": "What does meta mean in gaming and especially in DOTA?",
        "content": ".. meta in Dota 2 means the one with the \"most effective tatics available\" will alter the database tables of your account and then you play in herald 1 till you quit this game .. Last edited by Zockolade ; Jul 22, 2020 @ 8:50am"
    },
    {
        "title": "dos",
        "content": ""
    },
    {
        "title": "Open individualism",
        "content": ""
    },
    {
        "title": "History of video games/Esports",
        "content": ""
    },
    {
        "title": "Birds of North and Middle America, part V/Genus 8. Dysithamnus Cabanis",
        "content": ""
    },
    {
        "title": "Glossary - Dota 2 Wiki",
        "content": "Most commonly means to either buy a gem, or to be careful of the enemy team as they possess a gem (especially for allied invisible heroes). gg: \"Good game\"."
    },
    {
        "title": "Dota 2: All The Confirmed Offseason Roster Shuffles So Far",
        "content": "Eliana is a freelance journalist from Australia with a passion for esports, especially Dota 2. A casual player of the game for the better part of a decade, Eliana started following the professional circuit avidly during TI5. She brings a casual player and hardcore fan perspective into her commentary on the professional scene."
    },
    {
        "title": "Mirad Grammar/Vocabulary Formation",
        "content": ""
    },
    {
        "title": "Birds of North and Middle America, part V/Genus 13. Ramphocænus Vieillot",
        "content": ""
    },
    {
        "title": "Ok I'm reposting this cause some people got confused 😅. The main focus here is SirActionSlacks and Capitalist. Both are legends in the Dota 2 community. Slacks is a beloved Dota 2 host while Capitalist is a legend in casting especially the recent stuff in TI9. YouTube will have all your answers."
    },
    {
        "title": "MSI Gaming G Series Case Badge how much does this cost? I got it from lucky draw in msi dota 2 tournament in my city 4 years ago alongside with msi dragon figure which i posted here some time ago. Seems like a collectible as it's hard to find who is selling the exact same item, especially in local"
    },
    {
        "title": "DOTA 2 - Los HÉROES de FIESTA - ESPECIAL DE LOS 1000 SUSCRIPTORES"
    },
    {
        "title": "DOTA 2 - ESPECIAL de los 100 SUSCRIPTORES - CELEBRANDO con AMIGOS"
    },
    {
        "title": "Dota 2 Oracle Mid!! Have you guys tried this yet? It's time to take support to mid as the new meta :D! Oracle is especially more fun in lower brackets early/mid game. Drop a like if you like it :)"
    },
    {
        "title": "Filter word,especially in DOTA 2 - Dota2 Dev",
        "content": "No flaming or derogatory remarks, directly or through insinuation. No discussion, sharing or referencing illegal software such as hacks, keygen, cracks and ..."
    },
    {
        "title": "Marci - new hero and new problem",
        "content": "Especially Dota 2 players who are mostly guys. And this is where the first problem begins. The hero is one, there are many who wish to try. The first thing most players go after the patch is to play a new hero. In the early days, fierce battles take place. Before the game even started, many fought for the right to play on Marci."
    },
    {
        "title": "Dota 2 Overwatch sorely lacking especially for catching ...",
        "content": "Being unable to view chat is bad enough imo for assessing people's intentions in game (lots of people intentionally grief but disguise it as kill attempts which look like the player is just bad & not griefing) but being unable to view the enemy team's fog AND being unable to view pings makes it virtually impossible to catch cheaters who are cheating by pinging the locations of enemy wards, because you can't see the ward and you can't see their ping. For Dota 2 Overwatch to be effective i..."
    },
    {
        "title": "History of video games/Print version/Specialty topics",
        "content": ""
    },
    {
        "title": "History of Woman Suffrage/Volume 3/Chapter 43",
        "content": ""
    },
    {
        "title": "Please Stay Weird Especially in Dota 2",
        "content": "The Summit 9 reasoned Sunday night, also seemingly Valve had their eyes to the function. The development team supporting Dota 2 fell a patch right after the event finished, and less than a month to go before The International, it is clear they are seriously interested in getting the match in a watchable country for lovers prior to the huge yearly tournament."
    },
    {
        "title": "Cultural Anthropology/Play, Sport and Arts",
        "content": ""
    },
    {
        "title": "History of Woman Suffrage/Volume 1/Chapter 6",
        "content": ""
    },
    {
        "title": "An urban dictionary for Dota 2 | Red Bull",
        "content": "Jul 27, 2016 — Watching Dota 2 but baffled by the lingo? ... so a high creep score is really useful, especially when your character is item-dependent."
    },
    {
        "title": "The Best Dota 2 Heroes For Beginners in 2021 | DMarket | Blog",
        "content": "On the other hand, Crystal Maiden helps immensely the whole team, and especially Dota 2 carries by slowing enemies and restoring mana to teammates. The bundle of cosmetic items for Crystal Maiden Autographed Wraps of the Winterbringer is one of the most expensive items on Steam ."
    },
    {
        "title": "Mirad/Print version",
        "content": ""
    },
    {
        "title": "Dota 2 especially (despecially) - Profile | Pinterest",
        "content": "Dota 2 especially. plus.google.com/101416861277642188333·@despecially. 1 follower. ·. 0 following. Follow. despecially hasn't saved any Pins yet."
    },
    {
        "title": "Six Tips For Winning More Games In Dota 2 - GamerzClass",
        "content": "Nov 15, 2021 — Dota 2 is quite a complex game. ... this makes the game ridiculously hard to get good at, especially if you're just starting out."
    },
    {
        "title": "[Q] Is trading actually dying? especially dota 2 trading?",
        "content": "You rarely ever find big traders like before anymore, what happened? i feel like its slowly dying."
    },
    {
        "title": "How do we tackle corruption in a multifaceted esports ...",
        "content": "Other esports are yet to follow especially Dota 2 and PUBG. Valve has not made a definitive judgment call about Dota 2. Its commonplace for the same organizations to have multiple Dota 2 rosters. Most recently TI Champion OG had to disband their second team OG.Seed due to conflicts with schedule and competition."
    },
    {
        "title": "Looking for a PC that can play most games but Especially Dota 2 at max settings $900-1000 dollar budget",
        "content": "I primarily play Dota2 and would like to be able to run it at max settings and a solid fps. also need a keyboard but already have a monitor. In PA United states. A Micro center is not too far away from me that would be an option."
    },
    {
        "title": "What do you think of the last-hitting mechanic in ... - Quora",
        "content": "Answer (1 of 3): Last hitting mechanics is CRUCIAL to any MOBA game, especially DOTA 2. Only DOTA 2 allows a player to deny a creep when its health reaches below the 50% threshold, unlike many other MOBA's. Some may say this makes the game unnecessarily more complex but nope, it brings a whole n..."
    },
    {
        "title": "We are working on Human Behavioural studies, especially Dota 2 rage induced. Please help us out!",
        "content": "My partner and I are working on a Human Behaviour project. Specifically, it deals with rash, intuitive decisions made based on emotions. We want to see how rage in Dota 2 can come into everyday effect. Of course if you are a consistent winner, we'd love to see how that plays out into real life as well. By seeing the before-a-game/post-game differences, we want to see if success or failure in a video game can affect how people act in real life. We hope that through this, dota players can perhaps..."
    },
    {
        "title": "Because of a HUGE BUG, TI8 champions is unconvencing ...",
        "content": "Every game, and especially Dota 2 is about finding weaknesses in the game to bend to their will, it's always happened, and pro's always are good at finding this. You are just a salty chinese little man, OG were the superior team, throughout the competition they proved this, they were the under dogs in every single game, and yet they pulled ..."
    },
    {
        "title": "How can I port all sound through the right side of my G933 headset?",
        "content": "I am deaf but I use a cochlear implant on my right ear. I've noticed in many games, especially DOTA 2, that there's a lot of audio that only comes through the left side depending on where your screen is. I've tried a lot of settings (Windows 10 sound settings, Logitech Gaming Software settings, game-specific settings) but there has to be some universal software somewhere that allows me to move all audio to the right speaker and not the left. How can I do this?"
    },
    {
        "title": "Cheryl Foil",
        "content": "I regularly attend eSports events, especially DoTA 2 and SC II. I was a World of Warcraft gladiator (top .5%) as paladin-warrior and won the Blizzard Holiday Baking Contest in 2007. Background. I was born in Palo Alto, CA and grew up in Northern Virginia. My grandmother was the first woman to earn a Computer Science Master's from Mississippi ..."
    },
    {
        "title": "DOTA 2 please regulate and maintain your servers. Especially SEA server.",
        "content": "Freezes, spikes and fluctuations of pings making this game less enjoyable. Wake up and do some maintenance. This community deserves better."
    },
    {
        "title": "Ryzen 5 4650G APU crashing in some games : AMDHelp",
        "content": "It would consistently crash in some games (especially Dota 2), and would also occasionally crash while I was doing productivity tasks: coding, writing documents etc. I got the exact same image artefacts on my monitor as what is shown in your first image a few times, but no event log entries similar to yours."
    },
    {
        "title": "Project Mid or Feed: A Study on the Personality Traits, Gaming Motivations, and Hero Choices of Dota 2 Players",
        "content": "**Introduction** Hey guys, this is Lili! I conducted a survey for a research paper in my graduate class in Psychology about the **personality traits, motivations for playing, and hero choices of Dota 2 players.** I would like to share the results I got here, but please take note that this is done as a way for us to practice the survey research method. I am also not a licensed psychometrician or psychologist (yet) and I’m still on my second year in MA Psychology. **Note: If you want to see gr..."
    },
    {
        "title": "Blue Screen with code : PAGE_FAULT_IN_NONPAGED_AREA ...",
        "content": "Recently i got random bluescreen while i am playing game especially Dota 2 i cant figured out why, this happen since 3 days ago, please help DMP and NFO Files :"
    },
    {
        "title": "League of legends, most toxic community ever?",
        "content": "I disagree with this misconception. I've been playing league everyday for basically the last two months. I'm a new player, met some interesting people and made friends. Played ranked, currently silver 4 and main top. I also have played dota 1 and 2, smite and most if not all the MOBAs that are out or was out. But for some reason, the amount of slack league players get for being toxic. I think is completely surprising to me. I literally haven't gotten a game where they're completely flaming me. I..."
    },
    {
        "title": "Memory, Logic make MOBA players better than FPS gamers ...",
        "content": "Games, especially Dota 2 and League of Legends, are just some of the MOBA titles that are known and played by millions all over the world. The MOBA community can be considered one of the toughest group in the gaming world. Memorizing the skills, abilities, spells of the many characters is not the easiest thing to do, made even harder when the ..."
    },
    {
        "title": "OG Esports and Wintermute team up ahead of TI10. | OG",
        "content": "Wintermute's employees share our passion for competitive gaming, especially Dota 2, and often take part in esports tournaments during their free time. By joining the OG family and supporting our Dota 2 and CS:GO rosters , Wintermute takes its very first steps in esports and intends to offer fans unforgettable moments to live throughout this ..."
    },
    {
        "title": "Acer Laptops Suggestions",
        "content": "I have been researching regarding the what laptops should I get. I had a computer before but it is a build up pc, but currently I am searching for a laptop for myself, since i think it is convenient to have both PC and laptop for myself. Currently I am looking at the Helios, but I feel like it is kinda too big for me and hard to carry around. Any other suggestions other than Helios that might interest me? I like to play games, especially Dota 2, so I would like a laptop that able to support gami..."
    },
    {
        "title": "Dota 2: The International 10 - Main Event Day 1",
        "content": "Dota 2: The International 10 - Main Event Day 1. Eliana Bollati. Eliana is a freelance journalist from Australia with a passion for esports, especially Dota 2. A casual player of the game for the better part of a decade, Eliana started following the professional circuit avidly during TI5. She brings a casual player and hardcore fan ..."
    },
    {
        "title": "[Merlini] I have no further intents to cast/analyze Dota 2. I have decided that at this juncture in my life, casting does not align with what I want from my future. I am a bit sad, but we must keep forward facing. Big thanks to all who have supported me, especially when times were tough!",
        "content": ""
    },
    {
        "title": "How to Play Dota 2: from Beginner to a Pro player-the ...",
        "content": "Practicing is crucial to improve at anything, especially Dota 2. Putting in time and effort in practice that others are not willing to do will net better results. Sand King. A tanky hero with a stun and an escape tool on top of having a 2 button stun-ultimate combo, can go invisible and creates damaging seismic waves that damage the enemy."
    },
    {
        "title": "TNC: We have been made aware of Gabbi's unacceptable behavior in one of his ranked games last night. As a professional player, he has the responsibility to be a role model to his audience, especially to the Dota 2 community.",
        "content": ""
    },
    {
        "title": "ARAM in DotA 2 : DotA2 - reddit",
        "content": "I've been playing MOBA's for a while now, especially Dota 2 (2100 hours). But I also find myself playing League of Legends, but only for the ARAM. ARAM is really fun, fast-paced, and doesn't take a long time to finish a game which is really nice for a casual player like myself. Right now there is a Gold Rush ARAM custom gamemode for DotA 2, but ..."
    },
    {
        "title": "Check out my Electro playlist!",
        "content": "I listen to all kinds of music. But when it comes to gaming, especially Dota 2, Electronic music gives me immense focus! Feel free to check it out and follow the playlist and my account ;). I update it very often. Follow here ~~ - https://open.spotify.com/user/12140893886/playlist/04MKP9RB323euKpOgWZX4V?si=eGwbh8S3Rn2wHUt7geUBzA"
    },
    {
        "title": "gtb-2022-ni-congwei · GitHub",
        "content": "I have a master's in Computer Graphics, Vision and Imaging @ University College London, and I did my undergrad in Computer Science @ University of Liverpool & Xi'an Jiaotong-Liverpool University. I love playing computer games, especially Dota 2. Former school team basketball player."
    },
    {
        "title": "Am I the only one who finds HotS to be the only MOBA they like watching?",
        "content": "HotS is the only MOBA I've ever liked watching, and I think I can divide my reasons for vastly preferring it to LoL and DOTA 2 into three categories: Visuals, pacing, and mechanics. Visually, I find LoL to be repugnant with its overly-cartoony art style, while DOTA 2 is at the other end of the spectrum, with dull, dim visuals. HotS, in this regard, seems to strike a balance between the two. The issue of pacing is an obvious one. LoL and DOTA 2 matches tend to drag on for quite a long time, whi..."
    },
    {
        "title": "DOTA: Dragon's Blood Season 2 Release Date: Renewed or ...",
        "content": "Based on the immensely popular strategy video game 'DOTA' or Defense of the Ancients (especially 'DOTA 2'), 'Dota: Dragon's Blood' is a fantasy animated series. It revolves around Davion, the Dragon Knight, who becomes the host of Slyrak the Ember Eldwurm. Davion joins Princess Mirana in her journey to fulfill her clandestine mission. Soon, Davion […]"
    },
    {
        "title": "24[M4F] Anywhere- im in OH- Taking a break from studying looking for someone to talk to",
        "content": "Hello all! How are you doing? A little bit about me I am a 24 year old male, I am a third year medical student with a big test coming up, so Im taking a break from studying tonight, and looking for someone to talk to. I am a big fan of the NFL and college football, I enjoy playing soccer and volleyball. I love reading, my favorite genre by far is fantasy, and my favorite books are, The Name of the Wind, The Mistborn trilogy, and The Way of Kings, I like many others but those are some of my fa..."
    },
    {
        "title": "What competitive and cheap or free video games should I ...",
        "content": "Answer (1 of 5): Unfortunately, those games you mentioned (especially Dota 2) are known for their bad effect on the players, some Dota 2 players reported that they felt outcasted, Anxiety, heavily addicted, and even depression. The competitiveness in those games is too high that gamers felt they ..."
    },
    {
        "title": "21/m/Philippines Looking for a virtual buddy!",
        "content": "Lets talk about anything under the sun! I'm into sports (basketball especially), dota 2, corny romcoms and stuff."
    },
    {
        "title": "Benjamin Koh - Kuala Lumpur, Wilayah Persekutuan Kuala ...",
        "content": "Love gaming especially Dota 2. Refer to my resume for my Dota 2's achievements. Pengalaman Intern ASTI Telford Mac 2020 - Jun 2020 4 bulan. Melaka, Malacca, Malaysia Internee Intern KBK Management & Services Mac 2017 - Jun 2017 4 bulan. Melaka, Malacca, Malaysia Internee ..."
    },
    {
        "title": "24 [M4F] Anywhere/OH - Gf just broke up with me, looking for someone to talk to.",
        "content": "Hello all! How are you doing? A little bit about me I am a 24 year old male, I am a third year medical student. I am a big fan of the NFL and college football, I enjoy playing soccer and volleyball. I love reading, my favorite genre by far is fantasy, and my favorite books are, The Name of the Wind, The Mistborn trilogy, and The Way of Kings, I like many others but those are some of my favorites. I also love video games! both playing and watching them, especially Dota 2, but i was also really ..."
    },
    {
        "title": "Problem with the EVGA GTX 980 ACX2.0. Low FPS in almost ...",
        "content": "Hello everyone, I have problems with the EVGA GTX 980 ACX 2.0Buy the card recently, it is d use but it is in perfect condition (at least apparently) and almost all games give me low FPS even lower than other cards I have had lower category. I've been looking for solutions on the internet for a while..."
    },
    {
        "title": "23 [M4F] Anywhere (Im in OH) - Taking a break from studying, look to chat",
        "content": "Hello all! How are you doing? A little bit about me I am a 23 year old male, I am a second year medical student with 2 ridiculous tests on Monday, so Im taking a break from studying tonight, and looking for someone to talk to. I am a big fan of the NFL and college football, I enjoy playing soccer and volleyball. I love reading, my favorite genre by far is fantasy, and my favorite books are, The Name of the Wind, The Mistborn trilogy, and The Way of Kings, I like many others but those are some o..."
    },
    {
        "title": "BGS Dota 2 (@brick_dota2) | Twitter",
        "content": "The latest tweets from @brick_dota2"
    },
    {
        "title": "Check out my latest vid about Oracle mid in Dota 2! It's super fun in low brackets especially. Drop a like if you like it :) Let me know, and I'll check out your channel too!",
        "content": ""
    },
    {
        "title": "How to Taunt in Dota 2 - DigiParadise",
        "content": "How to Taunt in Dota 2. On Jan 02, 2021 6:41 am, by Ken. Trashtalking or Taunting has been a part of the gaming community especially Dota 2 for such a long time. Some might say that it ruins the game but you can't deny that it makes the matches more exciting and exhilarating. It can either boost up your teams morale or even intimidate your ..."
    },
    {
        "title": "Dota 2 should have it's own mobile app (especially for major events)",
        "content": "Love watching dota2 and participating in the events surrounding it but not having a mobile application that has features tied to your account really brings the experience down for people who can't watch dota2 for hours We should have an application with the following features: -Look at your compedium level/quests -Manage your fantasy player cards and picks -Be able to place predictions for the event and for the games -Be able to see current games, past games and view results of an event. -..."
    },
    {
        "title": "Here's Why A Newly Formed Pro Dota 2 Team In China Has ...",
        "content": "Dota 2. Team In China Has People Excited. Newbee is a powerhouse when it comes to Chinese esports, especially Dota 2. The organization already has a youth feeder team to pull from and was looking ..."
    },
    {
        "title": "Infographic - Season 2016-2017 in Dota 2, especially for Kiev major.",
        "content": ""
    },
    {
        "title": "Dota 2 quotes | dota 2, beautiful images, dota 2 wallpaper",
        "content": "Jan 11, 2018 - A collection of beautiful images of dota 2, especially dota 2 quotes. I love dota 2. See more ideas about dota 2, beautiful images, dota 2 wallpaper."
    },
    {
        "title": "colleagues - How to handle \"Steam\" friend at job? - The ...",
        "content": "(Especially Dota 2) And then the next day he is asking me hey I saw you made 2 matches yesterday and did not play the day before yesterday...I think that he feels that he is betrayed or some other feeling I have no idea... I also think he has some issues... I don't want to expose my playing hours or the games I play to him so I thought about ..."
    },
    {
        "title": "The International 6 Match Preview - Fnatic vs Team Liquid",
        "content": "Since its inception, the professional Dota scene has had a fairly rigid hierarchy. China reigns supreme, Europe hold steady at a close second and then SEA trailing far behind at a distant third. Though there have been exceptions, the rule has generally held true for all of Dota, and especially Dota 2."
    },
    {
        "title": "Esports Daily Picks » Dota 2 » Unibet Reports China ...",
        "content": "Dota 2 Dominates. While many eSports are providing big payouts to many competitors, Dota 2 has been by far the most prominent eSport in terms of payouts. It is estimated that Dota 2 has paid out about $90 million at its eSports events over the years. This is thanks in part to how many of the payouts for the game are crowd-funded."
    },
    {
        "title": "Jeremy Molina - Customer Operations Engineer - Cloudera ...",
        "content": "I also like to spend time with my family and friends, and video games, especially Dota 2. Not a big fan of soccer but speak about any other sport and I know at least something. More important than anything else are my values, primordially the punctuality, respect, tolerance."
    },
    {
        "title": "Cultural Anthropology/Print version",
        "content": ""
    },
    {
        "title": "Dota: Dragon's Blood Season 2 Release Date & Story Details",
        "content": "25.03.2021 · Dota: Dragon's Blood is based on the 2013 video game Dota 2 and though it hasn't been well-received by critics thus far, it could still become a streaming sensation. Dota: Dragon's Blood season 1 focuses on the conflict between the elves of Coedwig and the Dark Moon Order of Nightsilver Woods, and why a demon named Terrorblade hopes to create a new world in his …"
    },
    {
        "title": "Dota 2 for Dummies: A no-bullshit method to start playing ...",
        "content": "Jul 11, 2014 — I started playing Dota 2 specifically because it was the only thing anyone I knew was playing with any regularity, and I wanted to play ..."
    },
    {
        "title": "Mirad Grammar/print version",
        "content": ""
    },
    {
        "title": "Dota 2 System Requirements - Can I Run It? - …",
        "content": "Dota 2 FPS Fix. Even while using a high end PC, you could still experience minor lag or FPS issues while playing Dota 2. To open up an FPS counter inside of Dota 2, simply open Dashboard > Gear > Options > To Advanced Options, and then enable the “Display Network Information” this will show your FPS and your ping."
    },
    {
        "title": "[KIT] Why you should play Dota 2? | WACA",
        "content": "Mar 12, 2021 — To begin with, Dota 2 is very fun especially if you play with your friends. This divide each team into 5 different roles."
    },
    {
        "title": "Mirad Grammar/Mirad-English Dictionary A-M",
        "content": ""
    },
    {
        "title": "Dota 2: Which Are The Best Items For Tinker?",
        "content": "22.11.2021 · Tinker is one of the best mid-lane heroes in Dota 2, especially if he is picked in a game where he doesn’t have any counters. Despite being one of the hardest heroes to master, Tinker can make a real difference during team fights. He is notorious for being among the highest damage dealers in the game, even surpassing Zeus in some instances."
    },
    {
        "title": "Dota 2: Which Are The Best Items For Batrider? - ESTNN",
        "content": "Nov 25, 2021 — Batrider is a hero that we don't see that often, especially in pubs. But he's probably one of the most interesting heroes in Dota 2, ..."
    },
    {
        "title": "Mirad Grammar/print version of dictionary",
        "content": ""
    },
    {
        "title": "Universe - Liquipedia Dota 2 Wiki",
        "content": "03.07.2021 · Saahil \"Universe\" Arora is an American former professional Dota 2 player from Madison, Wisconsin. He last played for Ninjas in Pyjamas. He retired from competitive Dota on April 23rd, 2020."
    },
    {
        "title": "LoL is winning the MOBA battle thanks to its diverse roster",
        "content": "Sep 6, 2021 — Why I'm not going back to Dota 2 any time soon. ... Super Street Fighter 4's 30-strong roster may not be particularly numerous by modern ..."
    },
    {
        "title": "T1 re-signs its entire Dota 2 roster - Dot Esports",
        "content": "30.10.2021 · T1 re-signs its entire Dota 2 roster. ... Now, T1 is easily the SEA favorite heading into the next DPC season, especially considering Fnatic, TNC Predator, ..."
    },
    {
        "title": "Game Play Differences by Expertise Level in Dota 2, A ...",
        "content": "by L Castaneda · 2016 · Cited by 14 — The introduction of computerized games, both chess and others, enables us to more specifically capture some of the elements Ericsson suggests and thereby better ..."
    },
    {
        "title": "Dota 2 Hacks: Kill Stealer, Zoom Adjust Cheat & More ...",
        "content": "Our Dota 2 Hacks: Ability Alerts and Cooldown ESP. In games like Dota 2, knowledge about the enemy is one of the most valuable things possible. The more you know about the enemy and the little they know about you; the more chances you have of winning games. Our Dota 2 ability alerts look to help players in this exact department."
    },
    {
        "title": "Do I need to stop playing computer games, particularly DOTA 2?",
        "content": "I loved to play DotA, I still watch some tournaments (my cousin is a professional esports DotA2 player). However I don't play it anymore. Here is why: DotA2 ...6 answers · 17 votes: Being an avid (ex) gamer, I can’t believe that I am writing this answer, but I will ..."
    },
    {
        "title": "Dota 2 Counter Pick - All Heroes - Zathong",
        "content": "An individual who loves playing games, especially Auto Chess games (Fortnite, Carano Chess, Teamfight Tactics, Arena of Valor, Auto Chess Mobile) and Moba Game build guide (Dota 2 builds, Vainglory Builds, Onmyoji Arena Build, Heroes of the Storm builds, Heroes Of Newerth Build, Paladins Builds, Brawl Stars build, Heroes Evolved Build, Battlerite Build, Wild Rift Build)."
    },
    {
        "title": "Russophobia in DotA 2 : a critical discursive analysis of online ...",
        "content": "by A Wagener · 2018 · Cited by 2 — Online gaming has been a fascinating field of study for the last ten years, especially in the field of socialization (Kolo & Baur, 2004) or even language ..."
    },
    {
        "title": "The best Dota 2 heroes to play in ranked in 2021 | The Loadout",
        "content": "24.11.2021 · Want to know the best Dota 2 heroes you should be picking in ranked mode? The wilds of Dota 2’s ranked mode is a tough place to spend your time, and nothing feels worse than sinking hours of your valuable time only to emerge with less MMR than you started off with.. There are several factors that contribute to the result of each ranked game – one of the most crucial …"
    },
    {
        "title": "OG Esports and Wintermute team up ahead of TI10.",
        "content": "Wintermute's employees share our passion for competitive gaming, especially Dota 2, and often take part in esports tournaments during their free time."
    },
    {
        "title": "Earthshaker - Dota 2 Wiki",
        "content": "Raigor Stonehoof, the Earthshaker, is a melee strength hero with several area of effect (AoE) disables, commonly played as a ganker or initiator. Good usage of his spells allow him to damage and chainstun multiple enemies at once, making him very disruptive in skirmishes and teamfights. His Fissure is a versatile long-ranged spell that affects enemies in a line, used to stun, inflict …"
    },
    {
        "title": "Drow Ranger/Counters - Dota 2 Wiki",
        "content": "Time Walk could be used to close the distance within Drow Ranger, hindering her Marksmanship bonus. Faceless Void could lock down Drow Ranger with Chronosphere before she has the chance to retaliate due to her low health pool. Laser applies a blind debuff, making Drow Ranger miss her high damage attacks. Heat-Seeking Missile lets Tinker out-range Drow Ranger and …"
    },
    {
        "title": "Dota 2 Patch 7.30 goes live: massive changes ... - ClutchPoints",
        "content": "Aug 17, 2021 — A new patch has been expected, especially since the Dota 2 Nemestice Battle Pass expired earlier today. Fans had various expectations on the ..."
    },
    {
        "title": "Dota 2 Roster News: SumaiL and Saksa Leave OG | Player.One",
        "content": "Two members of Dota 2 team OG made the decision to leave and it's not ... look for other opportunities, especially for the upcoming season.Nov 9, 2021 · Uploaded by hOlyhexOr"
    },
    {
        "title": "ESPECIALLY DOTA 2 IS WHERE YOU FAIL BADLY OR ...",
        "content": "PATIENCE IS KEY TO AWESOMENESS ----------------------------------------- If You like the stream consider LIKE, SHARE, FOLLOW YOU CAN ALSO TIP ME!..."
    },
    {
        "title": "Tier 1 Tournaments - Liquipedia Dota 2 Wiki",
        "content": "Jun 14, 2021 — ... franchises and are considered especially prestigious amongst the community. Highlighted tournaments are special Dota Major Championships ..."
    },
    {
        "title": "A Further Test of the Impact of Online Gaming on ...",
        "content": "by C Goh · 2019 · Cited by 22 — The research study was advertised to players of DOTA 2, both via game forums ... Specifically, five motivators were tested as mediators; ..."
    },
    {
        "title": "Dota 2: Dealing with Monkey King - Weplay Esports",
        "content": "Feb 2, 2020 — MK can be one of the hardest heroes to lane against, especially during early game. Introduction. There are many annoying Dota 2 heroes that can ..."
    },
    {
        "title": "OG: The Road to The International 10 | SteelSeries",
        "content": "Oct 10, 2021 — It's been a long road to TI 10, especially after OG's Jesse \"JerAX\" Vainikka retired from professional Dota 2 play in 2020, followed by the ..."
    },
    {
        "title": "Dota 2 is getting a huge update to help new players | PC Gamer",
        "content": "It's a truth universally acknowledged that Dota 2's tutorial sucks, ... the wizard will pop up if you try to 1v1 an especially difficult ...Mar 24, 2021"
    },
    {
        "title": "Dota 2 Esports Extension - Reinventing the MOBA Viewing ...",
        "content": "Oct 7, 2020 — MOBAs are especially guilty of this – Dota 2 is a game with 119 heroes (at the time of this writing) each of whom have 4 or more abilities ..."
    },
    {
        "title": "Valve drops Dota 2 patch 7.07b to level out the playing field",
        "content": "Nov 6, 2017 — Change never stops in Dota 2, especially not with a patch as big as 7.07, which was released Tuesday, six days ago."
    },
    {
        "title": "(PDF) Toxic Behavior in Dota 2 - a Survey Study - ResearchGate",
        "content": "Mar 7, 2020 — Future studies, especially ones focusing on the correlations of competition, computer-mediated settings and aggression could perhaps yield very ..."
    },
    {
        "title": "GOSU Voice Assistant for Dota 2",
        "content": "Try the World`s first Dota 2 voice assistant to master the game effortlessly. ... I love how the AI tells me each ability and what they do, especially if I ..."
    },
    {
        "title": "Updates to the Alliance Dota 2 roster",
        "content": "Oct 24, 2021 — “Especially a friend as special and important to Alliance's history as the son of Magnus himself, S4. We all wanted more from this TI but that ..."
    },
    {
        "title": "Reddit Dota 2 on Twitter: \"Toxic @DOTA2 should not be ...",
        "content": "Sep 15, 2021 — should not be normalised especially if youre a streamer - /u/Mengslayer0 #dota2 · reddit.com. Toxic dota should not be normalised especially ..."
    },
    {
        "title": "'Dota 2' Update: Valve to Assist New Players, Brings New ...",
        "content": "'Dota 2' is looking at a major change, especially as its Netflix series is soon coming for a global release!Mar 25, 2021 · Uploaded by Netflix"
    },
    {
        "title": "DreamHack reverts in-game coach ruling for DPC 2021 ...",
        "content": "May 12, 2021 — Competitive Dota 2 has routinely made use of coaches, especially for organizations capable of affording them, though they're mainly used for ..."
    },
    {
        "title": "THE ACQUISITION OF ENGLISH THROUGH PLAYING DOTA ...",
        "content": "by R Nurafidha · 2018 · Cited by 1 — Playing DoTA 2 also affects players' emotion, especially related with their language acquisition. In doing the communication, players' intention is to set."
    },
    {
        "title": "The Register Used In Dota 2 Play-By-Play Commentary Of ...",
        "content": "by DP Ningrum · 2020 — that were competed in SEA Games 2019 is Dota 2 (Fox Sports 2019). According to Schubert et al. ... However, in the field of e-Sport, especially Dota 2, the."
    },
    {
        "title": "Dota 2 News » All the latest insights from behind the scenes.",
        "content": "Certainly not the most thrilling region to watch, especially in the Dota 2 Esports side of entertainment. But with a fair variety of notable teams, the…"
    },
    {
        "title": "'Dota 2' is the first title running on Valve's new game engine",
        "content": "Sep 10, 2015 — Dota 2. Specifically, Dota 2 Reborn. As Eurogamer points out, the multiplayer online battle arena (MOBA) has been running in Source 2 in beta ..."
    }
]