[
    {
        "title": "dos",
        "content": ""
    },
    {
        "title": "Open individualism",
        "content": ""
    },
    {
        "title": "Lentis/Electronic Sports (eSports)",
        "content": ""
    },
    {
        "title": "Birds of North and Middle America, part V/Genus 10. Myrmopagis Ridgway",
        "content": ""
    },
    {
        "title": "Dota 2 on Steam",
        "content": "With regular updates that ensure a constant evolution of gameplay, features, and heroes, Dota 2 has taken on a life of its own.Publisher: ValveReleased: Jul 9, 2013"
    },
    {
        "title": "Dota 2 - Wikipedia",
        "content": "Dota 2 is a multiplayer online battle arena (MOBA) video game developed and published by Valve.The game is a sequel to Defense of the Ancients (DotA), which was a community-created mod for Blizzard Entertainment's Warcraft III: Reign of Chaos. Dota 2 is played in matches between two teams of five players, with each team occupying and defending their own separate base on the map."
    },
    {
        "title": "Tournament explains why women aren't allowed to play, including Dota 2 [x-post /r/hearthstone]",
        "content": "Tournament explains why women aren't allowed to play, including Dota 2 [x-post /r/hearthstone]"
    },
    {
        "title": "Mirad Grammar/Vocabulary Formation",
        "content": ""
    },
    {
        "title": "History of Woman Suffrage/Volume 3/Chapter 43",
        "content": ""
    },
    {
        "title": "Bitcasino and Evil Geniuses form the first crypto-based digital gaming partnership, Bitcasino will be showcased across a number of EG facets including Dota 2, Counter-Strike, FGC, Starcraft II, Rainbow Six, League of Legends, and many others. USING CRYPTO!"
    },
    {
        "title": "Bitcasino and Evil Geniuses form the first crypto-based digital gaming partnership, Bitcasino will be showcased across a number of EG facets including Dota 2, Counter-Strike, FGC, Starcraft II, Rainbow Six, League of Legends, and many others. USING CRYPTO! (x-post from /r/Cryptocurrency)"
    },
    {
        "title": "Dota 2 - Wikipedia",
        "content": "Dota 2 is played in matches between two teams of five players, with each team occupying and defending their own separate base on the map. Each of the ten ...Release: Windows; July 9, 2013; Linux‎, ‎OS X‎; ...‎Platform(s): Microsoft Windows; ‎Linux‎; ‎OS X‎Genre(s): MOBAEngine: Source 2‎Gameplay · ‎Development · ‎Esports · ‎Reception"
    },
    {
        "title": "Asian Games 2022 Will Feature 8 Esports Titles Including ...",
        "content": "News Defense Of The Ancients II FIFA League of Legends PLAYER'S UNKNOWN BATTLEGROUNDS. Asian Games 2022 Will Feature 8 Esports Titles Including Dota 2, Hearthstone and Street Fighter. By Sonu Banerjee-September 12, 2021. Facebook. WhatsApp. ReddIt. Twitter. Linkedin. Telegram. Gamers across the world, rejoice! What many avid esports enthusiasts ..."
    },
    {
        "title": "History of video games/Print version/Specialty topics",
        "content": ""
    },
    {
        "title": "History of Woman Suffrage/Volume 1/Chapter 6",
        "content": ""
    },
    {
        "title": "Dota 2 - Reborn",
        "content": "Today we are announcing the Dota 2 Reborn beta, which brings with it a new interface, new engine, and Custom Games. Everything in the dashboard has been ..."
    },
    {
        "title": "Bitcasino and Evil Geniuses form the first crypto-based digital gaming partnership, Bitcasino will be showcased across a number of EG facets including Dota 2, Counter-Strike, FGC, Starcraft II, Rainbow Six, League of Legends, and many others. USING CRYPTO! (x-post from /r/Cryptocurrency)",
        "content": ""
    },
    {
        "title": "Valve wants to integrate Blender into Steam games modding, including Dota 2",
        "content": "In short, you could download Blender from Steam, create a sword model in it, click a button and have it published in the Steam Workshop for Dota 2 or other game. These are just ideas they listed. 61. level 2. bawed."
    },
    {
        "title": "Dota 2 ranks: ranking system explained, MMR, and more ...",
        "content": "If you're a new player to Dota 2, don't worry. It can be a pretty daunting task to take to the ranked queue, so to help you out we've put together some answers to the most frequently asked questions about the Dota 2 ranking system, including the different tiers, how Dota 2 MMR is calculated, and more, right here."
    },
    {
        "title": "Cultural Anthropology/Play, Sport and Arts",
        "content": ""
    },
    {
        "title": "A New Approach to Helping Players Learn Dota",
        "content": "Mar 24, 2021 — UPDATED DOTA WEBSITE The Dota 2 website is happy to announce that it's finally leaving beta! With today's update, we've begun our revamp of the ..."
    },
    {
        "title": "Bitcasino and Evil Geniuses form the first crypto-based digital gaming partnership, Bitcasino will be showcased across a number of EG facets including Dota 2, Counter-Strike, FGC, Starcraft II, Rainbow Six, League of Legends, and many others. USING CRYPTO!",
        "content": ""
    },
    {
        "title": "Rivalry - The Best Dota 2 Betting Site (100% Deposit Bonus)",
        "content": "Full of Dota 2 Matches: We offer a ton of different types of dota 2 bets including live betting. You can bet on matches before they start or toss a few bucks on an outcome right in the middle of the match! Our regulatory requirements mandate that we only offer dota 2 betting on matches with integrity. So while you may not be able to bet on two ..."
    },
    {
        "title": "Mirad Grammar/print version",
        "content": ""
    },
    {
        "title": "Dota Plus",
        "content": "Each level grants Reward Shards, and each tier grants new Hero Chat Wheel responses. Just play a single game with a hero to unlock the first of your progression ..."
    },
    {
        "title": "PSA: You can get hacked if you play a Source game (including Dota 2) because of an RCE exploit",
        "content": "1. [https://www.dexerto.com/csgo/csgo-exploit-allows-hackers-steal-passwords-valve-no-fix-1551056/?amp](https://www.dexerto.com/csgo/csgo-exploit-allows-hackers-steal-passwords-valve-no-fix-1551056/?amp) 2. [https://www.reddit.com/r/GlobalOffensive/comments/moteog/csgo\\_exploit\\_allows\\_hackers\\_to\\_steal\\_passwords/](https://www.reddit.com/r/GlobalOffensive/comments/moteog/csgo_exploit_allows_hackers_to_steal_passwords/) (The CSGO thread) 3. [https://www.reddit.com/r/GlobalOffensive/comments/mo..."
    },
    {
        "title": "2022 Asian Games to Feature Eight Esports Titles Including ...",
        "content": "Dota 2 will be a medal sport at the 19th Asian Games in China. The announcement of these game titles was made on 8th September 2022 which was the first day of the Chefs de Mission Conference for the 19th Asian Games. \"We hope that this announcement allows all participating teams ample time to prepare and equip themselves ahead of the qualifying stages,\" said Mr. Husain Al-Musallam, the ..."
    },
    {
        "title": "The International Approaches - Dota 2",
        "content": "Sep 16, 2021 — To help everyone keep pace with the upcoming action, today's update includes free access for all Dota players to The International 2021 ..."
    },
    {
        "title": "Dota 2 News: OG roster finalized, including Taiga and ...",
        "content": "Dota 2 21/11/2021, 16:25 Cristy \"Pandoradota2\" Ramadani With a complete overhaul to the roster, OG's new lineup will be led by Mikhail \"Misha\" Agatov and includes Tommy 'Taiga' Le. One by one the players from the TI10 lineup dropped from OG 's roster."
    },
    {
        "title": "Hero Builds - Dota 2",
        "content": "Even the greatest warrior needs a mentor—let your fellow players help you learn the finer points of strategy with Guides and Hero Builds."
    },
    {
        "title": "Panathinaikos (famous sports club in Greece) announces new eSports department (including Dota 2)",
        "content": ""
    },
    {
        "title": "Dota 2 Addiction | Does Your Child Have a Problem?",
        "content": "The DSM-5 contains a section to help people and doctors recognize the warning signs of problematic video games, including Dota 2, as well as a list of symptoms and treatment options for Dota 2 addiction. Dota 2 addiction can manifest in different ways for different people, based on their preference of game or other underlying or co-occurring ..."
    },
    {
        "title": "How to Play Dota 2: from Beginner to a Pro Player - GOSU.AI",
        "content": "Aug 9, 2021 — With the advent of PC gaming countless game designers are pushing the envelope by creating new genres for the masses, and Dota 2 is no ..."
    },
    {
        "title": "Many games including Dota 2, Payday, Supreme Commander 2...",
        "content": "**Contest/Giveaway over. Thanks to all who participated. PM's being sent shortly.** List is below. Let me know which one you'd like and I'll pick the winners at absolute random either 24 or 48 hours from now depending on when I get back from work tomorrow. Just Cause (1) Supreme Commander 2 The Last Remanent Quantum Conundrum Hitman Blood Money Payday: The Heist Dota 2 Invite"
    },
    {
        "title": "Asian Games 2022 To Feature Eight Esports Events Including ...",
        "content": "Arena of Valor Asian Games Version. Dota 2. Dream Three Kingdoms 2. EA SPORTS FIFA branded soccer games. HearthStone. League of Legends. PUBG Mobile Asian Games Version. Street Fighter V. This is the first time esports has been included as an official medal event at the Asian Games, which is scheduled to be held from September 10 to 25, 2022."
    },
    {
        "title": "Dota2 Apps Guide you with gameplay tips in game - Overwolf",
        "content": "Overwolf apps for DOTA2 help you play smarter with in-game stats, item guides, build suggestions and dota draft recommendations."
    },
    {
        "title": "Match-Fixing in Dota 2: What Players Can Do to Protect ...",
        "content": "Dota 2 witnesses the betting industry being heavily ingrained in its community. Almost all the teams in Dota 2 are affiliated with betting companies in one way or the other. Even the top ones, including TI8 and TI9 champions, OG, (partnered with FUN88), Team Secret, (partnered with Jingjibao), and PSG.LGD (partnered with Betway) are affiliated ..."
    },
    {
        "title": "Startale announces StartaleTV - including Dota 2",
        "content": ""
    },
    {
        "title": "OPTF2 - Dota 2 Wiki",
        "content": "OPTF2 is a community web-based backpack viewer built upon Steam's WebAPI platform and written in the Python programming language. While starting out as a backpack viewer for Team Fortress 2, it later incorporated the ability to see the inventories of multiple games, including Dota 2. The front page features a message of the day and a random item from any one of the games supported by OPTF2, as ..."
    },
    {
        "title": "GLHF Magazine Issue 7 - Now including Dota 2 content!",
        "content": ""
    },
    {
        "title": "ESPN hiring a General Editor for Esports related work, including Dota 2",
        "content": ""
    },
    {
        "title": "2022 Hangzhou Asian Games confirms eight esports titles ...",
        "content": "2022 Hangzhou Asian Games confirms eight esports titles, including Dota 2 and League of Legends By Hongyu Chen 9.8.2021 The Olympic Council of Asia (OCA) revealed Wednesday that the 2022 Hangzhou Asian Games from Sept. 10-25 will feature eight esports medal titles and two demonstration titles."
    },
    {
        "title": "Updates for Steamworks games (including Dota 2) will soon be able to be featured on the Steam store front page",
        "content": "Via [the Steamworks Development group](http://steamcommunity.com/gid/103582791433666425/announcements/detail/1498873168399058057) ([Pastebin mirror, courtesy of Top Men^TM](http://pastebin.com/AwAh7pVg) in case you're not one of the lucky few in the group): >Back in October we added a beta feature called \"Visibility Rounds.\" This feature previously let you opt in to making your product appear on the front page of Steam store for a certain number of views. **Starting tomorrow afternoon, we wi..."
    },
    {
        "title": "The Benefits of Crypto Betting in Esports | CoinCodex",
        "content": "Many sports booking platforms are starting to offer crypto gambling options for different games including Dota 2. This provides existing users with other means of payment as well as entice a new generation of gamblers into the industry."
    },
    {
        "title": "[H] Lots of Games (including Dota 2) [W] Games and/or Team Fortress 2 Stuff",
        "content": "**Have these:** * Alpha Protocol™ * Cogs * Dota 2 Tradable ($40 or TF2 earbuds) * FEAR Complete Pack (NA) * Fallout: New Vegas * FlatOut: Ultimate Carnage * Gemini Rue * Guest Pass: Killing Floor x2 * Hacker Evolution Duality * Disciples II Gold * Half-Life 2: Episode One * Jagged Alliance 2 * The Orange Box x2 * The Witcher: Enhanced Edition * Sequence * SpaceChem * The Ship * Trine ** Here's my inventory (games in my inventory and not listed above are not for trade) :** http://steamcommun..."
    },
    {
        "title": "Esports World Championship 2021 finals to begin from ...",
        "content": "The Championship will feature four official games titles including DOTA 2, CS: GO, Tekken 7 and eFootball™ 2022 and one promoted title, Audition. - SPECIAL ARRANGEMENT . Team Sportstar 11 November, 2021 18:24 IST The 13th IESF Esports World Championship 2021 is set to begin in Eilat, Israel on November 14 and will go on till November 20. ..."
    },
    {
        "title": "[H] Games including Dota 2, Payday the Heist [W] Offers",
        "content": "I have: Just Cause 1 Supreme Commander 2 The Last Remanent Quantum Conundrum Hitman Blood Money Payday: The Heist Dota 2 Invite I'm open to trades and would love to bundle these together if you'd like. I do play TF2 so if you have something to trade from there I would be open to that but I would prefer games. Thanks."
    },
    {
        "title": "Top Ways to Make Money Playing Dota 2: Get Paid to Play ...",
        "content": "The most common Dota 2 bets are on match outcomes. However, there are also more interesting bets that can give high payouts such as which team will be first to 10 kills, or who will destroy the most towers. The majority of online sportsbooks offer eSports wagering including Dota 2 tournaments."
    },
    {
        "title": "Eclypsia officially disbands all gaming teams (including Dota 2).",
        "content": ""
    },
    {
        "title": "Team Liquid - Liquipedia Dota 2 Wiki",
        "content": "Team Liquid is a professional team, founded in the Netherlands in 2000. Originally a Brood War clan, the team switched to StarCraft II during the SC2 Beta in 2010, and became one of the most successful western teams. On December 6, 2012, it was announced that the team had formed a Dota 2 division. Team Liquid is also strongly associated with its website, TL.net. Launched on May 1, 2001, it has ..."
    },
    {
        "title": "Giving away games worth $70 (including Dota 2) - Check it out!",
        "content": "I recently got some cash over and thought I'd join the community and give away some of these precious games through my Twitch stream! Currently playing Torchlight & Bastion, going for 100% clear! Link to stream: http://www.twitch.tv/nikentic I plan to stream each weekday 8pm CEST - 2am CEST. These coming days I will give away Bastion, Super Meat Boy, The Binding of Isaac and a lot of other games! Be sure to be there and join the raffle!"
    },
    {
        "title": "Dota 2 - Hero Builds",
        "content": "Steam Guides are a feature of the Steam Community that let players share in-depth knowledge about all sorts of games on Steam, including Dota 2. Hero Builds are unique to Dota 2 and used during a game to help instruct you on how to best play your hero. Hero Builds can be linked to from a Guide."
    },
    {
        "title": "[#640|+177|119] A hacker group is DDoS'n multiple different game servers, including Dota 2. It is not Valve's fault. [/r/DotA2]",
        "content": ""
    },
    {
        "title": "One final push of various Steam games giveaway including DotA 2 beta key (ends 1PM GMT 28/12/11)",
        "content": "http://www.reddit.com/r/mylittlepony/comments/nq2po/dota_2_beta_key_giveaway"
    },
    {
        "title": "CR4ZY Parts Ways with All Rosters, including Dota 2 and CS ...",
        "content": "CR4ZY Parts Ways with All Rosters, including Dota 2 and CS:GO. The Croatian multigaming organization CR4ZY has announced that all their rosters, including CS:GO, Dota 2, Rainbow Six: Siege and League of Legends teams, have been let go - the players' contracts have been terminated. The management will spent the rest of the year preparing a strategy for the next year."
    },
    {
        "title": "[H] Gotham City imposters, Trine 2 [W] tf2 items/offers including dota 2",
        "content": "Title says it all"
    },
    {
        "title": "One Month Free Gaming VPN for PUBG, Apex Legends, iRacing ...",
        "content": "A couple of years ago I built a niche Gaming VPN for PC PUBG players in Australia and New Zealand to get the best pings possible to overseas regions. I have recently built out the service to offer other PC games including DOTA 2, iRacing and Apex Legends."
    },
    {
        "title": "Artifact will include Dota 2's Damage Types",
        "content": "I re-watched GameSpot's gameplay footage and noticed something unique that I haven't seen mentioned anywhere else. [Thunder God's Wrath has a piercing attack damage type](https://imgur.com/m3XtErX) In Dota 2 piercing damage deals amplified damage to certain units and less damage to others. How this will translate into Artifact I'm not sure. There are many different types of attack damage in Dota 2 besides this as well. * Normal * Pierce * Siege * Chaos * Hero * Magical * HP Removal *..."
    },
    {
        "title": "Dota 2 Betting Online With the Famous Bookie - Parimatch India",
        "content": "It allows betting in Indian rupees on a wide range of e-sports, including Dota 2. If you wish to find out how to bet online in India on this exciting e-sports game, whether bonuses and promotions can be used to bet on Dota 2, and other interesting information, then you just need to continue reading this article. Parimatch Dota 2 Bonus"
    },
    {
        "title": "The Game Awards 2018 nominations includes Dota 2 in Esport category.",
        "content": "Dear fellow players of Dota 2, Assuming that most of us still didn't inform that Dota 2 has been nominated in Esport category for the game award 2018. Other categories such as esport team includes OG, our grand champion, esport event includes the TI8 and esport moment includes OG vs LGD. GLHF"
    },
    {
        "title": "BOOM Esports unveils Rivalry as lead sponsor - Esports Insider",
        "content": "The organisation currently fields rosters in six titles, including Dota 2 and VALORANT. Devesh Kabdwal, Chief Revenue Officer at BOOM Esports , spoke on the deal in a release: \"I believe the two brands brought together Boom and Rivalry , have great potential to generate high-quality, entertaining content and overall add great value to the ..."
    },
    {
        "title": "Fragbite Masters to include Dota 2 in the upcoming season!",
        "content": ""
    },
    {
        "title": "The Ultimate Dota 2 Guide Part 4: How To Make A Living ...",
        "content": "Twitch is the biggest streaming platform for gaming, including Dota 2. You can also try streaming on YouTube, but it has a much, much smaller viewer base there compared to Twitch. However, if you want to make content on YouTube, there are a number of ways you can go."
    },
    {
        "title": "Is it okay to include Dota 2 as hobbies/interest in resume?",
        "content": "I had included Dota 2 as a Hobby in my resume. But, during the last interview, the interviewer said he wouldn't encourage someone who plays games, which apparently spoils the working atmosphere (wtf?). I'm unsure whether to retain it on my resume or delete it. As e-sports is growing at rapid rate, I thought it would be unique to include it. Anybody who have it included in their resume, please weigh in your suggestions. Better yet, what does the community think of this?"
    },
    {
        "title": "Nevada regulators appoint members to Esports Technical ...",
        "content": "In 2020, Nevada regulators approved a record 12 esports events and leagues for wagering across a variety of game titles, including Dota 2, iRacing, League of Legends, Overwatch, and Call of Duty. Licensed operators could accept bets on three wager types: head to head, match winner, and overall winner."
    },
    {
        "title": "WECG 2014 Titles Announced, Includes Dota 2 - 2P.com",
        "content": ""
    },
    {
        "title": "Geek Review: Lenovo Yoga Slim 7i Pro",
        "content": "While it lacks the capabilities to run games at the highest settings, it is able to run games including DOTA 2 and Ruined King: A League of Legends Story to a more than satisfactory degree, with ..."
    },
    {
        "title": "China Top 2017 - Liquipedia Dota 2 Wiki",
        "content": "China Top 2017 is a comprehensive E-sports event including Dota 2, Counter Strike:Global Offensive, Hearthstone and Arena of Valor. Format . Four teams, double elimination tournament; All matches are Bo3; Prize Pool"
    },
    {
        "title": "India to participate in 13th IESF Esports World ...",
        "content": "Competing for national pride and a prize pool of USD 50,000, the multi-game event will feature four official games titles including DOTA 2, Counter-Strike: Global Offensive, Tekken 7 and eFootball ..."
    },
    {
        "title": "Bitcasino Esports Review | Evil Geniuses' Home Esports ...",
        "content": "Reviews. November 1, 2021. Bitcasino is getting serious about esports, and its recent partnership with Evil Geniuses seems to suggest as much. As a result, Bitcasino is delivering on a range of experiences, including Dota 2, Counter-Strike: Global Offensive, and the Fighting Games Community (FGC). Through a dedicated new platform, esports fans ..."
    },
    {
        "title": "Full HD Dota 2 Match Replays & Game Highlights",
        "content": "Here at GG Esports, we'll make sure you get all of the details you're looking for, including Dota 2 match replays and much more, without any inconveniences you might find with other platforms. You can also check out statistics for a wide variety of other featured games, including League of Legends, PUBG, CS:GO, and more."
    },
    {
        "title": "Cultural Anthropology/Print version",
        "content": ""
    },
    {
        "title": "Memes - Dota 2 Wiki",
        "content": "Arguably the most popular player in China, Burning, according to Chinese players, has his own Dota dynasty, which includes multiple family and court members ..."
    },
    {
        "title": "Mirad/Print version",
        "content": ""
    },
    {
        "title": "Most Popular Movies and TV Shows tagged with keyword ...",
        "content": "Dota 2 (2013 Video Game). T | Action, Adventure, Fantasy. 8.3. Rate this."
    },
    {
        "title": "Tweets with replies by DOTA 2 (@DOTA2) / Twitter",
        "content": "Support your favorite Dota Pro Circuit (DPC) teams! Bronze Supporters Club bundles and Fantasy team card packs are now available for teams that have ...Oct 16, 2021"
    },
    {
        "title": "Dota 2's new hero Marci is now live with gameplay update 7.30e",
        "content": "Oct 28, 2021 — Valve is getting sneakier when dropping its new heroes for Dota 2, as Marci joins the game's roster less than two weeks after being revealed ..."
    },
    {
        "title": "Esports officially part of 2022 Asian Games, including League ...",
        "content": "Sep 8, 2021 — League of Legends: Both Dota 2 and League of Legends will be medal events at the next Asian Games, after the Olympic Committee of Asia (OCA) ..."
    },
    {
        "title": "What does dota 2 mean? - Definitions.net",
        "content": "Definition of dota 2 in the Definitions.net dictionary. ... Dota 2 is played in matches between two teams of five players, with each team occupying and ..."
    },
    {
        "title": "Talon Esports enters Dota 2 with star roster Including Gabbi, Fly",
        "content": "Nov 16, 2021 — Talon Esports has rocked the Southeast Asian Dota 2 scene with the announcement of its new lineup. The SEA team, which has previously had ..."
    },
    {
        "title": "Funko Pop! Games: Dota 2 - Sprit Breaker with Mace",
        "content": "From dota 2, sprit Breaker with mace, as a stylized pop vinyl from Funko! figure stands 3 3/4 inches and comes in a window display box. Rating: 4.8 · ‎174 reviews"
    },
    {
        "title": "Dota 2 down? Current outages and problems | Downdetector",
        "content": "Dota 2 outages reported in the last 24 hours · Most reported problems · Resolved issues · Stay up to date · Dota 2 comments Tips? Frustrations? Share them with ... Rating: 4 · ‎757 votes"
    },
    {
        "title": "BurNIng - Liquipedia Dota 2 Wiki",
        "content": "Oct 3, 2021 — Xu \"BurNIng\" Zhilei is a Chinese professional Dota 2 player who is ... After defeating Cloud9 2-0 in this match, including winning game two ...Team: Overview; Results; MatchesRoster: Monet; Ori; Xxs; BoBoKa; Siamese.C"
    },
    {
        "title": "Dota 2: Some Of The Teams Taking Part In The 2022 DPC",
        "content": "Instead of including two tours, we will have three. Each will include a Regional League and a Major. The latter will offer DPC points, which ...Nov 12, 2021 · Uploaded by hOlyhexOr"
    },
    {
        "title": "Play DOTA 2 & Earn Real Money - BUFF",
        "content": "DOTA 2 is incredibly popular taking, with being one of the most-played game on Steam. Hero Skills, Attributes, and Roles."
    },
    {
        "title": "Dota Underlords - Apps on Google Play",
        "content": "NEXT GENERATION AUTO-BATTLER In Dota Underlords, strategic decisions matter more than twitch reflexes. Underlords includes compelling singleplayer and ... Rating: 3.8 · ‎113,289 votes · ‎Free · ‎Android · ‎Game"
    },
    {
        "title": "GabeN's been testing the Steam Deck with Dota 2 | PCGamesN",
        "content": "Jul 29, 2021 — Now, we also hear from Valve head Gabe Newell that he's been giving the device a really good go with one of the studio's flagship games, Dota 2."
    },
    {
        "title": "The Ultimate Dota 2 Guide Part 4: How To Make A Living ...",
        "content": "Oct 29, 2021 — If you've ever wondered how to make a living playing Dota 2 then ... Like it is with every other fantasy universe, Dota 2 has a number of ..."
    },
    {
        "title": "Dota 2 - Home | Facebook",
        "content": "Dota 2. 4715004 likes · 1735 talking about this. Dota is a competitive game of ... of the next Dota Pro Circuit season kicks off next week and along with it ..."
    },
    {
        "title": "2022 Asian Games to Feature Eight Esports Titles Including ...",
        "content": "Sep 8, 2021 — The Olympic Council of Asia (OCA) has announced that eight esports games, including Dota 2 will be contested at the 19th Asian Games in ..."
    },
    {
        "title": "Swappable Announces Partnership with Esports T1's Dota 2 ...",
        "content": "Sep 24, 2021 — T1's Dota 2 team are auctioning their first-ever NFTs on Swappable, the NFT interface launched by TrustSwap."
    },
    {
        "title": "Dota 2 | eSafety Commissioner",
        "content": "Dota 2 is a fantasy-style game consisting of two teams of five players. ... Dota 2 is complex and attracts gamers of all levels, including elite players who ..."
    },
    {
        "title": "Dota 2 for Dummies: A no-bullshit method to start playing ...",
        "content": "Jul 11, 2014 — I started playing Dota 2 specifically because it was the only thing anyone I knew was playing with any regularity, and I wanted to play games ..."
    },
    {
        "title": "Dota 2 is dropping support for 32-bit systems | PC Gamer",
        "content": "Sep 18, 2021 — Dota 2 is dropping support for some older hardware in the coming months, including older 32-bit operating systems."
    },
    {
        "title": "New Dota 2 battle pass coming, likely with Drow Ranger arcana",
        "content": "Nov 24, 2021 — A Drow Ranger arcana may be in the works over at Valve. A Dota 2 update has added several files referring to progression for a new Drow ..."
    },
    {
        "title": "Dota 2: zai parts ways with Team Secret, joins Team Liquid",
        "content": "Nov 3, 2021 — European Dota 2 powerhouse Team Secret announced on Wednesday (3 November) that star offlaner Ludwig \"zai\" Wåhlberg has parted ways with the ..."
    },
    {
        "title": "LoL, Dota 2, and Street Fighter V among 2022 Asian Games ...",
        "content": "Sep 8, 2021 — League of Legends, Dota 2 and Street Fighter V are among the titles selected for esports' 2022 Asian Games debut as an official medal sport."
    },
    {
        "title": "The history of Dota - The rich and dramatic story - Red Bull",
        "content": "Jul 30, 2019 — Valve and IceFrog continued to develop the game, with Dota 2 finally getting the complete roster of heroes from DotA in 2016 and new heroes ..."
    },
    {
        "title": "Fantasy Dota 2 | How and where to play Fantasy Dota",
        "content": "Fantasy Dota 2 is the best way for an esports bettor to connect with their favorite players. In a Dota 2 fantasy draft, players pick from a pool of players ..."
    },
    {
        "title": "Valve's Dota 2 will become a Netflix anime series on March 25th",
        "content": "Feb 16, 2021 — “Following encounters with a powerful, ancient eldwurm as well as the noble Princess Mirana on a secret mission of her own, Davion becomes ..."
    },
    {
        "title": "DOTABUFF - Dota 2 Statistics",
        "content": "Did you know you can sign in securely with Steam to access your personal Dota 2 profile? Sign in with Steam. Live and Upcoming Matches."
    }
]