[
    "\n\n\n\nToyota — Википедия\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n59°48′52″ с. ш. 30°26′23″ в. д.HGЯOL\n\nToyota\n\nМатериал из Википедии — свободной энциклопедии\n\nЭто стабильная версия, отпатрулированная 15 ноября 2021.\n\n\n\n\n\nПерейти к навигации\nПерейти к поиску\nЗапросы «Тойота» и «Тоёта» перенаправляются сюда, см. также другие значения.\nToyota Motor Corporation トヨタ自動車株式会社   Штаб-квартира компании в городе Тоёта. \n\nТип\n\nПубличная компания\n\n\nЛистинг на бирже\n\nTYO: 7203, OSX: 7203, NSE: 7203, NYSE: TM\n\n\nОснование\n\n28 августа 1937 года\n\n\nОснователи\n\nКиитиро Тоёда\n\n\nРасположение\n\n Япония: Тоёта, Айти\n\n\nКлючевые фигуры\n\nТакэси Утиямада (председатель правления)\nАкио Тоёда  (англ.) (рус. (президент)\n\n\nОтрасль\n\nАвтомобилестроение\n\n\nПродукция\n\nЛегковые, грузовые и коммерческие автомобили, автобусы\n\n\nСобственный капитал\n\n▼ ¥16.747 трлн$152 млрд. (2016)[1]\n\n\nОборот\n\n▲ ¥28,403 трлн$258 млрд (2016)[1]\n\n\nОперационная прибыль\n\n▲ ¥2.854 трлн$25.9 млрд. (2016)[1]\n\n\nЧистая прибыль\n\n▲ ¥2,313 трлн$21 млрд. (2016)[1]\n\n\nАктивы\n\n▼ ¥47,428 трлн$431 млрд. (2016)[1]\n\n\nКапитализация\n\n▲ $177 млрд. (2016)[2]\n\n\nЧисло сотрудников\n\n349 тысяч (2016)[1]\n\n\nДочерние компании\n\nToyota Financial ServicesDaihatsuHino MotorsDensoToyota IndustriesLexus\n\n\nАудитор\n\nPricewaterhouseCoopers\n\n\nСайт\n\nglobal.toyota​ (англ.)\n Медиафайлы на Викискладе\n\nToyota Motor Corporation (яп. トヨタ自動車株式会社 тоёта дзидо:ся кабусики-гайся, TYO: 7203.T) (кратко: Toyota — «Тоёта», по-русски чаще пишется «Тойота») — крупнейшая японская автомобилестроительная корпорация, также предоставляющая финансовые услуги и имеющая несколько дополнительных направлений в бизнесе. Является крупнейшей автомобилестроительной публичной компанией в мире[3], а также крупнейшей публичной компанией в Японии[4]. Главный офис компании находится в городе Тоёта, префектура Айти, Япония. Компания занимает 6 место в Fortune Global 500[5] (2018 год).\nToyota Motor Corporation является основным членом Toyota Group. С этой компанией в основном ассоциируется бренд Toyota. Свою деятельность компания начинала с выпуска автоматических ткацких станков.\n\nСодержание\n\n1 История\n2 Собственники и руководство\n3 Деятельность\n\n3.1 Toyota в России\n\n3.1.1 Продажа автомобилей в России\n3.1.2 Завод в Санкт-Петербурге\n3.1.3 Соллерс-Буссан\n\n\n\n\n4 Автомобили\n\n4.1 Внедорожники SUV и кроссоверы\n4.2 Пикапы\n4.3 Автомобили класса «премиум»\n4.4 Военная техника\n4.5 Беспилотные автомобили\n4.6 Планетоход\n\n\n5 Экологичные технологии\n\n5.1 Гибридные технологии\n5.2 Электромобили\n\n\n6 Toyota в автоспорте\n\n6.1 Ралли\n6.2 NASCAR\n6.3 Автогонки на выносливость\n6.4 Формула 1 (F1)\n\n\n7 Toyota Racing Development (TRD)\n8 Скандалы\n9 См. также\n10 Примечания\n11 Ссылки\n\n\nИстория[править | править код]\nВ 1924 году Сакити Тоёда изобрел автоматический ткацкий станок Тойода модель G. Принцип дзидока, означающий, что машина останавливается сама, когда возникает проблема, стал позже частью производственной системы Тойоты. Ткацкие станки собирались на небольшой производственной линии. В 1929 году патент на автоматический ткацкий станок был продан британской компании, полученная от продажи сумма стала стартовым капиталом для развития автомобильного производства.\nВ 1929 году Киитиро Тоёда, сын Сакити Тоёды, совершил поездки в Европу и США для изучения автомобильной промышленности и в 1930 году приступил к разработке автомобилей с бензиновым двигателем. В 1933 году компания по производству автоматических ткацких станков Toyoda Automatic Loom Works создала новое отделение, специализирующееся на производстве автомобилей; его руководителем стал Киитиро Тоёда[6]. Правительство Японии всячески поощряло такую инициативу компании Toyoda Automatic Loom Works. В 1934 году компания произвела свой первый двигатель типа А, который был использован в первой модели легкового автомобиля А1 в мае 1935 года и в грузовике G1 в августе 1935 года. Производство пассажирского авто модели АА началось в 1936 году. Ранние модели напоминали уже существовавшие модели Dodge Power Wagon и Chevrolet.\nToyota Motor Co., Ltd. была основана в качестве самостоятельной компании в 1937 году. Несмотря на то, что фамилия основателей компании звучит как Тоёда, для упрощения произношения и в качестве символа отделения деловой деятельности от семейной жизни, компании было решено дать имя «Тоёта». В Японии название «Тоёта» (トヨタ) считается более удачным названием, чем «Тоёда» (豊田), так как 8 считается числом, приносящим удачу, а слово «Тоёта», написанное катаканой, как раз состоит из 8 черт.\nВо время Второй мировой войны компания практически занималась только производством грузовиков для Японской императорской армии. Из-за скудной ресурсно-сырьевой базы и острого дефицита сырья для производства узлов и агрегатов военной техники в Японии того времени военные грузовики делались в самых упрощенных вариантах, например, с одной фарой. Некоторые исследователи считают, что война для Японии быстро закончилась из-за американских бомбардировок производственных мощностей заводов «Тойота» в городе Аити.\nПосле войны в 1947 году начался выпуск коммерческих пассажирских авто модели SA. В 1950 году была создана отдельная компания по продажам — Toyota Motor Sales Co. (она просуществовала до июля 1982 года). В апреле 1956 года была создана дилерская сеть Toyopet. В 1957 году Toyota Crown стал первым японским автомобилем, экспортируемым в Америку (не только в США, но и в Бразилию).\nТойота начала расширяться быстрыми темпами в 1960-е годы. Первый автомобиль марки «Тойота», произведённый за пределами Японии, вышел с конвейера в апреле 1963 года в городе Мельбурн, в Австралии.\nВ самой Японии автомобили данного производителя являлись самыми продаваемыми. Так, в 1992 году на долю Тойоты приходилось 40 % машин, принадлежавших населению[7].\n\n Павильон Toyota на выставке\nКрупнейший автопроизводитель в мире\nToyota Motor является крупнейшим автопроизводителем в мире в 2007—2009 годах и с 2012 года удерживает это звание[8].\nВ I квартале 2007 года Toyota впервые выпустила и продала больше автомобилей, чем General Motors (GM). GM удерживала звание «крупнейшего автопроизводителя в мире» на протяжении 76 лет. Но последние годы GM, как и другие американские автопроизводители, переживала кризис и вынуждена была сокращать производство — освободившееся место на рынке занимают конкуренты, и в первую очередь Toyota. 24 апреля японская компания сообщила, что выпустила в I квартале 2,37 млн автомобилей и 2,35 млн продала. Таким образом, она впервые опередила GM, у которой соответствующие показатели составили 2,34 млн и 2,26 млн машин[9].\n2009 финансовый год компания завершила с убытками[10], этого не было с 1950 года.\nВ мае 2012 года Toyota вновь вырвалась на первое место, обогнав Volkswagen и General Motors[11].\nВ 2013—2015 годах марку Toyota признают самым дорогим автомобильным брендом в мире (несмотря на то, что за 2014 год стоимость бренда снизилась на 2 %)[12].\n\nСобственники и руководство[править | править код]\nОсновные владельцы акций компании на декабрь 2008 года: The Master Trust Bank of Japan (6,29 %), Japan Trustee Services Bank (6,29 %), Toyota Industries Corporation (5,81 %), 9 % — казначейские акции[13].\n\nТакэси Утиямада (Takeshi Uchiyamada) — председатель правления с 2013 года, в компании с 1969 года.\nАкио Тоёда (Akio Toyoda) — президент с 2009 года, в компании с 1984 года[14].\nДеятельность[править | править код]\nОсновное направление деятельности компании Toyota Motors Corporation — производство и продажа пассажирских и грузовых автомобилей, а также автобусов под брендами Toyota, Lexus, Scion, Daihatsu, Hino. Основные производственные мощности расположены в Японии, также крупные заводы имеются в Таиланде (Самутпракан, 10 тысяч сотрудников), США (штат Кентукки, 7,5 тысяч сотрудников), Канаде, (провинция Онтарио, 7 тысяч сотрудников), Индонезии (Джакарта, 5,5 тысяч сотрудников)[1].\nИз проданных в 2015 году в мире 91 млн автомобилей 8,681 млн были произведены компанией Toyota. Основными регионами сбыта продукции являются:\n\nЯпония — 2 млн автомобилей, оборот в 2016 году ¥8,588 трлн, доля на рынке составляет 46,8 %;\nСеверная Америка — 2,8 млн автомобилей, оборот в 2016 году ¥10,823 трлн, доля на рынке — 13,5 %;\nАзия — 1,3 млн автомобилей, оборот в 2016 году ¥4,476 трлн, доля на рынке — 13,4 %;\nЕвропа — 840 тысяч автомобилей, оборот в 2016 году ¥2,507 трлн, доля на рынке — 4,6 %;\nна другие регионы (Центральную и Южную Америку, Океанию, Африку и Ближний Восток) в 2016 финансовом году пришлось около ¥2 трлн из ¥26 трлн ($236 млрд), которые принесли продажи автомобилей[1].\nОборот подразделения финансовых услуг в 2016 финансовом году составил ¥1,854 трлн, его деятельность заключается в продажах в кредит, финансировании дилеров и страховании; услуги предоставляются в 35 странах, основные центры находятся в Японии, США, Канаде, Австралии, Германии, Великобритании, Таиланде и Китае[1].\nДругие направления деятельности (в основном операции с недвижимостью) принесли компании ¥625 млрд[1].\n\n\nПоказатели деятельности в млрд иен[1][15][16][17]\n\n\nГод\nОборот\nЧистая прибыль\nАктивы\nСобственный капитал\nОбъём продаж, млн штук\nПродажи в Японии, %\n\n\n1999\n12 464\n452\n15 879\n6655\n4,695\n41,1\n\n\n2000\n12 421\n482\n16 441\n6912\n5,183\n42,0\n\n\n2001\n12 955\n675\n17 020\n7077\n5,527\n42,0\n\n\n2002\n14 190\n557\n19 306\n7264\n5,543\n40,0\n\n\n2003\n15 502\n751\n20 153\n7121\n6,113\n36,3\n\n\n2004\n17 295\n1162\n22 040\n8179\n6,719\n34,3\n\n\n2005\n18 552\n1171\n24 335\n9045\n7,408\n32,1\n\n\n2006\n21 037\n1372\n28 732\n10 560\n7,975\n29,7\n\n\n2007\n23 948\n1644\n32 575\n11 836\n8,525\n26,7\n\n\n2008\n26 289\n1718\n32 458\n11 870\n8,914\n24,6\n\n\n2009\n20 530\n-437\n29 062\n10 061\n7,567\n25,7\n\n\n2010\n18 951\n209\n30 349\n10 360\n7,237\n29,9\n\n\n2011\n18 994\n408\n29 818\n10 332\n7,308\n26,2\n\n\n2012\n18 584\n284\n30 651\n10 550\n7,352\n28,2\n\n\n2013\n22 064\n962\n35 483\n12 148\n8,871\n25,7\n\n\n2014\n25 692\n1823\n41 437\n14 469\n9,116\n26,0\n\n\n2015\n27 235\n2173\n47 730\n16 788\n8,972\n24,0\n\n\n2016\n28 403\n2313\n47 428\n16 747\n8,681\n23,7\n\nПримечание. Данные на 31 марта каждого года, когда в Японии заканчивается финансовый год.\n\n\n\n\n\n1936 Toyoda Model AA, с оригинальным логотипом Toyoda\n\n\n\n\n\n\nCorolla\n\n\n\n\n\n\nToyota Corona (T100)\n\n\n\n\n\n\n2000GT\n\n\n\n\n\n\nToyota GT One\n\n\n\n\n\n\nToyota Camry\n\n\n\nКонкуренция\nГлавным конкурентом компании Toyota в мире является концерн Volkswagen, имеющий сопоставимый объём производства и продаж автомобилей. Toyota Prius\nToyota в России[править | править код]\nВ России на 2011 год интересы компании представляют две дочерних компании:\n\nООО «Тойота Мотор» (англ. Toyota Motor) — отвечает за реализацию автомобилей; главный офис в Москве;\nООО «Тойота Мотор Мануфэкчуринг Россия» (англ. Toyota Motor Manufacturing Russia) — отвечает за производство автомобилей в России; главный офис в Санкт-Петербурге.\nВ конце 2013 года произошло слияние ООО «Тойота Мотор» и ООО «Тойота Мотор Мануфэкчуринг Россия» в объединённую компанию ООО «Тойота Мотор»; завод в Шушарах получил статус филиала[источник не указан 1093 дня].\nГенеральный директор ООО «Тойота Мотор Мануфэкчуринг Россия»:\n\n2005—2008 годы — Масааки Мидзукава[18];\n2008—2011 годы — Мицуаки Сугимори;\nс начала 2011—2013 — Ёсинори Мацунага.\nПродажа автомобилей в России[править | править код]\n 2007 Tundra\nВ 1998 году компания открыла московское представительство Toyota Motor Corporation. Затем, в связи с динамичным развитием автомобильного рынка, было принято решение о создании национальной компании по маркетингу и продажам ООО «Тойота Мотор». 1 апреля 2002 года ООО «Тойота Мотор» начало своё функционирование на территории России[19]. Президенты ООО «Тойота Мотор»[20]:\n\n2004—2009 — Томоаки Ниситани;\nс июня 2009 — Такэси Исогая.\nВ 2007 году в России начало функционировать ЗАО «Тойота Банк», имеющее представительства в Москве и Санкт-Петербурге. Специализация банка — розничное автокредитование и корпоративное кредитование официальных дилеров автомобилей Toyota и Lexus. Концерн Toyota, по собственным данным, стал первым международным автопроизводителем, открывшим свой банк в России[21].\nВ 2015 году Toyota стала первым японским брендом на российском рынке, реализовав через официальных дилеров и уполномоченных партнёров Тойота в России 98’149 автомобилей.\nСамые популярные модели компании на российском рынке: Toyota Camry, RAV4, Land Cruiser Prado и Land Cruiser 200.\nToyota Land Cruiser 200 занимает первое место по популярности на российском рынке в сегменте премиальных полноразмерных внедорожников: доля в сегменте около 45 %.\nВ январе 2021 года Toyota объявила, что отзывает в России 82,4 тыс. автомобилей. Отзыв коснулся внедорожников Lexus LX570 и Toyota Land Cruiser 200, проданных с 31 января 2013 года по январь 2021 года.[22]\n\nЗавод в Санкт-Петербурге[править | править код]\n\nВ апреле 2005 года Toyota подписала соглашение с Минэкономразвития России и администрацией Санкт-Петербурга о строительстве в посёлке Шушары автосборочного завода. Производство было открыто 21 декабря 2007 года; на этапе открытия мощность завода составляла 20 тысяч автомобилей Toyota Camry в год. Объём инвестиций в проект расценивается на уровне около 150 млн долларов[23][24]. На январь 2018 года суммарные инвестиции оцениваются в 27,5 млрд рублей[25].\nЛокализация первого этапа включала сварку и окраску кузовов[25]. В 2014 году локализация расширена, включая штамповку кузова и литье пластмассовых деталей. В 2015 году мощность завода увеличена до 100 тысяч машин в год. На 2017 год локализация составила 30 %[26]. На 2019 год в производстве Toyota Camry и Toyota RAV4 (с 2016 года).\nВ 2017 году выпущено 66 684 автомобиля, работает 2 400 человек[27]. В 2011 году собрано 14131 автомобилей[28]. В 2008 году выпущено 6 393 автомобиля[27].\nДиректор филиала ООО «Тойота Мотор» в Санкт-Петербурге:\n\n2014—2016 годы — Ёсинори Мацунага\nс 2017 — Исида Масаси\nСоллерс-Буссан[править | править код]\nВ 2011 году компания огласила свои планы по производству Toyota Land Cruiser Prado на Дальнем Востоке на совместном предприятии с Sollers и Mitsui.[29] Сборка велась с 2013 по 2015 годы на заводе Соллерс-Буссан во Владивостоке[30][31]. В 2018 году компания заявила что не планирует возобновлять производство Land Cruiser Prado в России.\n\nАвтомобили[править | править код]\n Toyota Land Cruiser (UZJ100R, Австралия)\n Toyota HiLux (GGN15R MY10, Австралия)\nПо состоянию на 2009 год, официальный список автомобилей Toyota насчитывает около 70 разных моделей, продаваемых под собственным брендом, включая седаны, купе, минивэны, пикапы, гибриды и кроссоверы[32]. Многие из этих моделей выпускаются как легковые седаны, которые варьируются от субкомпактного Toyota Vitz/Yaris и компактного Corolla, до среднеразмерного Camry и полноразмерного Avalon[32]. Минивэны представлены моделями Previa/Estima, Sienna и другими[32]. Несколько компактных автомобилей, таких как xB и tC, продаются под брендом Scion[32].\n\nВнедорожники SUV и кроссоверы[править | править код]\n Highlander (2017-)\nКроссоверы от Toyota выстраиваются от компактных Matrix и RAV4, до среднеразмерных Venza и Kluger/Highlander[32]. Внедорожники SUV — от среднего 4Runner до полноразмерного Land Cruiser[32]. К другим внедорожникам относятся Prado, FJ Cruiser, Fortuner и Sequoia[32].\nВ феврале 2019 года Toyota представила дизайн и параметры нового внедорожника Toyota Sequoia. Известно, что это будет автомобиль с системой полного привода, шестиступенчатой автоматической трансмиссией и бензиновым двигателем, объёмом 5,7 литров и мощностью порядка 367 л. с.[источник не указан 1014 дней]\n\nПикапы[править | править код]\nToyota впервые вышла на рынок пикапов в 1947 году с моделью SB, которая продавалась только в Японии и на некоторых азиатских рынках. За ним, в 1954 году последовал RK (переименованный в 1959 году как Stout) и в 1968 году компактный Hilux. В дальнейшем, Hilux (известный на некоторых рынках просто как Pickup) прославился чрезвычайной прочностью и надежностью, и многие из этих пикапов ещё с конца 1970-х годов по сей день передвигаются по дорогам, некоторые с пробегом более чем в 300 000 миль (480 000 км). В конечном итоге появились версии с расширенной и двойной кабинами, Toyota продолжает выпускать пикапы сегодня под разными названиями в зависимости от рынка.\nПридя к успеху в классе компактных пикапов в США, Toyota решила войти в традиционный рынок полноразмерных пикапов, представив T100, выпускавшийся с 1993 по 1998 годы. Несмотря на длину кузова в 8 футов (2,4 метра), подвеска и характеристики двигателя все ещё были похожи на компактный пикап. Он оказался экономичным и надежным, как любой типичный пикап Toyota, но его продажи не росли.\nВ 1999 году Toyota сменила T100 на большую модель Tundra. Tundra получила также двигатель V8, чего на предшественнике не было. Все минусы, присутствующие в этом автомобиле, и указанные критиками, были исправлены во втором поколении в 2007 году. Автомобили Tundra собирались американском Сан-Антонио, штат Техас.\nВне США, Toyota выпускает Hilux в стандартном и двух-кабинном кузовах, с бензиновыми и дизельными двигателями, в версиях 2WD и 4WD. Телешоу Top Gear выпустило два эпизода с автомобилем Hilux, признав его «практически неуязвимым»[33].\n\nАвтомобили класса «премиум»[править | править код]\nОсновная статья: Lexus\nПо состоянию на 2009 год, компания продавала девять представительских фирменных моделей своего подразделения Lexus, варьировавшихся от седана LS до кроссовера RX и внедорожника LX[32]. Представительские седаны, выпускаемые под брендом Toyota включают модели Century, Crown и Crown Majesta[32]. Ограниченной серией выпускается модель для Императора Японии, которая называется Century Royal.\n\nВоенная техника[править | править код]\nОсновная статья: Военная и полицейская техника «Тойота»\nВ годы Второй мировой войны «Тойота» выпускала сухопутные и амфибийные военные грузовики (KC и KCY) и вездеходы-амфибии Су-Ки. В годы Корейской войны она выпускала военные автомобили для Вооружённых сил США и войск ООН. В последующие годы компания производила для военных нужд специально оборудованные версии гражданских внедорожников, таких как Hilux и Land Cruiser.\n\nБеспилотные автомобили[править | править код]\nКомпания Toyota в августе 2017 года объявила, что первые беспилотные автомобили бренда будут представлены в 2020 году во время Олимпийских игр в Токио[34].\n\nПланетоход[править | править код]\nВ 2019 году компания представила проект беспилотного планетохода, на котором астронавты смогут передвигаться по Луне без использования скафандров[35].\n\nЭкологичные технологии[править | править код]\n Робот фирмы Toyota, играющий на трубе\nГибридные технологии[править | править код]\nСм. также: Гибридный автомобиль\nToyota Motor с 1997 года активно продвигает гибридные технологии на автомобильный рынок и является первой компанией, начавшей массовое производство и продажу гибридных автомобилей (Toyota Prius). Позднее компания стала комплектовать гибридной силовой установкой модели Camry, а позже и Lexus. Компания назвала собственную гибридную технологию «Hybrid Synergy Drive», а для линии Lexus это название звучит как «Lexus Hybrid Drive». Модель Prius стала самой продаваемой в США. Тойота сейчас имеет три линии гибридных авто, основанных на системе «Hybrid Synergy Drive»: Prius, Highlander и Camry. Популярный минивэн Toyota Sienna в гибридной версии планируется к выпуску в 2010 году, а к 2030 году компания планирует перевести на «Hybrid Synergy Drive» всю линейку своей продукции.\nК 28 февраля 2011 года компания продала 3,03 млн гибридных автомобилей[36].\nВ ноябре 2013 года на Токийском автосалоне компанией Тойота впервые был представлен публике автомобиль марки Toyota Mirai — водородный гибридный автомобиль на топливных элементах.\n\nЭлектромобили[править | править код]\nСм. также: Электромобиль\nПосле того, как компания General Motors заявила о своих планах по созданию электромобиля Chevrolet Volt, Toyota Motor заявила о своём намерении начать разработку аналога. Сейчас[уточнить] компания испытывает «Toyota Plug-in HV» в Японии, США и Европе. Аналогично Chevrolet Volt, эта модель основана на аккумуляторе типа Li-ion. Считается, что электромобиль менее пагубно влияет на окружающую среду, нежели автомобили на гибридном двигателе.\n\nToyota в автоспорте[править | править код]\n Нил Бейтс на автомобиле Toyota Corolla WRC на ралли Квинсленда, 1998\nРалли[править | править код]\nОсновная статья: Toyota Motorsport GmbH\nАвтомобили Toyota дебютировали в большом автоспорте в конце 1972 года, когда шведский гонщик, Уве Андерссон, создатель компании Andersson Motorsport (вскоре превратившейся в Toyota Team Europe), впервые стартовал на заводской Toyota Celica в британском RAC Rally[37]. Уже в 1973 году Вальтер Бойс выиграл несколько ралли-гонок на модели Toyota Corolla, в том числе на этапе чемпионата мира в Ралли США, но он выступал на частной машине[38]. А первая по-настоящему значимая победа заводской команды в международном автоспорте состоялась в 1975 году на ралли 1000 озёр в Финляндии, когда Ханну Миккола и его штурман Атсо Ахо выиграли этап чемпионата мира, также на модели Toyota Corolla[39]. В 1993 году Toyota купила раллийную команду Андерссона, назвав её Toyota Motorsport GmbH.\nВ 1995 году произошёл скандал, закончившийся дисквалификацией команды на 12 месяцев. На ралли Каталонии специалистами FIA были обнаружены запрещённые изменения системы турбонаддува. Президент FIA, Макс Мосли говорил об изменениях: «самое сложное устройство, что я видел за 30 лет в автоспорте»[40].\nПосле некоторых успехов команды в 1997 году, в конце сезона 1999 года Toyota решила оставить автоспорт, сказав что «всё, что можно было достичь, было достигнуто». В марте 2007 года Toyota выпустила автомобиль в категории Super 2000 на основе Toyota Corolla, который участвует в Австралийском чемпионате по ралли[41].\n\nNASCAR[править | править код]\nАвтогонки на выносливость[править | править код]\nФормула 1 (F1)[править | править код]\nОсновная статья: Тойота (команда Формулы-1)\n Toyota F1 2003\nВ 2002 году Toyota начала участвовать в гонках Формулы 1 с Toyota Team Europe, базирующейся в Кёльне, Германия. Несмотря на огромный бюджет, команда не показывала тех результатов, которые от неё ждали болельщики.\nВ 2004 году был нанят проектировщик Майк Гаскойн. Но из-за невысоких результатов и разногласий с управлением по мнению о том, как команда должна прогрессировать, он был освобождён от своего контракта в середине сезона 2006.\nС 2007 года Toyota поставляет свои двигатели команде Williams.\nВ 2009 году, последнем сезоне для команды, пилотами были Ярно Трулли и Тимо Глок. А уже 4 ноября Toyota объявила о своём уходе из Формулы 1.\n\nToyota Racing Development (TRD)[править | править код]\nОсновная статья: Toyota Racing Development\n7 июня 1954 года была организована компания Toyota Technocraft Co., Ltd., задачей которой стали ремонт и обслуживание автомобилей головной компании концерна. Для успешного участия заводских автомобилей Toyota в различных соревнованиях из Toyota Technocraft выделили автоспортивное подразделение Toyota Racing Development, в настоящее время относящееся к разряду тюнинг-ателье. В 1979 году было открыто подразделение TRD USA.\nПервой серьёзной работой мастеров TRD стала подготовка заводской команды (фактически, постройка болидов) к японской серии гонок Формула-3. Также доработанные в подразделении Toyota Racing Development кузовные авто для национального чемпионата Super GT. К наиболее интересным работам ателье для частных клиентов последних лет стали ограниченные серии малолитражных Toyota ist, Toyota Vitz и Toyota bB 2002 года и особая линейка внедорожников Toyota FJ Cruiser. Также мастерам подразделения Toyota Racing Development принадлежит авторство всех трёх поколений модификаций GT-Four для Toyota Celica[42].\n\nСкандалы[править | править код]\nВ ноябре 2019 года компанию признали виновной в самоубийстве одного из сотрудников. Специальная трудовая надзорная комиссия пришла к выводу, что причиной самоубийства 28-летнего дизайнера авто в штаб-квартире компании в городе Тойота в 2017-ом году, стали постоянные унижения и давление со стороны одного из начальников [43].\n\nСм. также[править | править код]\nМедиафайлы на Викискладе\nToyota Group\nDaihatsu\nHino Motors\nДвигатели Toyota\nПримечания[править | править код]\n\n\n↑ 1 2 3 4 5 6 7 8 9 10 11 Annual Report 2016 on the SEC Filing form 20-F (англ.).  Toyota Motors Corporation. Дата обращения: 10 августа 2016.\n\n↑ The World’s Biggest Public Companies List\n\n↑ Forbes Global 2000. — Крупнейшие автомобилестроительные компании в мире\n\n↑ Forbes Global 2000. — Крупнейшие японские компании\n\n↑ Global 500 (неопр.).  Fortune Media IP. Дата обращения: 25 апреля 2019.\n\n↑ History of Toyota Motor Corporation (англ.).  Funding Universe. Дата обращения: 13 августа 2016.\n\n↑ Наиболее известная японская марка (неопр.) 6.  «ЗР» (№ 4, апрель 1994). Дата обращения: 23 мая 2015.\n\n↑ Toyota вновь лидер в автоиндустрии! (рус.).  motornovosti (28 января 2016). Дата обращения: 13 августа 2016.\n\n↑ «Toyota — крупнейший автоконцерн в мире» // Ведомости, 25.04.2007, № 74 (1848)\n\n↑ Впервые с 1950-го Toyota закончила год с убытками \n\n↑ Toyota вырвалась на первое место\n\n↑ Назван самый дорогой автомобильный бренд  // май 2015\n\n↑ Александр Губский. «В этот кризис плохо всем и везде», — Фудзио Тё, председатель правления Toyota Motor Corporation // Ведомости, № 233 (2255), 9 декабря 2008\n\n↑ Toyota Motor Corp. - People (англ.).  Reuters. Дата обращения: 13 августа 2016.\n\n↑ Annual Report 2003 on the SEC Filing Form 20-F (англ.).  Toyota Motors Corporation. Дата обращения: 11 августа 2016.\n\n↑ Annual Report 2006 on the SEC Filing Form 20-F (англ.).  Toyota Motors Corporation. Дата обращения: 11 августа 2016.\n\n↑ Annual Report 2011 on the SEC Filing Form 20-F (англ.).  Toyota Motors Corporation. Дата обращения: 11 августа 2016.\n\n↑ www.dp.ru со ссылкой на «Прайм-ТАСС». Назначен новый гендиректор Toyota в Петербурге // Деловой Петербург ISSN 1606-1829 (Online) /Санкт-Петербург/. — 10:26 28 февраля 2008. (недоступная ссылка)\n\n↑ Toyota.ru. О компании Тойота (рус.). — Официальный сайт компании. Дата обращения: 2 февраля 2010. Архивировано 24 августа 2011 года.\n\n↑ Антикризисная философия: ООО «Тойота Мотор» возглавил новый президент :: РБК daily от 08.06.2009\n\n↑ Тойота Банк :: О Toyota Financial Services\n\n↑ Toyota отзывает 82,4 тыс. внедорожников из-за проблем с омывателем стекла (рус.). Коммерсантъ (29 января 2021). Дата обращения: 29 января 2021.\n\n↑ Интервью: Тадаси Арасима, президент Toyota Motor Europe. Ведомости, № 62 (1836), 9 апреля 2007\n\n↑ Греф купит Toyota Camry Архивировано 14 июля 2009 года.\n\n↑ 1 2 Завод Тойота в России\n\n↑ Производство Тойота в Санкт-Петербурге: 10 лет и 280 000 выпущенных автомобилей\n\n↑ 1 2 Успешный запуск производства новой Toyota Camry и 10-летний юбилей завода\n\n↑ На 11,1 % сократил производство автомобилей завод Toyota в Шушарах Архивная копия от 8 февраля 2013 на Wayback Machine // vchera.com, 13.01.2012\n\n↑ Такеши Исогая: «Сибирь — удачная площадка для определения сильных и слабых сторон нашей продукции». деловая газета «Континент Сибирь», Апрель 2011\n\n↑ Toyota сделала заявление насчет популярного в Приморье внедорожника\n\n↑ Cruiser Prado\n\n↑ 1 2 3 4 5 6 7 8 9 Toyota Product Line up 2009 (неопр.) (PDF). Дата обращения: 4 сентября 2016.\n\n↑ Top Gear – Episode Archive – Series 3 (неопр.).  BBC (23 ноября 2003). Дата обращения: 4 сентября 2016.\n\n↑ Беспилотные автомобили Toyota дебютируют на Олимпийских играх 2020 года (неопр.). RuNews24.ru (15 августа 2017).\n\n↑ McCurry J. Toyota joins space race with plan for self-driving lunar rover (англ.). The Guardian (13 March 2019). Дата обращения: 14 марта 2019.\n\n↑ Cumulative worldwide sales of Toyota hybrids top 3M units. 8 March 2011\n\n↑ Ove Andersson (англ.).  juwra.com. Дата обращения: 19 сентября 2020.\n\n↑ Walter Boyce (англ.).  ewrc-results.com. Дата обращения: 19 сентября 2020.\n\n↑ 25. Jyväskylän Suurajot - Rally of the 1000 Lakes 1975 (англ.).  ewrc-results.com. Дата обращения: 19 сентября 2020.\n\n↑ Toyota team pick up a one-year ban, The Independent (4 ноября 1995). Дата обращения 5 мая 2016.\n\n↑ Toyota Super 2000 Corolla debut\n\n↑ История и современные проекты Toyota Racing Development (неопр.) (недоступная ссылка). Дата обращения: 6 августа 2010. Архивировано 17 августа 2010 года.\n\n↑ Toyota признана виновной в самоубийстве ее сотрудника (неопр.). ТАСС. Дата обращения: 7 июня 2021.\n\n\nСсылки[править | править код]\ntoyota.ru — официальный сайт Toyota\nToyota Motors на сайте Комиссии по ценным бумагам и биржам (англ.)\n   В социальных сетях\nFacebook (англ.)\nTwitter (англ.)\nФото, видео и аудио\nInstagram\nInstagram (англ.)\nYouTube\nYouTube (англ.)\nYouTube (яп.)\nТематические сайты\nInternet Movie Database\nСловари и энциклопедии\nБольшая каталанская\nБольшая норвежская\nBritannica (онлайн)\nВ библиографических каталогах\nBNF: 12145829k\nGND: 136030-9\nISNI: 0000 0000 9175 1993\nLCCN: n83063437\nNDL: 00262927\nNKC: ph278594\nSUDOC: 029939070\nVIAF: 153304083\nWorldCat VIAF: 153304083\n\nToyota Motor CorporationПодразделения\nToyota Motor Corporation\nToyota Housing\nWiLL\nToyota Peugeot Citroën Automobile Czech\nБренды\nToyota\nLexus\nScion\nDaihatsu\nHino Motors\nSubaru (16.1% FHI)\nRanz\nТекущие модели\n4Runner\nAgya\nAllion\nAlphard\nAuris\nAurion\nAvalon\nAvanza\nAvensis\nAygo\nbB\nBelta\nBlade\nCamry\nHybrid\nCentury\nCoaster\nComfort\nCorolla E140/E150\nCorolla E170 (Axio\nFielder\nRumion)\nCrown (Athlete\nComfort\nHybrid\nMajesta\nRoyal)\nDyna\nEstima/Previa (Hybrid)\nEtios\nFJ Cruiser\nFortuner\nGranvia\nGT-86\nHarrier (Hybrid)\nHiAce\nHighlander (Hybrid)\nHilux (VIGO)\nInnova\niQ\nIsis\nist\nKijang\nKluger (Kluger Hybrid)\nLand Cruiser (Prado\n70 Series)\nLiteAce\nMark X (ZiO)\nMatrix\nModellista\nNoah\nPasso\nPicnic\nPixis Epoch\nPixis Space\nPixis Van/Truck\nPorte\nPremio\nPrius (I\nII\nIII\nIV\nPrius α/v/+\nPrius c\nPrius Plug-in Hybrid)\nProbox\nRactis\nRAV4\nRegius Ace\nReiz\nRush\nSAI\nSemibon\nSequoia\nSienna\nSienta\nSoluna Vios\nSucceed\nTacoma\nTarago\nTown Ace\nToyoAce\nTundra\nUrban Cruiser\nVanguard\nVellfire\nVenza\nVios\nVerso\nVitz/Yaris\nVoxy\nWISH\nZelas\nВодородные автомобилиToyota MiraiПрошлые модели\n2000GT\nAA\nAllex\nAltezza\nAristo\nBrevis\nCaldina\nCami\nCarina (ED)\nCelica (GT-Four)\nCelsior\nChaser\nClassic\nCorona\nCorona EXiV\nCorolla Ceres\nCorolla Spacio\nCorsa\nCressida\nCresta\nCurren\nCynos\nFA/DA\nDA115\nDuet\nEcho\nFJ40\nFun Cargo\nGaia\nGranvia\nGrand Hiace\nLexcen\nMark II (Blit\nQualis)\nMega Cruiser\nMR2\nMR-S\nOpa\nOrigin\nPaseo\nPicnic\nPlatz\nProgrès\nPronard\nPublica\nRegius\nRevo\nScepter\nSports 800\nSA\nSera\nSoarer\nSprinter\nSprinter Marino\nStarlet\nStout\nSupra\nT100\nTamaraw\nTercel\nTiara\nVan\nVerossa\nVista\nVoltz\nWiLL\nWindom\nКонцепт-кары\n1957 Sports\nSports X\n4500GT\nA-BAT\nAlessandro Volta\nAvalon\nAXV-IV\nCAL-1\nCamry TS-01\nCelica Cruising Deck\nCorona Sports Coupe\nCS&S\neCom\nEX-1\nEX-11\nEX-3\nEX-7\nF101\nF1/Ultimate Celica\nF3R\nFine-N\nFine-S\nFine-X\nFT-86\nFT-HS\nFT-SX\nFTX\nFX-1\nFXV\nFXV-II\nFXS\nGTV\nHybrid X\ni-swing\ni-unit\nMarinetta\nMarinetta 10\nMotor Triathlon Race Car\nMP-1\nNLSV\nPM\nPod\nProject Go\nPublica Sports\nRiN\nRSC\nRV-1\nRV-2\nSport\nSportivo Coupe\nStation Wagon\nStreet Affair\nSV-1\nSV-3\nTAC3\nVM180 Zagato\nX\nXYR\nБензиновые двигатели\nG\nJZ\nNZ (1NZ-FXE)\nUZ\nZZ\nGR\nUR\nДизельные двигатели\nB\nHD\nGD\nKZ\nKD\nL\nVD\nТехнологии\nHybrid Synergy Drive\nVVT-i\nКэйрэцу\nDENSO\nAisin Seiki Co.\nKoito\n\nКиитиро Тоёда\nToyota: 14 принципов ведения бизнеса\nГород Тоёта\nКоманда F1 Toyota\n\nБренды Toyota Motor Corporation\nToyota\nLexus\nScion\nDaihatsu\nHino Motors\nSubaru (FHI 8.9%)\nIsuzu (5.9%)\n\n База расчёта индекса TOPIX Токийской фондовой биржиОсновные 30\n7&i\nAstellas\nCanon\nDenso\nFANUC\nHitachi\nHonda\nJR Central\nJR East\nJT\nKDDI\nMitsubishi Corporation\nMitsubishi Estate\nMitsui & Co.\nMitsui Fudosan\nMizuho\nMUFG\nMurata\nNissan\nNomura\nNTT\nNTT docomo\nPanasonic\nShin-Etsu\nSMFG\nSoftBank\nSony\nTakeda\nTokio Marine\nToyota\nДополнительные 70\nÆon\nAjinomoto\nANA\nAsahi Group\nAsahi Kasei\nBank of Yokohama\nBridgestone\nChuden\nDai-ichi Life\nDaiichi Sankyo\nDaikin\nDaito Trust Construction\nDaiwa House\nDaiwa Securities\nEisai\nFast Retailing\nFujifilm\nFujitsu\nHoya\nInpex\nIsuzu\nItochu\nJAL\nJFE\nJR West\nJX Holdings\nKao\nKEPCO\nKeyence\nKirin\nKomatsu\nKubota\nKyocera\nMarubeni\nMazda\nMitsubishi Chemical\nMitsubishi Electric\nMitsubishi Heavy Industries\nMS&AD\nNidec\nNintendo\nNippon Steel & Sumitomo Metal Corporation\nNitto Denko\nOno\nOriental Land\nOrix\nOsaka Gas\nOtsuka Holdings\nOtsuka Pharma\nRakuten\nResona Holdings\nSecom\nSekisui House\nShionogi\nShiseido\nSMC\nSompo\nSubaru Corporation\nSumitomo Corporation\nSumitomo Electric\nSumitomo Metal Mining\nSumitomo Mitsui Trust Holdings\nSumitomo Realty & Development\nSuzuki\nT&D\nTokyo Electron\nTokyo Gas\nToray\nToshiba\nUnicharm\nYamato\n\n База расчёта индекса Nikkei 225 Токийской фондовой биржи\n7&i\nAdvantest\nÆon\nAGC\nAjinomoto\nAlps\nAmada\nANA\nAozora Bank\nAsahi Group\nAsahi Kasei\nAstellas\nBank of Yokohama\nBridgestone\nCanon\nCasio\nChiba Bank\nChiyoda\nChuden\nChugai\nCitizen\nComsys\nCredit Saison\nDai-ichi Life\nDaiichi Sankyo\nDaikin\nDaiwa House\nDaiwa Securities\nDeNA\nDenka\nDenso\nDentsu\nDNP\nDowa\nEbara\nEisai\nFANUC\nFast Retailing\nFuji Electric\nFujifilm\nFujikura\nFujitsu\nFukuoka Financial\nFurukawa Group\nFurukawa Electric\nGS Yuasa\nHaseko\nHino\nHitachi\nHitachi Construction Machinery\nHitz\nHokuetsu Kishu Paper\nHonda\nIHI\nInpex\nIsetan Mitsukoshi\nIsuzu\nItochu\nJ. Front Retailing\nJFE\nJGC\nJR Central\nJR East\nJR West\nJSW\nJT\nJTEKT\nJX Holdings\nK Line\nKajima\nKao\nKawasaki\nKDDI\nKeio\nKeisei\nKEPCO\nKikkoman\nKirin\nKobelco\nKomatsu\nKonami\nKonica Minolta\nKubota\nKuraray\nKyocera\nKyowa Hakko Kirin\nMarubeni\nMaruha Nichiro\nMarui\nMatsui Securities\nMazda\nMeidensha\nMeiji Holdings\nMES\nMinebea\nMitsubishi Chemical\nMitsubishi Corporation\nMitsubishi Electric\nMitsubishi Estate\nMitsubishi Heavy Industries\nMitsubishi Logistics\nMitsubishi Materials\nMitsubishi Motors\nMitsui & Co.\nMitsui Chemicals\nMitsui Fudosan\nMitsui Mining & Smelting\nMitsumi\nMizuho\nMOL\nMS&AD\nMUFG\nNEC\nNGK\nNH Foods\nNichirei\nNikon\nNEG\nNippon Express\nNippon Kayaku\nNippon Light Metal\nNippon Paper\nNippon Soda\nNippon Steel & Sumitomo Metal Corporation\nNippon Suisan\nNYK Line\nNissan\nNissan Chemical\nNisshin Seifun\nNisshin Steel\nNisshinbo\nNitto Denko\nNomura\nNSG\nNSK\nNTN\nNTT\nNTT Data\nNTT docomo\nObayashi\nOdakyu\nOji\nOKI\nOkuma\nOlympus\nOsaka Gas\nPacific Metals\nPanasonic\nPioneer\nResona Holdings\nRicoh\nSapporo Holdings\nScreen Holdings\nSecom\nSekisui\nSharp\nShimz\nShin-Etsu\nShinsei Bank\nShionogi\nShiseido\nShizuoka Bank\nShowa Denko\nShowa Shell\nSKY Perfect JSAT\nSubaru Corporation\nSMFG\nSoftBank\nSojitz\nSompo\nSony\nSony Financial\nSUMCO\nSumitomo Chemical\nSumitomo Corporation\nSumitomo Dainippon\nSumitomo Electric\nSumitomo Heavy Industries\nSumitomo Metal Mining\nSumitomo Mitsui Trust Holdings\nSumitomo Osaka Cement\nSumitomo Realty & Development\nSuzuki\nT&D\nTaiheiyo\nTaisei\nTaiyo Yuden\nTakara\nTakashimaya\nTakeda\nTDK\nTeijin\nTEPCO\nTerumo\nTobu\nToho\nToho Zinc\nTokai Carbon\nTokio Marine\nTokuyama\nTokyo Dome\nTokyo Electron\nTokyo Gas\nTokyo Tatemono\nTokyu\nTokyu Fudosan\nToppan\nToray\nToshiba\nTosoh\nToto\nToyo Seikan\nToyobo\nToyota\nToyota Tsusho\nTrend Micro\nUbe\nUnitika\nUny\nYahoo! Japan\nYamaha\nYamato\nYaskawa\nYokogawa\nYokohama Rubber\n\nБаза расчёта индекса Dow Jones Global Titans 50\nAbbott Laboratories\nAllianz\nApple\nAT&T\nBanco Santander\nBank of America\nBASF\nBerkshire Hathaway\nBHP Billiton\nBP\nChevron\nCisco Systems\nCitigroup\nCoca-Cola\nCommonwealth Bank of Australia\nConocoPhillips\nEni\nExxonMobil\nГазпром\nGeneral Electric\nGlaxoSmithKline\nGoogle\nHSBC\nIBM\nIntel\nJohnson & Johnson\nJPMorgan Chase\nMerck & Co.\nMicrosoft\nMitsubishi UFJ Financial Group\nNestlé\nNokia\nNovartis\nOracle\nPepsiCo\nPfizer\nPhilip Morris International\nProcter & Gamble\nQualcomm\nRoche\nRoyal Dutch Shell\nSamsung Electronics\nSanofi\nSchlumberger\nSiemens\nTelefónica\nTotal\nToyota\nVerizon Communications\nVodafone\nWalmart\n\nПроизводители автобусов АзииСуществующие\nAnkai\nAshok Leyland\nBharatBenz\nBonluck Bus\nBYD Auto\nZyle Daewoo Commercial Vehicle\nDongfeng Nissan-Diesel\nEicher Motors\nForce\nFoton\nГянджинский автомобильный завод\nGemilang Coachworks\nGhandhara\nGAG Bus\nHICOM AM\nHindustan\nHuanghai Bus\nHyundai Motor Group\nHyundai\nKia\nFujian Motors Group\nKing Long\nXiamen Golden Dragon\nHiger Bus\nIran Khodro Diesel\nIsuzu\nJAC\nMahindra\nMahindra Navistar\nSsangYong\nMaster\nMitsubishi Fuso\nMudan\nNissan\nSaipa Diesel\nSamAuto\nSHL Coach\nSunlong Bus\nSwaraj Mazda\nTata\nTata Daewoo\nTata Marcopolo\nToyota\nHino\nHinopak\nUD Trucks\nZhongtong Bus\nЗакрывшиеся\nБакАЗ\nChangzhou Changjiang\nЧАЗ\nFHI\nGhandhara Nissan\nSamsung\n\n\n\n\n\nИсточник — https://ru.wikipedia.org/w/index.php?title=Toyota&oldid=117907839\nКатегории: Компании, имеющие листинг акций на Токийской биржеКомпании, имеющие листинг акций на Осакской биржеКомпании, имеющие листинг акций на Нагойской биржеКомпании, имеющие листинг акций на Нью-Йоркской биржеКомпании по алфавитуКомпании, основанные в 1937 годуToyotaКомпании ТокиоПроизводители электромобилейАвтомобилестроительные компании ЯпонииСкрытые категории: Википедия:Статьи с некорректным использованием шаблонов:Cite web (не указан язык)Википедия:Статьи с нерабочими ссылкамиВикипедия:Нет источников с ноября 2018Википедия:Статьи без источников (страна: Япония)Википедия:Статьи без источников (тип: автопроизводитель)Википедия:Статьи без источников (тип: публичная компания)Википедия:Статьи без источников (тип: бизнес)Википедия:Статьи с утверждениями без источников более 14 днейВикипедия:Нет источников с февраля 2019Википедия:Статьи, требующие уточнения источниковВикипедия:Страницы с картами\n\n\n\n\n\n\nНавигация\n\n\n\nПерсональные инструменты\n\n\nВы не представились системеОбсуждениеВкладСоздать учётную записьВойти\n\n\n\n\n\nПространства имён\n\n\nСтатьяОбсуждение\n\n\n\n\n\nВарианты\nexpanded\ncollapsed\n\n\n\n\n\n\n\n\n\nПросмотры\n\n\nЧитатьПравитьПравить кодИстория\n\n\n\n\n\nЕщё\nexpanded\ncollapsed\n\n\n\n\n\n\n\n\nПоиск\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nНавигация\n\n\nЗаглавная страницаРубрикацияУказатель А — ЯИзбранные статьиСлучайная страницаТекущие события\n\n\n\n\nУчастие\n\n\nСообщить об ошибкеСообществоФорумСвежие правкиНовые страницыСправкаПожертвовать\n\n\n\n\nИнструменты\n\n\nСсылки сюдаСвязанные правкиСлужебные страницыПостоянная ссылкаСведения о страницеЦитировать страницуЭлемент Викиданных\n\n\n\n\nПечать/экспорт\n\n\nСоздать книгуСкачать как PDFВерсия для печати\n\n\n\n\nВ других проектах\n\n\nВикискладВикиновости\n\n\n\n\nНа других языках\n\n\nAfrikaansالعربيةمصرىAsturianuAzərbaycancaتۆرکجهБеларускаяБеларуская (тарашкевіца)БългарскиবাংলাBosanskiCatalàکوردیČeštinaKaszëbscziCymraegDanskDeutschZazakiΕλληνικάEnglishEsperantoEspañolEestiEuskaraفارسیSuomiFrançaisNordfriiskGalegoHausaעבריתहिन्दीHrvatskiKreyòl ayisyenMagyarՀայերենBahasa IndonesiaÍslenskaItaliano日本語La .lojban.JawaQaraqalpaqshaGĩkũyũҚазақша한국어KurdîLatinaLingálaLietuviųLatviešuMalagasyМакедонскиമലയാളംМонголमराठीBahasa Melayuမြန်မာဘာသာNāhuatlNederlandsNorsk nynorskNorsk bokmålਪੰਜਾਬੀPolskiPiemontèisپنجابیPortuguêsRomânăСаха тылаScotsسنڌيSrpskohrvatski / српскохрватскиSimple EnglishSlovenčinaSlovenščinaSoomaaligaShqipСрпски / srpskiSvenskaதமிழ்ไทยTagalogTürkçeУкраїнськаاردوOʻzbekcha/ўзбекчаVènetoTiếng Việt吴语YorùbáZeêuws中文Bân-lâm-gú粵語\nПравить ссылки\n\n\n\n\n\n\n Эта страница в последний раз была отредактирована 15 ноября 2021 в 22:29.\nТекст доступен по лицензии Creative Commons Attribution-ShareAlike; в отдельных случаях могут действовать дополнительные условия.\nПодробнее см. Условия использования.\nWikipedia® — зарегистрированный товарный знак некоммерческой организации Wikimedia Foundation, Inc.\n\n\nПолитика конфиденциальности\nОписание Википедии\nОтказ от ответственности\nСвяжитесь с нами\nМобильная версия\nРазработчики\nСтатистика\nЗаявление о куки\n\n\n\n\n\n\n\n\n\n",
    "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nトヨタ自動車株式会社 公式企業サイト\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nピックアップ\n2021年10月29日\n\n新型BEV、bZ4Xの詳細を公表\n\n\n\n\n\n\n\n\n\n【お知らせ】新型コロナウイルス感染拡大に伴う対応について\n\n\n\n\n\n\n\n\n\n\n\nピックアップ\n2021年11月19日\n\n変革期に、オールジャパンで立ち向かえ。自工会・新体制発表【前編】\n\n\n\n\n\n\n\n\n\nピックアップ\n2021年11月19日\n\n歴代カローラのカタログでたどる、日本のライフスタイルの変遷と自動車（後編）～バブル崩壊後の7代目から12代目～\n\n\n\n\n\n\n\n\n\nピックアップ\n2021年11月18日\n\n歴代カローラのカタログでたどる、日本のライフスタイルの変遷と自動車（前編）～高度成長期の初代カローラからバブル期6代目～\n\n\n\n\n\n\n\n\n\nピックアップ\n2021年11月17日\n\n「幻のレースカーを復元せよ！」第1回　豊田 喜一郎の信念が生んだトヨペット・レーサーとは\n\n\n\n\n\n\n\n\n\nピックアップ\n2021年11月15日\n\nWRCで活躍する勝田貴元選手出演！ 親子3代そしてトヨタとの絆\n\n\n\n\n\n\n\n\n\n\n\nピックアップ\n2021年10月28日\n\n新型GR86を発売\n\n\n\n\n\n\n\n\n\n\n\nニュースルーム\nニュース一覧へ\n\n\n\n\n\n\n\n\n\n\n\n\nサイト更新情報\n\n\n\n\n\n\n\n\n\n\n\n\n2021年11月08日\n\n「仕入先サステナビリティガイドライン」を更新しました\n\n\n\n\n\n\n\n\n\n\n2021年10月29日\n\nSustainability Data Bookを更新しました\n\n\n\n\n\n\n\n\n\n\n2021年09月30日\n\n「トヨタ自動車人権方針」を公開しました\n\n\n\n\n\n\n\n\n\n\n2021年09月30日\n\n「外国人労働・強制労働に関する取り組み報告（各国現代奴隷関連法に関する声明）」を公開しました\n\n\n\n\n\n\n\n\n\n\n2021年09月23日\n\n「持続可能な天然ゴム調達方針」を公開しました\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nソーシャルメディア\n\n\n\nFacebook\n\nTOYOTA / トヨタ自動車株式会社\n\n\n\n\n\nTwitter\n\n‎@TOYOTA_PRさんのツイート\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nお知らせ\n\n\n\n\n\n\n車両レスキュー時の取扱い\n\n\n\n\n\n\nタカタ製エアバッグリコールに関する大切なお知らせ\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "\n\n\n\nToyota - Wikipedia\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nToyota\n\nFrom Wikipedia, the free encyclopedia\n\n\n\nJump to navigation\nJump to search\nJapanese multinational automotive manufacturer\nThis article is about the Japanese car manufacturer. For other uses, see Toyota (disambiguation).\n\n\nToyota Motor CorporationHeadquarters in Toyota, JapanNative nameトヨタ自動車株式会社Romanized nameToyota Jidōsha kabushiki gaishaTypePublic (Kabushiki gaisha)Traded asTYO: 7203NAG: 7203NYSE: TMLSE: TYTNikkei 225 component (TYO)TOPIX Core30 component (TYO)ISINJP3633400001IndustryAutomotiveFoundedAugust 28, 1937; 84 years ago (1937-08-28)FounderKiichiro ToyodaHeadquartersToyota City, Aichi, JapanArea servedWorldwideKey peopleTakeshi Uchiyamada (Chairman)Shigeru Hayakawa (Vice chairman)Akio Toyoda (President)Production output 9,472,556 (FY21) 9,213,195 (2020)ServicesBanking, financing, leasingRevenue ¥27,214,594 million  US$256.7 billion (FY21)Operating income ¥2,197,748 million (FY21)Net income ¥2,282,378 million (FY21)Total assets ¥62,267,140 million\n US$562 billion (FY21)Total equity ¥24,288,329 million (FY21)Number of employees 366,283 (FY21)ParentToyota Group through cross ownership:\nToyota Industries cross-owns 8.28%\nSubaru Corporation cross-owns 3.17%\nDenso cross-owns 3.12%\nDivisionsToyotaLexusRanzScion (defunct)SubsidiariesDaihatsuDenso (25%)FAW Toyota (China, 50%)GAC Toyota (China, 50%)Hino MotorsToyota ArgentinaToyota Auto BodyToyota Financial ServicesToyota Motor Corporation AustraliaToyota Motor EuropeToyota Motor East JapanToyota Motor KyushuToyota Kirloskar MotorsToyota Motor Manufacturing Indonesia (95%)Toyota Motor North AmericaToyota Motor PhilippinesToyota Motor Thailand (86%)Toyota South Africa MotorsWebsiteglobal.toyotaFootnotes / referencesFiscal Year 2021 (FY21) is April 1, 2020 to March 31, 2021.References:[1][2]\nToyota Motor Corporation (Japanese: トヨタ自動車株式会社, Hepburn: Toyota Jidōsha kabushiki gaisha, IPA: [toꜜjota], English: /tɔɪˈoʊtə/, commonly known as simply Toyota) is a Japanese multinational automotive manufacturer headquartered in Toyota City, Aichi, Japan. It was founded by Kiichiro Toyoda and incorporated on August 28, 1937 (1937-08-28). Toyota is one of the largest automobile manufacturers in the world, producing about 10 million vehicles per year.\nThe company was as a spinoff of Toyota Industries, a machine maker started by Sakichi Toyoda, Kiichiro's father. Both companies are now part of the Toyota Group, one of the largest conglomerates in the world. While still a department of Toyota Industries, the company developed its first product, the Type A engine in 1934 and its first passenger car  in 1936, the Toyota AA.\nAfter World War II, Toyota benefited from Japan's alliance with the United States to learn from American automakers and other companies, which would give rise to The Toyota Way (a management philosophy) and the Toyota Production System (a lean manufacturing practice) that would transform the small company into a leader in the industry and would be the subject of many academic studies.\nIn the 1960s, Toyota took advantage of a rapidly growing Japanese economy to sell cars to a growing middle-class, leading to the development of the Toyota Corolla, which would go on to become the world’s all-time best-selling automobile. The booming economy also funded an international expansion that would allow Toyota to grow into one of the largest automakers in the world, the largest company in Japan and the ninth-largest company in the world by revenue, as of December 2020[update]. Toyota was the world's first automobile manufacturer to produce more than 10 million vehicles per year, a record set in 2012, when it also reported the production of its 200 millionth vehicle.\nToyota was praised for being a leader in the development and sales of more fuel efficient hybrid electric vehicles, starting with the introduction of the Toyota Prius in 1997. The company now sells more than 40 hybrid vehicle models around the world. However, more recently, the company has also been accused of greenwashing[by whom?] for its skepticism of all-electric vehicles and its focus on the development of hydrogen fuel cell vehicles, like the Toyota Mirai, a technology that is costlier and has fallen far behind electric batteries.[citation needed]\nToyota Motor Corporation produces vehicles under five brands: Daihatsu, Hino, Lexus, Ranz and the namesake Toyota. The company also holds a 20% stake in Subaru Corporation, a 5.1% stake in Mazda, a 4.9% stake in Suzuki, a 4.6% stake in Isuzu, a 3.8% stake in Yamaha Motor Corporation, and a 2.8% stake in Panasonic, as well as stakes in vehicle manufacturing joint-ventures in China (GAC Toyota and FAW Toyota), the Czech Republic (TPCA), India (Toyota Kirloskar) and the United States (MTMUS).\nToyota is listed on the London Stock Exchange, Nagoya Stock Exchange, New York Stock Exchange and on the Tokyo Stock Exchange, where its stock is a component of the Nikkei 225 and TOPIX Core30 indices.\n\nContents\n\n1 History\n\n1.1 1920s–1930s\n1.2 1940s\n1.3 1950s\n1.4 1960s–1980s\n1.5 1980s\n1.6 1990s\n1.7 2000s\n1.8 2010s\n1.9 2020s\n\n\n2 Product line\n\n2.1 SUVs and crossovers\n2.2 Pickup trucks\n2.3 Luxury vehicles\n2.4 Buses\n\n\n3 Technology\n\n3.1 Hybrid electric vehicles\n3.2 Plug-in hybrids\n3.3 Battery electric vehicles\n3.4 Hydrogen fuel-cell\n3.5 Autonomous vehicles\n\n\n4 Motorsports\n5 Non-automotive activities\n\n5.1 Aerospace\n5.2 Pleasure boats\n5.3 Philanthropy\n5.4 Higher education\n5.5 Robotics\n5.6 Agricultural biotechnology\n5.7 Sewing machine brand\n\n\n6 Controversies\n\n6.1 Death from overwork\n6.2 Fines for environmental breaches\n6.3 2009–2011 unintended acceleration recalls\n6.4 Takata airbag recalls\n6.5 June 2010 Chinese labour strike\n6.6 Opposition to California's fuel efficiency standards\n6.7 Greenwashing controversies\n\n6.7.1 Self-charging hybrids\n6.7.2 Misleading marketing\n\n\n\n\n7 Corporate affairs\n\n7.1 Worldwide presence\n\n7.1.1 North America\n7.1.2 Europe/Western Asia\n7.1.3 Australia\n\n\n7.2 Financials\n\n\n8 Company strategy\n\n8.1 The Toyota Way\n8.2 Toyota Production System\n8.3 Logo and branding\n8.4 Sports sponsorships\n\n\n9 See also\n10 References\n11 External links\n\n\nHistory[edit]\nMain article: History of Toyota\n1920s–1930s[edit]\n The mass-produced Toyoda automated loom, displayed at Toyota Museum in Aichi-gun, Japan\nIn 1924, Sakichi Toyoda invented the Toyoda Model G Automatic Loom. The principle of jidoka, which means the machine stops itself when a problem occurs, became later a part of the Toyota Production System. Looms were built on a small production line. In 1929, the patent for the automatic loom was sold to the British company Platt Brothers,[3] generating the starting capital for automobile development.[4]\nThe production of Toyota automobiles was started in 1933 as a division of Toyoda Automatic Loom Works devoted to the production of automobiles under the direction of the founder's son, Kiichiro Toyoda.[5] Its first vehicles were the A1 passenger car and the G1 truck in 1935. The Toyota Motor Company was established as an independent company in 1937.\n\n The 1936 Toyota AA, the first vehicle produced by the company while it was still a department of Toyota Industries\nVehicles were originally sold under the name \"Toyoda\" (トヨダ), from the family name of the company's founder, Kiichirō Toyoda. In April 1936, Toyoda's first passenger car, the Model AA, was completed. The sales price was 3,350 yen, 400 yen cheaper than Ford or GM cars.[6]\nIn September 1936, the company ran a public competition to design a new logo. Of 27,000 entries, the winning entry was the three Japanese katakana letters for \"Toyoda\" in a circle. However, Rizaburo Toyoda, who had married into the family and was not born with that name, preferred \"Toyota\" (トヨタ) because it took eight brush strokes (a lucky number) to write in Japanese, was visually simpler (leaving off the diacritic at the end), and with a voiceless consonant instead of a voiced one (voiced consonants are considered to have a \"murky\" or \"muddy\" sound compared to voiceless consonants, which are \"clear\").\nSince toyoda literally means \"fertile rice paddies\", changing the name also prevented the company from being associated with old-fashioned farming. The newly formed word was trademarked and the company was registered in August 1937 as the Toyota Motor Company.[7][8][9]\nThe Japanese government supported the company by preventing foreign competitors Ford and General Motors from importing automobiles into Japan.[10]\n\n1940s[edit]\nJapan was heavily damaged in World War II and Toyota's plants, which were used for the war effort, were not spared. On 14 August 1945, one day before the surrender of Japan, Toyota's Koromo Plant was bombed by the Allied forces.[11] After the surrender, the U.S.-led occupying forces banned passenger car production in Japan. However, automakers like Toyota were allowed to begin building trucks for civilian use, in an effort to rebuild the nation's infrastructure.[12] The U.S. military also contracted with Toyota to repair its vehicles.[13]\nBy 1947, there was an emerging global Cold War between the Soviet Union and the U.S., who had been allies in World War II. U.S. priorities shifted (the \"Reverse Course\") from punishing and reforming Japan to ensuring internal political stability, rebuilding the economy, and, to an extent, remilitarizing Japan. Under these new policies, in 1949, Japanese automakers were allowed to resume passenger car production, but at the same time, a new economic stabilization program to control inflation plunged the automotive industry into a serious shortage of funds, while many truck owners defaulted on their loans.[14] Ultimately, the Bank of Japan, the central bank of the country, bailed out the company, with demands that the company institute reforms.[15]\n\n1950s[edit]\nAs the 1950s began, Toyota emerged from its financial crisis a smaller company, closing factories and laying off workers. At about the same time, the Korean War broke out, and being located so close to the battlefront, the U.S. Army placed an order for 1,000 trucks from Toyota. The order helped to rapidly improve the struggling company's business performance.[16] In 1950, company executives, including Kiichiro's cousin Eiji Toyoda, took a trip to the United States where they trained at the Ford Motor Company and observed the operations of dozens of U.S. manufacturers.[17] The knowledge they gained during the trip, along with what the company learned making looms, would give rise to The Toyota Way (a management philosophy) and the Toyota Production System (a lean manufacturing practice) that would transform the company into a leader in the manufacturing industry.[18]\n\n Toyopet Crown, the first vehicle fully designed and built by Toyota\nToyota started developing its first full-fledged passenger car, the Toyopet Crown, in January 1952. Prior to the Crown, Toyota had been outsourcing the design and manufacturing of auto bodies, which were then mounted on truck frames made by Toyota.[19] The project was a major test for Toyota, who would need to build bodies and develop a new chassis that would be comfortable, but still stand up to the muddy, slow, unpaved roads common in Japan at the time.[19] The project had been championed for many years by founder Kiichiro Toyoda, who died suddenly on March 27, 1952. The first prototypes were completed in June 1953 and began extensive testing, before the Crown went on sale in August 1955.[20] The car was met with positive reviews from around the world.\nAfter the introduction of the Crown, Toyota began aggressively expanding into the export market. Toyota began shipping Land Cruiser knock-down kits to Latin America in November 1955,[21] sending complete Land Cruisers to Burma (now Myanmar) and the Philippines in 1956 as part of war reparations provided by the Japanese government,[22] establishing a branch in Thailand in June 1957,[23] and shipping Land Cruisers to Australia in August 1957.[22] Toyota established a production facility in Brazil in 1958, the company's first outside of Japan.[24]\nToyota entered the United States market in July 1958, attempting to sell the Toyopet Crown. The company faced problems almost immediately, the Crown was a flop in the U.S. with buyers finding it overpriced and underpowered (because it was designed for the bad roads of Japan, not high-speed performance). In response, exports of the Crown to the United States were suspended in December 1960.[25]\nAfter Kiichiro's death, his cousin Eiji Toyoda would later become the leader of the company. Eiji helped establish the company's first plant independent from the Loom Works plant.[26] He would go on to lead the company for the next two decades.\n\n1960s–1980s[edit]\n Toyota 2000GT (1967–1969)\nAt the start of the 1960s, the Japanese economy was booming, a period that came to be known as the Japanese economic miracle. As the economy grew, so did the income of everyday people, who now could afford to purchase a vehicle. At the same time, the Japanese government heavily invested in improving road infrastructure.[27] To take advantage of the moment, Toyota and other automakers started offering affordable economy cars like the Toyota Corolla, which would go on to become the world’s all-time best-selling automobile.[28][29]\nToyota also found success in the United States in 1965 with the Toyota Corona compact car, which was redesigned specifically for the American market with a more powerful engine. The Corona helped increase U.S. sales of Toyota vehicles to more than 20,000 units in 1966 (a threefold increase) and helped the company become the third-best-selling import brand in the United States by 1967. Toyota’s first manufacturing investment in the United States came in 1972 when the company struck a deal with Atlas Fabricators, to produce truck beds in Long Beach, in an effort to avoid the 25% \"chicken tax\" on imported light trucks. By importing the truck as an incomplete chassis cab (the truck without a bed), the vehicle only faced a 4% tariff.[30] Once in the United States, Atlas would build the truck beds and attach them to the trucks. The partnership was successful and two years later, Toyota purchased Atlas.[31]\nThe energy crisis of the 1970s was a major turning point in the American auto industry. Before the crisis, large and heavy vehicles with powerful but inefficient engines were common. But in the years after, consumers started demanding high-quality and fuel-efficient small cars. Domestic automakers, in the midst of their malaise era, struggled to build these cars profitably, but foreign automakers like Toyota were well positioned. This, along with growing anti-Japanese sentiment, prompted the U.S. Congress to consider import restrictions to protect the domestic auto industry.\nThe 1960s also saw the slight opening of the Japanese auto market to foreign companies. In an effort to strengthen Japan's auto industry ahead of the market opening, Toyota purchased stakes in other Japanese automakers. That included a stake in Hino Motors, a manufacturer of large commercial trucks, buses and diesel engines, along with a 16.8 percent stake in Daihatsu, a manufacturer of kei cars, the smallest highway-legal passenger vehicles sold in Japan.[32] That would begin what would become a long-standing partnership between Toyota and the two companies. As part of the partnership, Daihatsu would supply kei cars for Toyota to sell and to a lesser extent Toyota would supply full-sized cars for Daihatsu to sell (a process known as rebadging), allowing both companies to sell a full line-up of vehicles.\n\n1980s[edit]\n By the 1980s, the Toyota Corolla was one of the most popular cars in the world and would go on to become the world’s all-time best-selling automobile\nAfter the successes of the 1970s, and the threats of import restrictions, Toyota started making additional investments in the North American market in the 1980s. In 1981, Japan agreed to voluntary export restraints, which limited the number of vehicles the nation would send to the United States each year, leading Toyota to establish assembly plants in North America. The U.S. government also closed the loophole that allowed Toyota to pay lower taxes by building truck beds in America.\nAlso in 1981, Eiji Toyoda stepped down as president and assumed the title of chairman. He was succeeded as president by Shoichiro Toyoda, the son of the company's founder.[26] Within months, Shoichiro started to merge Toyota's sales and production organizations, and in 1982 the combined companies became the Toyota Motor Corporation. The two groups were described as \"oil and water\" and it took years of leadership from Shoichiro to successfully combine them into one organization.[33]\nEfforts to open a Toyota assembly plant in the United States started in 1980, with the company proposing a joint-venture with the Ford Motor Company. Those talks broke down in July 1981.[34] Eventually in 1984, the company struck a deal with General Motors (GM) to establish a joint-venture vehicle manufacturing plant called NUMMI (New United Motor Manufacturing, Inc.) in Fremont, California.[35] GM saw the joint venture as a way to get access to a quality small car and an opportunity to learn about The Toyota Way and the Toyota Production System. For Toyota, the factory gave the company its first manufacturing base in North America allowing it to avoid any future tariffs on imported vehicles and saw GM as a partner who could show them how to navigate the American labor environment. The plant would be led by Tatsuro Toyoda, the younger brother of company president Shoichiro Toyoda.[36] The first Toyota assembled in America, a white Corolla, rolled off the line at NUMMI on October 7, 1986.[37]\nToyota received its first Japanese Quality Control Award at the start of the 1980s and began participating in a wide variety of motorsports. Conservative Toyota held on to rear-wheel-drive designs for longer than most; while a clear first in overall production they were only third in production of front-wheel-drive cars in 1983, behind Nissan and Honda. In part due to this, Nissan's Sunny managed to squeeze by the Corolla in numbers built that year.[38]\n\n The Lexus LS 400 went on sale in May 1989 and was seen as being largely responsible for the successful launch of Lexus\nBefore the decade was out, Toyota introduced Lexus, a new division that was formed to market and service luxury vehicles in international markets. Prior to the debut of Lexus, Toyota's two existing flagship models, the Crown and Century, both catered exclusively for the Japanese market and had little global appeal that could compete with international luxury brands such as Mercedes-Benz, BMW and Jaguar. The company had been developing the brand and vehicles in secret since August 1983, at a cost of over US$1 billion.[39][40] The LS 400 flagship full-size sedan debuted in 1989 to strong sales, and was largely responsible for the successful launch of the Lexus marque.\n\n1990s[edit]\n Toyota Supra (JZA80) is one of the most recognized Japanese sports cars\n Toyota Prius, first generation (NHW10 1997–2000)\nIn the 1990s, Toyota began to branch out from producing mostly compact cars by adding many larger and more luxurious vehicles to its lineup, including a full-sized pickup, the T100 (and later the Tundra), several lines of SUVs, a sport version of the Camry, known as the Camry Solara. They would also launch newer iterations of their sports cars, namely the MR2, Celica, and Supra during this era.\nDecember 1997 saw the introduction of the first-generation Toyota Prius, the first mass-produced gasoline-electric hybrid car.[41] The vehicle would be produced exclusively for the Japanese market for the first two years.\nWith a major presence in Europe, due to the success of Toyota Team Europe racing, the corporation decided to set up Toyota Motor Europe Marketing and Engineering, TMME, to help market vehicles in the continent. Two years later, Toyota set up a base in the United Kingdom, TMUK, as the company's cars had become very popular among British drivers. Bases in Indiana, Virginia, and Tianjin were also set up.\nToyota also increased its ownership of Daihatsu during this period. In 1995, Toyota increased its shareholding in the company to 33.4 percent, giving Toyota the ability to veto shareholder resolutions at the annual meeting.[32] In 1998, Toyota increased its holding in the company to 51.2 percent, becoming the majority shareholder.[42]\nOn September 29, 1999, the company decided to list itself on the New York and London Stock Exchanges.\nThe later half of the 1990s would also see the Toyoda brothers step back from the company their father had founded. In 1992, Shoichiro Toyoda would shift to become chairman, allowing his brother Tatsuro to become president, a job he held until his retirement in 1995.[36] Shoichiro would step down as Chairman in 1999. Both would retain honorary advisory roles in the company. Hiroshi Okuda would lead the company as President from 1995 until 1999 when he became Chairman and the President's office would be filled by Fujio Cho.\n\n2000s[edit]\nIn 2001, Toyo Trust and Banking, which was part of the Toyota Motor Corporation, merged with Sanwa Bank and Tokai Bank to form UFJ Bank (United Financial of Japan Bank). UFJ was one of the largest shareholders of Toyota and the Chairman of Toyota was a director on the UFJ board. The bank would later be accused by Japan's government of corruption, making bad loans to alleged Yakuza crime syndicates, and blocking Financial Service Agency inspections.[43] After the scandal broke, three UFJ executives were indicted and the bank was listed among Fortune Magazine's largest money-losing corporations in the world.[44] On October 1, 2005 the beleaguered bank merged with the Mitsubishi Tokyo Financial Group to form the Mitsubishi UFJ Financial Group.\nIn August 2000, exports began of the Prius.[41] In 2001, Toyota acquired its long time partner, truck and bus manufacturer Hino Motors. In 2002, Toyota entered Formula One competition and established a manufacturing joint venture in France with French automakers Citroën and Peugeot. A youth-oriented marque for North America, Scion, was introduced in 2003. Toyota ranked eighth on Forbes 2000 list of the world's leading companies for the year 2005.[45] Also in 2005, Fujio Cho would shift to become chairman of Toyota and would be replaced as president by Katsuaki Watanabe.\nIn 2007, Toyota released an update of its full-sized truck, the Tundra, produced in two American factories, one in Texas and one in Indiana. Motor Trend named the Tundra \"Truck of the Year\", and the 2007 Toyota Camry \"Car of the Year\" for 2007. It also began the construction of two new factories, one in Woodstock, Ontario, Canada, and the other in Blue Springs, Mississippi, USA.\nThe company was number one in global automobile sales for the first quarter of 2008.[46]\nToyota was hit by the global financial crisis of 2008 as it was forced in December 2008 to forecast its first annual loss in 70 years.[47] In January 2009, it announced the closure of all of its Japanese plants for 11 days to reduce output and stocks of unsold vehicles.[48]\nBetween 2009 and 2011, Toyota conducted recalls of millions of vehicles after reports that several drivers experienced unintended acceleration. The recalls were to prevent a front driver's side floor mat from sliding into the foot pedal well, causing the pedals to become trapped and to correct the possible mechanical sticking of the accelerator pedal.[49] At least 37 were killed in crashes allegedly related to unintended acceleration,[50] approximately 9 million cars and trucks were recalled,[51] Toyota was sued for personal injuries and wrongful deaths,[52] paid US$1 billion to settle a class action lawsuit to compensate owners for lost resale value,[53] and paid a US$1.2 billion criminal penalty to the United States government over accusations that it had intentionally hid information about safety defects and had made deceptive statements to protect its brand image.[54]\n\n Akio Toyoda, was named President of Toyota in 2009, pictured in 2011\nAmid the unintended acceleration scandal, Katsuaki Watanabe stepped down as company president. He was replaced by Akio Toyoda, grandson of company founder Kiichiro Toyoda, on June 23, 2009. Akio had been with Toyota since 1984, working jobs in production, marketing and product development, and took a seat on the board of directors in 2000.[55] Akio's promotion by the board marked the return of a member of the Toyoda family to the top leadership role for the first time since 1999.[56]\n\n2010s[edit]\nIn 2011, Toyota, along with large parts of the Japanese automotive industry, suffered from a series of natural disasters. The 2011 Tōhoku earthquake and tsunami led to a severe disruption of the supplier base and a drop in production and exports.[57][58] Severe flooding during the 2011 monsoon season in Thailand affected Japanese automakers that had chosen Thailand as a production base. Toyota is estimated to have lost production of 150,000 units to the tsunami and production of 240,000 units to the floods.\nOn February 10, 2014, it was announced that Toyota would cease manufacturing vehicles and engines in Australia by the end of 2017.[59][60] The decision was based on the unfavourable Australian dollar making exports not viable, the high cost of local manufacture, and the high amount of competition in a relatively small local market.[60] The company planned to consolidate its corporate functions in Melbourne by the end of 2017, and retain its Altona plant for other functions. The workforce is expected to be reduced from 3,900 to 1,300.[61] Both Ford Motor Company and General Motors (Holden) followed suit, ending Australian production in 2016 and 2017 respectively.\nThe automaker narrowly topped global sales for the first half of 2014, selling 5.1 million vehicles in the six months ending June 30, 2014, an increase of 3.8% on the same period the previous year. Volkswagen AG, which recorded sales of 5.07 million vehicles, was close behind.[62]\nIn August 2014, Toyota announced it would be cutting its spare-parts prices in China by up to 35%. The company admitted the move was in response to a probe foreshadowed earlier in the month by China's National Development and Reform Commission of Toyota's Lexus spare-parts policies, as part of an industry-wide investigation into what the Chinese regulator considers exorbitantly high prices being charged by automakers for spare parts and after-sales servicing.[63]\nIn November 2015, the company announced that it would invest US$1 billion over the next 5 years into artificial intelligence and robotics research.[64] In 2016, Toyota invested in Uber.[65] In 2020, a corporate governance report showed that Toyota owns 10.25 million shares of Uber, which was valued at $292.46 million as of March 30, 2020. According to Reuters, this was roughly 0.6 per cent of Uber's outstanding shares.[66]\nIn March 2016, Toyota partnered with Yanmar to create a fiberglass pleasure boat using Yanmar outboard marine diesel engines or Toyota inboard engines.[67]\nIn August 2016, the company purchased all remaining assets of Daihatsu, making the manufacturer of small cars a wholly owned subsidiary of Toyota.[68]\nOn August 27, 2018, Toyota announced an investment of US$500 million in Uber's autonomous cars.[69]\n\n2020s[edit]\nBy 2020, Toyota reclaimed its position as the largest automaker in the world, surpassing Volkswagen.[70] It sold 9.528 million vehicles globally despite an 11.3% drop in sales due to the COVID-19 pandemic.[70]  This includes subsidiaries Daihatsu and Hino Motors.[70][71]\nOn April 2, 2020, BYD and Toyota announced a new joint venture between the two companies called BYD Toyota EV Technology Co., Ltd., with the aim of \"developing BEVs (Battery Electric Vehicles) that appeal to customers.\"[72]\nIn March 2021, Toyota, its subsidiary Hino, and Isuzu announced the creation of a strategic partnership between the three companies. Toyota acquired a 4.6% stake in Isuzu while the latter plans to acquire Toyota shares for an equivalent value. The three companies said they would form a new joint venture by April called Commercial Japan Partnership Technologies Corporation with the aim of developing fuel cell and electric light trucks. Toyota would own an 80% stake in the venture while Hino and Isuzu would own 10% each.[73]\nIn April 2021, Toyota said that it will buy Lyft's self-driving technology unit for $550 million and merge it with its newly created Woven Planet automation division.[74]\nIn June 2021, the company defended its donations to United States Republican lawmakers after they voted against certifying the results of the 2020 presidential election, saying it did not believe it was \"appropriate to judge members of Congress\" for that one vote.[75] A report by Axios found that Toyota was the top donor to 2020 election objectors, by a substantial margin.[76] The company then reversed course in July 2021 and ceased donations to election objectors, releasing a statement saying it understood that its PAC's donations to those objectors, which far outpaced those of any other company, \"troubled some stakeholders.\"[77]\nToyota will increase its software engineer intake to around 40% to 50% of all technical hires from the second quarter of 2022, the move plans to address a transformation to so-called CASE — connected, autonomous, shared and electric — technologies in an environment of intensifying global competition.[78]\nIn 2021, Toyota told some of its suppliers to increase their semiconductor inventory levels from the conventional three months to five months in response to the COVID-19 chip shortage.[79] The \"just-in-time\" supply chain in which parts are only delivered when necessary, had already been revised after the March 11, 2011 earthquake and tsunami in Japan, lifting inventories across the entire procurement network.[79] The time it takes Toyota to turn over its inventory increased by around 40% during the past ten years, to 36.36 days as of March 2021[update].[79]\n\nProduct line[edit]\nFurther information: List of Toyota vehicles\nAs of 2009, Toyota officially lists approximately 70 different models sold under its namesake brand, including sedans, coupes, vans, trucks, hybrids, and crossovers.[80] Many of these models are produced as passenger sedans, which range from the subcompact Toyota Yaris, compact Corolla, to mid-size Camry and full-size Avalon.[80] Minivans include the Innova, Alphard/Vellfire, Sienna, and others.[80] Several small cars, such as the xB and tC, were sold under the Scion brand.[80]\n\nSUVs and crossovers[edit]\nToyota C-HRToyota RAV4\nToyota SUV and crossover line-up grew quickly in the late 2010s to 2020s due to the market shift to SUVs. Toyota crossovers range from the subcompact Yaris Cross and CH-R, compact Corolla Cross and RAV4, to midsize Harrier/Venza and Kluger/Highlander.[80] Other crossovers include the Raize, Urban Cruiser.[81] Toyota SUVs range from the midsize Fortuner to full-size Land Cruiser.[80] Other SUVs include the Rush, Prado, FJ Cruiser, 4Runner, and Sequoia.[80]\n\n\nPickup trucks[edit]\nToyota Hilux (global)Toyota Tacoma (US/Canada)\nToyota first entered the pickup truck market in 1947 with the SB that was only sold in Japan and limited Asian markets. It was followed in 1954 by the RK (renamed in 1959 as the Stout) and in 1968 by the compact Hilux. With continued refinement, the Hilux (simply known as the Pickup in some markets) became famous for being extremely durable and reliable.[82] Extended cab and crew cab versions were eventually added, and Toyota continues to produce them today under various names depending on the market in various cab lengths, with gasoline or diesel engines, and 2WD and 4WD versions.\nIn the United States, the Hilux became a major model for the company, leading the company to launch the Tacoma in 1995.[83] The Tacoma was based on the Hilux, but with a design intended to better suit the needs of US consumers who often use pickup trucks as personal vehicles. The design was a success and the Tacoma became the best-selling compact pickup in America.\nAfter the success of its compact Hilux pickups in the US, Toyota decided to enter the full-size pickup market, which was traditionally dominated by domestic automakers. The company introduced the T100 for the 1993 US model year. The T100 had a full-size 8-foot (2.4 m) long bed, but suspension and engine characteristics were similar to that of a compact pickup. Sales were disappointing and the T100 was criticized for having a small V6 engine (especially compared to the V8 engines common in American full-size trucks), lacking an extended-cab version, being too small, and too expensive (because of the 25% tariff on imported trucks).[84] In 1995, Toyota added the more powerful V6 engine from the new Tacoma to the T100 and also added an extended cab version.[84] In 1999, Toyota replaced the T100 with the larger Tundra, which would be built in the US with a V8 engine and styling that more closely matched other American full-size trucks.[85]\n\nLuxury vehicles[edit]\nSee also: Lexus\n Toyota Crown RS (Fifteenth generation, S220; 2018)\nIn the Japanese home market, Toyota has two flagship models: the Crown premium sedan and the Century limousine.\nIn the 1980s, Toyota wanted to expand its luxury car offerings but realized that existing Japanese-market flagship models had little global appeal and could not compete with established brands such as Mercedes-Benz, BMW and Jaguar or the Acura and Infiniti marquees being launched by Japanese competitors.\nBefore the decade was out, Toyota introduced Lexus, a new division that was formed to market and service luxury vehicles in markets outside of Japan. The company developed the brand and its vehicles in secret since August 1983, at a cost of over US$1 billion.[39][40] The Lexus LS flagship full-size sedan debuted in 1989 to strong sales, and was largely responsible for the successful launch of the Lexus marque. Subsequently, the division added sedan, coupé, convertible and SUV models.\nThe Lexus brand was introduced to the Japanese market in 2005, previously all vehicles marketed internationally as Lexus from 1989 to 2005 were released in Japan under the Toyota marque.\n\nBuses[edit]\nThe Toyota Coaster is a minibus introduced in 1969 that seats 17 passengers. The Coaster is widely used in Japan, Singapore, Hong Kong, and Australia, but also in the developing world for minibus operators in Africa, the Middle East, South Asia, the Caribbean, and South America to operate as public transportation.\n\nTechnology[edit]\nHybrid electric vehicles[edit]\nMain articles: Hybrid Synergy Drive, Hybrid electric vehicle, and Toyota Prius\n The Toyota Prius, flagship of Toyota's hybrid technology, is the world's best-selling hybrid car\nToyota is the world's leader in sales of hybrid electric vehicles, one of the largest companies to encourage the mass-market adoption of hybrid vehicles across the globe, and the first to commercially mass-produce and sell such vehicles, with the introduction of the Toyota Prius in 1997.[86][87] The company's series hybrid technology is called Hybrid Synergy Drive, and it was later applied to many vehicles in Toyota's product lineup, starting first with the Camry and the technology was also brought to the luxury Lexus division.\nAs of January 2020[update], Toyota Motor Corporation sells 44 Toyota and Lexus hybrid passenger car models in over 90 countries and regions around the world, and the carmaker has sold over 15 million hybrid vehicles since 1997.[88] The Prius family is the world's top-selling hybrid gasoline-electric vehicle nameplate with almost 4 million units sold worldwide as of January 2017.[88]\nBesides the Prius, Toyota's current hybrid lineup includes the Alphard/Vellfire/Crown Vellfire, Avalon, Aqua/Prius c, Camry, C-HR/IZOA, Corolla/Levin, Corolla Cross, Crown, Harrier/Venza, Highlander/Kluger/Crown Kluger, Noah/Voxy/Esquire, RAV4/Wildlander, Sienna, Sienta, Tundra, and Yaris. The Lexus current hybrid lineup consists of the ES, IS, LC, LM, LS, NX, RC, RX, and UX.\n\nPlug-in hybrids[edit]\nMain articles: Toyota Prius Plug-in Hybrid and Toyota RAV4 Prime\n Second-generation Toyota Prius Plug-in Hybrid\nThe Prius Plug-In Hybrid Concept was exhibited in late 2009, and shortly after, a global demonstration program involving 600 pre-production test cars began. The vehicles were leased to fleet and government customers, and were equipped with data tracking devices to allow Toyota to monitor the car's performance. The vehicle was based on the third-generation Toyota Prius and outfitted with two additional lithium-ion batteries beyond the normal hybrid battery pack.[89] The additional batteries were used to operate the car with minimal use of the internal combustion engine until they are depleted, at which point they are disengaged from the system. They are not used in tandem with the main hybrid battery pack.\nAfter the conclusion of the demonstration program, the production version of the Prius Plug-in Hybrid was unveiled in September 2011. The production Prius Plug-in had a maximum electric-only speed of 100 km/h (62 mph), and the United States Environmental Protection Agency (EPA) rated the vehicle as having an range of 18 kilometres (11 mi) in blended mode (mostly electric, but supplemented by the internal combustion engine).[90] Toyota ultimately only did a small production run with 75,400 vehicles being produced between 2012 and 2016.[91]\nThe second-generation Prius Plug-in (renamed the Prius Prime in the US) was unveiled in early 2016.[92] Unlike the prior generation, where the plug-in battery was limited by being added to the existing Prius, this model would be developed in tandem with the fourth-generation Prius, allowing Toyota to increase the range to 40 kilometres (25 mi), with a top speed of 135 km/h (84 mph), without needing the assistance of the internal combustion engine.[93] The second-generation Prius Plug-in went on sale starting in late 2016, with Toyota expecting to sell up to 60,000 units globally per year.[94]\nA second plug-in hybrid model, the Toyota RAV4 PHV (RAV4 Prime in the US) was unveiled in December 2019. The vehicle has an EPA-estimated 68 kilometres (42 mi) of all-electric range and generates a combined 225 kilowatts (302 hp), enabling it to be Toyota's second fastest car currently in production (behind the GR Supra 3.0 sports car).[95] Sales started in mid-2020.\n\nBattery electric vehicles[edit]\n Toyota bZ4X concept\nToyota has been slow to adopt battery electric vehicles to its lineup, and has been publicly skeptical about battery-electric technology, and has lobbied against government mandates to transition to zero tailpipe emission vehicles.[96]\nToyota's first all-electric vehicle was made in response to one of those government mandates. The company created the first generation Toyota RAV4 EV after the California Air Resources Board mandated in the late 1990s that every automaker offer a zero-emissions vehicle.[97][98] A total of 1,484 were leased and/or sold in California from 1997 to 2003, when the state dropped its mandate under legal pressure from lawsuits filed by automakers. At the lessees' request, many units were sold after the vehicle was discontinued.[99]\nA second generation of the RAV4 EV was developed in 2010 as part of a deal with Tesla. The production version was unveiled in August 2012, using battery pack, electronics and powertrain components from the Tesla Model S.[100] The RAV4 EV had a limited production run which resulted in just under 3,000 vehicles being produced, before it was discontinued in 2014.[101][102] According to Bloomberg News, the partnership between Tesla and Toyota was \"marred by clashes between engineers\".[103]\nStarting in 2009, Toyota introduced three generations of concept electric vehicles called the FT-EV built on a modified Toyota iQ platform. In late-2012, the company announced plans build a production version of the car called the Toyota iQ EV (Scion iQ EV in the US, Toyota eQ in Japan),[104] but ultimately production was cut back to 100 cars for special fleet use in Japan and the U.S. only.[105]\nIn late 2012, Toyota announced that it would back away from fully electric vehicles, after producing less than 5,000. At the time, the company's vice chairman, Takeshi Uchiyamada, said: \"The current capabilities of electric vehicles do not meet society's needs, whether it may be the distance the cars can run, or the costs, or how it takes a long time to charge.\" Toyota's emphasis would be re-focused on the hybrids and hydrogen fuel cell vehicles.[105][22] These early electric vehicles are widely considered as compliance cars, meaning that it is developed to meet California's zero-emissions standards for automakers.[106]\nIn April 2019, Toyota introduced the C-HR EV, its first mass-produced pure electric model in China along with an identical twin called the IZOA EV.[107] It went on sale in April 2020 and May 2020 respectively. Nikkei reported in October 2020 that Toyota had only sold less than 2,000 units in the first eight months of the year.[108]\nToyota introduced the C+pod in late 2020, a 2-seater kei car with an estimated range of 100 kilometres (62 mi) and a top speed of 60 kilometres per hour (37 mph).[109][110]\nIn April 2021, Toyota revealed the bZ4X, an electric crossover SUV which will be the first vehicle built on a dedicated electric platform called e-TNGA when it goes on sale in mid-2022.[111] It is the first model of the bZ (\"beyond Zero\") series of battery electric vehicles.[112] The company has also stated that there will be seven \"bZ\" models to be launched globally out of 15 BEV models by 2025.[113]\nToyota has been developing solid-state batteries in partnership with Panasonic, in which the company has more than a thousand patents covering solid-state batteries by late 2020.[114] The technology has been implemented on the Toyota LQ concept. Toyota hopes the technology could increase efficiency of battery electric vehicles by 30 percent, which in turn would reduce battery costs by the same amount.[115]\n\nHydrogen fuel-cell[edit]\n The Toyota Mirai fuel-cell vehicle\n The Toyota SORA fuel-cell bus\nSee also: Toyota Mirai\nIn 2002, Toyota began a development and demonstration program to test the Toyota FCHV, a hybrid hydrogen fuel cell vehicle based on the Toyota Highlander production SUV. Toyota also built a FCHV bus based on the Hino Blue Ribbon City low-floor bus.[116][117] Toyota has built several prototypes/concepts of the FCHV since 1997, including the Toyota FCHV-1, FCHV-2, FCHV-3, FCHV-4, and Toyota FCHV-adv. The Toyota FCV-R fuel cell concept car was unveiled at the 2011 Tokyo Motor Show. The FCV-R sedan seats four and has a fuel cell stack including a 70 MPa high-pressure hydrogen tank, which can deliver a range of 435 mi (700 km) under the Japanese JC08 test cycle. Toyota said the car was planned for launch in about 2015.[118]\nIn August 2012, Toyota announced its plans to start retail sales of a hydrogen fuel-cell sedan in California in 2015. Toyota expects to become a leader in this technology.[119] The prototype of its first hydrogen fuel cell vehicle will be exhibited at the November 2013 Tokyo Motor Show, and in the United States at the January 2014 Consumer Electronics Show.[120]\nToyota's first hydrogen fuel-cell vehicles to be sold commercially, the Toyota Mirai (Japanese for \"future\"), was unveiled at the November 2014 Los Angeles Auto Show.[121] In January 2015, it was announced that production of the Mirai fuel cell vehicle would increase from 700 units in 2015 to approximately 2,000 in 2016 and 3,000 in 2017.[122] Sales in Japan began on December 15, 2014, at a price of ¥6,700,000 (~US$57,400). The Japanese government plans to support the commercialization of fuel-cell vehicles with a subsidy of ¥2,000,000 (~US$19,600).[123] Retail sales in the U.S. began in August 2015 at a price of US$57,500 before any government incentives. Initially, the Mirai will only be available in California.[124][125] The market release in Europe is slated for September 2015, and initially will be available only in the UK, Germany, and Denmark, followed by other countries in 2017. Pricing in Germany starts at €60,000 (~US$75,140) plus VAT (€78,540).[126]\nIn 2015, Toyota released 5,600 patents for free use until 2020, hoping to promote global development of hydrogen fuel-cell technology.[127][128][129][130]\n\nAutonomous vehicles[edit]\n Toyota e-Palette\nToyota is regarded as being behind in smart car technology and in need of innovation.[131] Although the company Toyota unveiled its first self-driving test vehicle in 2017, and has been developing its own self-driving technology named \"Chauffeur\" (intended for full self-driving) and \"Guardian\" (a driver assist system), neither of these has been introduced into any production vehicles.[132]\nThe company had setup a large research and development operation by 2018, spending almost US$4 billion to start an autonomous vehicle research institute in California's Silicon Valley[131] and another ¥300 billion on a similar research institute in Tokyo that would partner with fellow Toyota Group companies and automotive suppliers Aisin Seiki and Denso.[133][134]\nToyota has also been collaborating with autonomous vehicle technology developers and, in some cases, purchasing the companies. Toyota has acquired the autonomous vehicle division of ride-hailing service Lyft for $550 million,[135] invested a total of US$1 billion in competing ride-hailing service Uber's self-driving vehicle division,[136][137] invested $400 million in autonomous vehicle technology company Pony.ai,[138] and announced a partnership with Chinese electronics e-commerce company Cogobuy to build a \"Smart Car Ecosystem.\"[139]\nIn December 2020 Toyota showcased the 20-passenger \"e-Palette\" shared autonomous vehicle, which was used at the 2021 Tokyo Olympic Games.[140][141]  Toyota has announced it intends to have the vehicle available for commercial applications before 2025.[142]\nSince February 2021, Toyota has been building the sensor-laden “Woven City\" which it calls a \"175-acre high tech, sensor-laden metropolis\" at the foot of Mt. Fuji. When completed in 2024 the Woven City will be used to run tests on autonomous vehicles for deliveries, transport and mobile shops with the city’s residents participating in the living laboratory experiment.[143][144]\n\nMotorsports[edit]\n The Toyota TS050 Hybrid that won the 2018 24 Hours of Le Mans, preserved with dirt from the race\nMain article: Toyota in motorsport\nSee also: Toyota Gazoo Racing and Toyota Racing Development\nToyota has been involved in many global motorsports series, providing vehicles, engines and other auto parts under both the Toyota and Lexus brands.\nToyota Gazoo Racing (GR) is responsible for participation in many of the world's major motorsports contests. Toyota Gazoo Racing Europe competes in the European Le Mans Series, the FIA World Endurance Championship and the World Rally Championship (Toyota Gazoo Racing WRT team). Toyota Gazoo Racing South Africa competes in the Dakar Rally. Between 2002 and 2009, the Toyota Racing team competed in Formula One. Toyota won the 2018 24 Hours of Le Mans, 2019 24 Hours of Le Mans, and 2020 24 Hours of Le Mans with a Toyota TS050 Hybrid, and 2021 24 Hours of Le Mans with a Toyota GR010 Hybrid.\nToyota Racing Development USA (TRD USA) is responsible for participation in major motorsports contests in the United States including NASCAR, NHRA, Indy Racing League and Formula Drift.\nToyota also makes engines and other auto parts for other Japanese motorsports including Super Formula, Super GT, Formula 3, and Toyota Racing Series.\n\nNon-automotive activities[edit]\nAerospace[edit]\nToyota is a minority shareholder in Mitsubishi Aircraft Corporation, having invested US$67.2 million in the new venture which will produce the Mitsubishi Regional Jet, slated for first deliveries in 2017.[145] Toyota has also studied participation in the general aviation market and contracted with Scaled Composites to produce a proof of concept aircraft, the TAA-1, in 2002.[146][147]\n\nPleasure boats[edit]\nIn 1997, building on a previous partnership with Yamaha Marine, Toyota created \"Toyota Marine\",[148] building private ownership motorboats, currently sold only in Japan. A small network in Japan sells the luxury craft at 54 locations, called the \"Toyota Ponam\" series, and in 2017, a boat was labeled under the Lexus brand name starting May 26, 2017.[149]\n\nPhilanthropy[edit]\n The Toyota Municipal Museum of Art in Aichi, sponsored by the manufacturer\nToyota supports a variety of philanthropic work in areas such as education, conservation, safety, and disaster relief.\nSome of the organizations that Toyota has worked with in the US include the American Red Cross, the Boys and Girls Club, Leaders in Environmental Action for the Future (LEAF), and the National Center for Family Literacy.[150]\nThe Toyota USA Foundation exists to support education in the areas of science, technology, engineering, and mathematics.[151]\nIn addition, Toyota works with nonprofits to improve their processes and operations such as the Food Bank For New York City.[152][153]\nToyota also supports a variety of work in Japan.[154]\nThe Toyota Foundation takes a global perspective providing grants in the three areas of human and natural environments, social welfare, and education and culture.[155]\n\nHigher education[edit]\nToyota established the Toyota Technological Institute in 1981, as Sakichi Toyoda had planned to establish a university as soon as he and Toyota became successful. Toyota Technological Institute founded the Toyota Technological Institute at Chicago in 2003. Toyota is supporter of the Toyota Driving Expectations Program, Toyota Youth for Understanding Summer Exchange Scholarship Program, Toyota International Teacher Program, Toyota TAPESTRY, Toyota Community Scholars (scholarship for high school students), United States Hispanic Chamber of Commerce Internship Program, and Toyota Funded Scholarship.[156] It has contributed to a number of local education and scholarship programs for the University of Kentucky, Indiana, and others.[156]\n\nRobotics[edit]\nMain article: Toyota Partner Robot\n Toyota trumpet-playing robot\nIn 2004, Toyota showcased its trumpet-playing robot.[157] Toyota has been developing multitask robots destined for elderly care, manufacturing, and entertainment. A specific example of Toyota's involvement in robotics for the elderly is the Brain Machine Interface. Designed for use with wheelchairs, it \"allows a person to control an electric wheelchair accurately, almost in real-time\", with his or her mind.[158] The thought controls allow the wheelchair to go left, right, and forward with a delay between thought and movement of just 125 milliseconds.[158] Toyota also played a part in the development of Kirobo, a 'robotic astronaut'.\nIn 2017, the company introduced T-HR3, a humanoid robot with the ability to be remotely controlled. The robot can copy the motions of a connected person. The 2017 version used wires for the connection but the 2018 version used 5G from a distance up to 10 km.[159][160]\n\nAgricultural biotechnology[edit]\nToyota invests in several small start-up businesses and partnerships in biotechnology, including:\n\nP.T. Toyota Bio Indonesia in Lampung, Indonesia\nAustralian Afforestation Pty. Ltd. in Western Australia and Southern Australia\nToyota Floritech Co., Ltd. in Rokkasho-Mura, Kamikita District, Aomori Prefecture\nSichuan Toyota Nitan Development Co., Ltd. in Sichuan, China\nToyota Roof Garden Corporation in Miyoshi-Cho, Aichi Prefecture\nSewing machine brand[edit]\nAisin, another member of the Toyota Group of companies, uses the same Toyota wordmark logo to market its home-use sewing machines. Aisin was founded by Kiichiro Toyoda after he founded the Toyota Motor Corporation. According to Aisin, he was so pleased with the first sewing machine, he decided to apply the same Toyota branding as his auto business, despite the companies being independent from each other.[161]\n\nControversies[edit]\nDeath from overwork[edit]\nSee also: Karōshi\nOn February 9, 2002, Kenichi Uchino, aged 30 years, a quality control manager, collapsed then died at work.[162][163] On January 2, 2006, an unnamed chief engineer of the Camry Hybrid, aged 45 years, died from heart failure in his bed.[162]\n\nFines for environmental breaches[edit]\nIn 2003, Toyota was fined $34M for violating the United States Clean Air Act.[164]\nIn January 2021, Toyota was fined $180M for violating U.S. emissions regulations from 2005 to 2015.[165][166][167] At the time, this was the biggest civil penalty ever levied for violating United States Environmental Protection Agency emission reporting requirements.[165][166]\n\n2009–2011 unintended acceleration recalls[edit]\nSee also: 2009–2011 Toyota vehicle recalls\nBetween 2009 and 2011 Toyota, under pressure from the U.S. National Highway Traffic Safety Administration (NHTSA), conducted recalls of millions of vehicles after reports that several drivers experienced unintended acceleration. The first recall, in November 2009, was to prevent a front driver's side floor mat from sliding into the foot pedal well, causing the pedals to become trapped. The second recall, in January 2010, was begun after some crashes were shown not to have been caused by floor mats and may be caused by possible mechanical sticking of the accelerator pedal.[49] Worldwide, approximately 9 million cars and trucks were impacted by the recalls.[51]\nNHTSA received reports of a total of 37 deaths allegedly related to unintended acceleration, although an exact number was never verified.[50] As a result of the problems, Toyota faced nearly 100 lawsuits from the families of those killed, drivers who were injured, vehicle owners who lost resale value, and investors who saw a drop in the value of their shares. While most of the personal injury and wrongful death lawsuits were settled confidentially,[52] Toyota did spend more than US$1 billion to settle a class action lawsuit to compensate owners for lost resale value,[53] and the company agreed to pay a US$1.2 billion criminal penalty to the United States government over accusations that it had intentionally hid information about safety defects from the public and had made deceptive statements to protect its brand image. The penalty was the largest ever levied against a car company.[54]\n\nTakata airbag recalls[edit]\nSee also: Takata airbag recalls\nToyota, like nearly every other automobile manufacturer, was impacted by the recall of faulty airbag inflators made by Takata. The inflators can explode, shooting metal fragments into the vehicle cabin. Millions of vehicles produced between 2000 and 2014 were impacted by the recall, with some needing multiple repairs.[168][169]\n\nJune 2010 Chinese labour strike[edit]\nOn June 21, 2010, a Chinese labor strike happened in Tianjin Toyoda Gosei Co, Tianjin. Toyoda Gosei Co supplies parts to Tianjin FAW Toyota Motor Co.[170]\n\nOpposition to California's fuel efficiency standards[edit]\nIn October 2019, Toyota backed the Trump Administration's proposal that federal authority should override California's ability to set its own emissions standards for automobiles. The proposal would reduce California's 2025 fuel efficiency standard from about 54.5 to 37 MPG.[171] This shift by Toyota away from fuel efficiency damaged the company's reputation as a green brand.[172][165]\n\nGreenwashing controversies[edit]\nToyota has repeatedly been the subject of greenwashing controversies, owing to their criticism of electric cars, while promoting hydrogen and hybrid vehicles – with the manner in which they have advertised and marketed hybrid vehicles causing particular consternation.[173][174]\nToyota President, Akio Toyoda, has made repeated statements about electric cars, claiming that they are “Overhyped” and that “the more EVs we build, the worse carbon dioxide gets.”[175] This stance has led Transport & Environment to rank Toyota as the least ready OEM to transition to battery electric vehicles by 2030, stating: “Toyota has not set a target for 2030 and it plans to produce just 10% BEVs in 2025. It is expected to rely on polluting hybrid technologies.[176]”\nAlongside their commitment to hybrid vehicles, Toyota has repeatedly stated its commitment to producing hydrogen cars, claiming that they will be the future of the company.[177][178] Many journalists and environmental activists have accused Toyota of greenwashing due to their stance on hydrogen vehicles in the face of clear evidence that they are considerably less efficient than battery electric cars, and will create more greenhouse gas emissions due to energy-intensity of the hydrogen extraction process.[179][180][181][182]\n\nSelf-charging hybrids[edit]\nIn 2019, Toyota launched a global campaign for its self-proclaimed ‘self-charging hybrid’ vehicles, which use fossil fuel to charge the on-board batteries in their cars, rather than using an external electricity source, as with plug-in hybrids.\nThe language around ‘self-charging’ hybrids caused much consumer criticism that this was misleading, as the vehicles did not self-charge, but instead required users to input fossil fuels, and these vehicles could not run on electric power alone – as was made clear during the COVID-19 pandemic, when Toyota contacted the owners of these vehicles to inform them of the need to regularly refuel the vehicles with fossil fuels.[183][184]\nComplaints about self-charging hybrid advertising were recorded in multiple countries,[185] and in 2020 the Norwegian Consumer Authority banned the adverts outright in Norway for misleading consumers,[186] stating: “It is misleading to give the impression that the power to the hybrid battery is free of charge, since the electricity produced by the car has consumption of gasoline as a necessary condition.”.[187]\nLater in 2020, a study by Transport & Environment[188][189] concluded that real-world CO2 emissions from hybrid vehicles were, on average, over two and a half times those of official test values.[190][191] Another report found that even the most efficient hybrid vehicles produce at least 40-70% of the emissions of a petrol or diesel car, and will have created 15% more emissions in its manufacturer than a battery electric vehicle would have.[192][193][194]\nAs the world’s biggest producer and marketer of hybrid vehicles, Toyota has attracted the greatest attention in the wake of these reports, given that the Japanese manufacturer plans to increase hybrid production at a time when most major manufacturers are switching to solely producing electric vehicles by 2035 due to the contribution of cars to the Climate crisis.[195][196]\nThis was compounded in early 2021, when Toyota was fined a record $180 million for failing to comply with the Clean Air Act’s emissions reporting requirements from 2005 to 2015.[197][198][199]\n\nMisleading marketing[edit]\nToyota has also drawn negative attention for its marketing campaigns, which use studies funded by the manufacturer to substantiate claims about the efficiency of their vehicles.\nAn exposé by IrishEVs found that Toyota Ireland had paid University College Dublin to conduct a study of just seven cars over seven days to make claims about the efficiency of their hybrid vehicles.[200][201]\nFurthermore, Toyota Ireland had consistently used funded polls to substantiate claims about their CO2 emissions, and their perception as a “leading brand tackling climate change in Ireland.” No data or evidence was offered to validate these claims.[202]\n\nCorporate affairs[edit]\n Principal headquarters building of Toyota\nToyota is headquartered in the city of Toyota,[203] which was named Koromo until 1951, when it changed its name to match the automaker. Toyota City is located in the Aichi Prefecture of Japan. The main headquarters of Toyota is located in a four-story building that has been described as \"modest\".[204] In 2013, company CEO Akio Toyoda reported that it had difficulties retaining foreign employees at the headquarters due to the lack of amenities in the city.[205]\nSurrounding the headquarters are the 14-story Toyota Technical Center and the Honsha plant (which was established in 1938). Toyota and its Toyota Group affiliates operate a total of 17 manufacturing facilities in Aichi Prefecture and a total of 32 plants in Japan.\nToyota also operates offices in Bunkyo, Tokyo and Nakamura-ku, Nagoya.[203]\n\n\nWorldwide presence[edit]\n\n\nTop 10 Toyota vehicle salesby country, 2019[206]\n\n\nRankin Toyota\n\nLocation\n\nVehiclesales\n\n\n1\n\n United States\n\n2,383,348\n\n\n2\n\n China\n\n1,620,698\n\n\n3\n\n Japan\n\n1,610,169\n\n\n4\n\n GCC\n\n368,433\n\n\n5\n\n Thailand\n\n332,380\n\n\n6\n\n Indonesia\n\n332,354\n\n\n7\n\n Canada\n\n237,091\n\n\n8\n\n Brazil\n\n217,430\n\n\n9\n\n Australia\n\n215,378\n\n\n10\n\n Philippines\n\n162,011\n\n\n\nTop 10 Toyota vehicle productionby country, 2019[206]\n\n\nRankin Toyota\n\nLocation\n\nVehicleproduction\n\n\n1\n\n Japan\n\n3,415,864\n\n\n2\n\n China\n\n1,404,305\n\n\n3\n\n United States\n\n1,194,824\n\n\n4\n\n Thailand\n\n570,852\n\n\n5\n\n Canada\n\n467,998\n\n\n6\n\n Turkey\n\n251,949\n\n\n7\n\n France\n\n224,073\n\n\n8\n\n Mexico\n\n192,983\n\n\n9\n\n Brazil\n\n187,866\n\n\n10\n\n Indonesia\n\n172,314\n\nSee also: List of Toyota manufacturing facilities\nOutside of Japan, as one of the world's largest automotive manufacturer by production volume, Toyota has factories in most parts of the world. The company assembles vehicles in Argentina, Belgium, Brazil, Canada, Colombia, the Czech Republic, France, Indonesia, Mexico, the Philippines, Poland, Russia, South Africa, Thailand, Turkey, the United Kingdom, the United States, and Venezuela.\nAdditionally, the company also has joint venture, licensed, or contract factories in China, France, India, Malaysia, Pakistan, Taiwan, the United States, and Vietnam.\n\nNorth America[edit]\nMain article: Toyota Motor North America\n The Toyota Camry is assembled in several facilities around the world including Australia, China, Taiwan, Japan, Malaysia, the Philippines, Russia, Thailand, India, Vietnam, and the United States\nToyota Motor North America is headquartered in Plano, Texas, and operates as a holding company for all operations of the Toyota Motor Corporation in Canada, Mexico, and the United States. Toyota’s operations in North America began on October 31, 1957, and the current company was established in 2017 from the consolidation of three companies: Toyota Motor North America, Inc., which controlled Toyota’s corporate functions; Toyota Motor Sales, U.S.A., Inc. which handled marketing, sales, and distribution in the United States; and Toyota Motor Engineering & Manufacturing North America which oversaw operations at all assembly plants in the region. While all three companies continue to exist in legal name, they operate as one company out of one headquarters campus.\nToyota has a large presence in the United States with six major assembly plants in Huntsville, Alabama, Georgetown, Kentucky, Princeton, Indiana, San Antonio, Texas, Buffalo, West Virginia, and Blue Springs, Mississippi. In 2018, Toyota and Mazda announced a joint venture plant that will produce vehicles in Huntsville, Alabama, starting in 2021.[207]\nIt has started producing larger trucks, such as the new Tundra, to go after the full-size pickup market in the United States. Toyota is also pushing hybrid electric vehicle in the US such as the Prius, Camry Hybrid, Highlander Hybrid, and various Lexus products. Currently, Toyota has no plans to offer diesel motor options in its North American products, including pickup trucks.[208]\nToyota Canada Inc., which is part of Toyota Motor North America, handles marketing, sales, and distribution in Canada. Toyota Motor Manufacturing Canada operates three assembly plants: two in Cambridge, Ontario and one in Woodstock, Ontario.[209] In 2006, Toyota's subsidiary Hino Motors opened a heavy duty truck plant, also in Woodstock, employing 45 people and producing 2,000 trucks annually.[210]\n\nEurope/Western Asia[edit]\nMain article: Toyota Motor Europe\nToyota Motor Europe is headquartered in Brussels, Belgium, and oversees all operations of the Toyota Motor Corporation in Europe and western Asia. Toyota’s operations in Europe began in 1963. Toyota has a significant presence in Europe with nine production facilities in Kolín, Czech Republic, Burnaston, England, Deeside, England, Onnaing, France, Jelcz-Laskowice, Poland, Wałbrzych, Poland, Ovar, Portugal, Saint Petersburg, Russia, and Arifiye, Turkey.[211] Toyota also operates a joint venture plant with Citroën and Peugeot in Valenciennes, France.\n\nAustralia[edit]\nMain article: Toyota Australia\nIn 1963, Australia was one of the first countries to assemble Toyotas outside Japan. However, in February 2014, Toyota was the last of Australia's major automakers to announce the end of production in Australia. The closure of Toyota's Australian plant was completed on October 3, 2017, and had produced a total 3,451,155 vehicles. At its peak in October 2007, Toyota manufactured 15,000 cars a month.[212]  Before Toyota, Ford and GM's Holden had announced similar moves, all citing an unfavorable currency and attendant high manufacturing costs.[213]\n\nFinancials[edit]\nToyota is publicly traded on the Tokyo, Osaka, Nagoya, Fukuoka, and Sapporo exchanges under company code TYO: 7203. In Japan, Toyota's stock is a component of the Nikkei 225 and TOPIX Core30 indices.\nIn addition, Toyota is foreign-listed on the New York Stock Exchange under NYSE: TM and on the London Stock Exchange under LSE: TYT.\nToyota has been publicly traded in Japan since 1949 and internationally since 1999.[214]\n\nCompany strategy[edit]\n New Toyota factory in Ohira, near Sendai, Miyagi Prefecture, Japan: A month after this picture was taken, the region was devastated by the March 11 earthquake and tsunami. The plant was only lightly damaged, but remained closed more than a month, mainly due to lack of supplies and energy, in addition to a badly damaged Sendai port.\nThe Toyota Way[edit]\nMain article: The Toyota Way\nThe Toyota Way is a set of principles and behaviors that underlie the company's approach to management and production (which is further defined as the Toyota Production System).\nThe company has been developing its corporate philosophy since 1948 and passing it on as implicit knowledge to new employees, but as the company expanded globally, leaders officially identified and defined the Toyota Way in 2001. Toyota summarized it under two main pillars: continuous improvement and respect for people. Under the continuous improvement pillar are three principals: challenge (form a long-term vision), kaizen (a continual improvement process), and genchi genbutsu (\"go and see\" the process to make correct decisions). Under the respect for people pillar are two principals: respect and teamwork.[215]\nIn 2004, Dr. Jeffrey Liker, a University of Michigan professor of industrial engineering, published The Toyota Way. In his book, Liker calls the Toyota Way \"a system designed to provide the tools for people to continually improve their work.\"[216] According to Liker, there are 14 principles of The Toyota Way that can be organized into four themes: (1) long-term philosophy, (2) the right process will produce the right results, (3) add value to the organization by developing your people, and (4) continuously solving root problems drives organizational learning. The 14 principles are further defined in the Wikipedia article on The Toyota Way.\n\nToyota Production System[edit]\nMain article: Toyota Production System\nThe Toyota Way also helped shape the company's approach to production, where it was an early pioneer of what would be come to be known as lean manufacturing.[217] The company defines the Toyota Production System under two main pillars: just-in-time[218] (make only what is needed, only when it is needed, and only in the amount that is needed) and Jidoka[219]  (automation with a human touch).\nThe origin of the Toyota Production System is in dispute, with three stories of its origin: (1) that during a 1950 trip to train with the Ford Motor Company, company executives also studied the just-in-time distribution system of the grocery store company Piggly-Wiggly,[220] (2) that they followed the writings of W. Edwards Deming,[221] and (3) they learned the principles from a WWII US government training program (Training Within Industry).[222]\nAfter developing the Toyota Production System in its own facilities, the company began teaching the system to its parts suppliers in the 1990s. Other companies were interested in the instruction, and Toyota later started offering training sessions. The company also has donated the training to non-profit groups to increase their efficiency and thus ability to serve people.\n\nLogo and branding[edit]\n Employee at the Toyota Automobile Museum explains development of Toyota name and brand\nIn 1936, Toyota entered the passenger car market with its Model AA and held a competition to establish a new logo emphasizing speed for its new product line. After receiving 27,000 entries, one was selected that additionally resulted in a change of its moniker to \"Toyota\" from the family name \"Toyoda\", which means rice paddy. The new name was believed to sound better, and its eight-stroke count in the Japanese language was associated with wealth and good fortune. The original logo was a heavily stylized version of the katakana characters for Toyota (トヨタ).[223]\nAs the company started to expand internationally in the late 1950s, the katakana character logo was supplemented by various wordmarks with the English form of the company name in all capital letters, \"TOYOTA.\"[223]\nToyota introduced a worldwide logo in October 1989 to commemorate the 50th year of the company, and to differentiate it from the newly released luxury Lexus brand.[224] The logo consists of three ovals that combine to form the letter \"T\", which stands for Toyota. Toyota says that the overlapping of the two perpendicular ovals inside the larger oval represents the mutually beneficial relationship and trust between the customer and the company while the larger oval surrounding both of these inner ovals represents the \"global expansion of Toyota's technology and unlimited potential for the future\".[225][226] The new logo started appearing on all printed material, advertisements, dealer signage, and most vehicles in 1990.\nIn countries or regions using traditional Chinese characters, e.g. Hong Kong and Taiwan, Toyota is known as \"豐田\".[227] In countries using simplified Chinese characters (e.g. China, Singapore), Toyota is written as \"丰田\"[228] (pronounced as Fēngtián in Mandarin Chinese and Hɔng Tshan in Minnanese). These are the same characters as the founding family's name \"Toyoda\" in Japanese.\n\n Some new vehicles, like this Tacoma, still use the heritage TOYOTA wordmark\nToyota still uses the katakana character logo as its corporate emblem in Japan, including on the headquarters building,[229] and some special edition vehicles still use the \"TOYOTA\" wordmark on the grille as a nod to the company's heritage.[230]\nOn July 15, 2015, the company was delegated its own generic top-level domain, .toyota.[231]\n\nSports sponsorships[edit]\nToyota sponsors several teams and has purchased naming rights for several venues, and even competitions, including:\n\nToyota Alvark Tokyo, basketball team\nToyota Cup\nToyota Center, Houston, Texas\nToyota Center, Kennewick, Washington\nToyota Field, San Antonio, Texas\nToyota Park, Bridgeview, Illinois\nToyota Sports Center, El Segundo, California\nToyota Stadium, Georgetown, Kentucky\nToyota Stadium, Frisco, Texas\nAs of 2017[update], Toyota is an official sponsor of Cricket Australia,[232] the England and Wales Cricket Board[233] and the AFL.[234] In March 2015, Toyota became a sponsor partner for the Olympic Games, in the form of supplying vehicles and communications between vehicles until 2024.[235]\n\nSee also[edit]\n\n\nCompanies portal\nList of Toyota engines\nList of Toyota manufacturing facilities\nList of Toyota transmissions\nList of Toyota vehicles\nNagoya Grampus, formerly the company's football club and still sponsored by them\nToyota model codes\nToyota Verblitz, the company's rugby team\nToyota War, a conflict between Libya and Chad which saw a heavy use of Toyota's pickup trucks.\nReferences[edit]\n\n\n\n^ \"Toyota Global Sales and Production Secures 90 Percent Level Year-on-Year in FY2021\" (Press release). Japan: Toyota Motor Corporation. April 28, 2021. Retrieved April 28, 2021.\n\n^ \"Toyota Annual Report 2021\" (PDF). Toyota Motor Corporation. May 12, 2021. Archived (PDF) from the original on May 27, 2020. Retrieved May 12, 2021.\n\n^ \"The Story of Sakichi Toyoda\". Toyota Industries Corporation. Archived from the original on September 23, 2017. Retrieved September 22, 2017.\n\n^ \"History Of Toyota\". Toyota. Archived from the original on August 12, 2011. Retrieved August 15, 2011.\n\n^ \"Toyota Company History from 1867 to 1939\". Toyota. Archived from the original on May 10, 2013. Retrieved September 11, 2010.\n\n^ \"Information from a sign at the Toyota Museum in Nagakute-cho, Aichi-gun, Aichi Pref\". Toyota. Archived from the original on November 20, 2012. Retrieved December 7, 2012.\n\n^ Davis, Pedr (1999). The Long Run – Toyota: The first 40 years in Australia. South Hurstville: Type Forty Pty Ltd. p. 24. ISBN 0-947079-99-8.\n\n^ Toyota: A history of the First 50 Years. Toyota. 1988. p. 64. ISBN 0-517-61777-3.\n\n^ Dawson, Chester (2004). Lexus: The Relentless Pursuit. Singapore: John Wiley & Sons.\n\n^ Chang, Ha-Joon (2008). Bad Samaritans: The Myth of Free Trade and the Secret History of Capitalism. New York: Random House. p. 20.\n\n^ \"Part 1, Chapter 2, Section 6, Item 1: Resumption of factory production\". 75 Years of Toyota. Retrieved July 29, 2021.\n\n^ \"Part 1, Chapter 2, Section 6, Item 3: Converting to Meet Civilian Demand and Dealing with Post-war Reforms\". 75 Years of Toyota. Retrieved July 29, 2021.\n\n^ \"Part 1, Chapter 2, Section 6, Item 5: U.S. Army Vehicle Repair Operations and Compact Car Development\". 75 Years of Toyota. Retrieved July 29, 2021.\n\n^ \"Part 1, Chapter 2 Section 6, Item 6: Dodge Line Recession and liberalization of vehicle production and sales\". 75 Years of Toyota. Retrieved July 29, 2021.\n\n^ \"Part 1, Chapter 2, Section 6, Item 6a: Emerging business management crisis\". 75 Years of Toyota. Retrieved July 29, 2021.\n\n^ \"Part 1, Chapter 2, Section 7, Item 2: Special Demand Caused by Korean War\". 75 Years of Toyota. Retrieved July 29, 2021.\n\n^ \"Part 1, Chapter 2, Section 7, Item 1: Training at the Ford Motor Company and Observation of American Machinery Manufacturers\". 75 Years of Toyota. Retrieved July 29, 2021.\n\n^ Brian Bremner, B. and C. Dawson (November 17, 2003). \"Can Anything Stop Toyota?: An inside look at how it's reinventing the auto industry\". Business Week.\n\n^ a b \"Part 1, Chapter 2, Section 8, Item 3: Development of the model RS Toyopet Crown\". 75 Years of Toyota. Retrieved July 29, 2021.\n\n^ \"Part 1, Chapter 2, Section 8, Item 3: Development of the model RR Toyopet Master\". 75 Years of Toyota. Retrieved July 29, 2021.\n\n^ \"Part 1, Chapter 2, Section 9, Item 3: Start of exports to Latin America\". 75 Years of Toyota. Retrieved July 29, 2021.\n\n^ a b c \"Part 1, Chapter 2, Section 9, Item 4: Asia and Australia in the 1950s\". 75 Years of Toyota. Retrieved July 29, 2021.\n\n^ \"Part 1, Chapter 2, Section 9, Item 4a: Toyota Motor Thailand established\". 75 Years of Toyota. Retrieved July 29, 2021.\n\n^ \"Part 1, Chapter 2, Section 9, Item 3a: Toyota's first production outside Japan at Toyota do Brasil\". 75 Years of Toyota. Retrieved July 29, 2021.\n\n^ \"Part 1, Chapter 2, Section 9, Item 5: Passenger car exports suspended\". 75 Years of Toyota. Retrieved June 29, 2021.\n\n^ a b Dawson, Chester (2004). Lexus: The Relentless Pursuit. Singapore: John Wiley & Sons (Asia) Pte Ltd. ISBN 0-470-82110-8.\n\n^ \"Part 2, Chapter 1, Section 2, Item 1: The High Rate of Economic Growth and Motorization\". 75 Years of Toyota. Retrieved July 29, 2021.\n\n^ \"History of the Corolla\". USA: Toyota. Archived from the original on June 20, 2006. Retrieved March 20, 2013.\n\n^ \"Part 2, Chapter 1, Section 3, Item 1: Corolla\". 75 Years of Toyota. Retrieved July 29, 2021.\n\n^ Ikenson, Daniel (June 18, 2003). \"Ending the 'Chicken War': The Case for Abolishing the 25 Percent Truck Tariff\". The Cato Institute. Archived from the original on September 21, 2011. Retrieved November 29, 2011.\n\n^ \"Toyota's TABC Plant Celebrates 40 Years of Manufacturing in California\". Toyota Motor North America (Press release). August 21, 2012. Retrieved June 2, 2021.\n\n^ a b Pollack, Andrew (September 21, 1995). \"Toyota Doubles Its Holdings in Daihatsu Motor of Japan\". The New York Times. Retrieved December 27, 2016.\n\n^ Hino, Satoshi (2006). Inside the Mind of Toyota. CRC Press. p. 24. ISBN 9781563273001.\n\n^ \"Global Website | 75 Years of Toyota | Section 3. Local Production Starts in North America | Item 1. Negotiations with Ford\". www.toyota-global.com. Retrieved June 29, 2021.\n\n^ Siegel, Robert (March 26, 2010). \"The End Of The Line For GM-Toyota Joint Venture\". All Things Considered. National Public Radio. Archived from the original on April 23, 2016. Retrieved April 7, 2010.\n\n^ a b Lyon, Peter (January 9, 2018). \"The Lasting Legacy Of Toyota's Tatsuro Toyoda: A Ground-Breaking Joint Venture In The U.S.\" Forbes. Retrieved August 6, 2021.\n\n^ \"timeline\". NUMMI. Archived from the original on April 2, 2010. Retrieved November 30, 2013.\n\n^ Hattori, Yoshi (June 1984). \"Japan: Minica magic\". Wheels. Sydney, Australia: Murray Publishers: 19. Nissan built 1,200,000 fwds, Honda about one million, and Toyota 800,000. Mazda was fourth, with 700,000 fwd cars.\n\n^ a b Dawson, Chester (2004). Lexus: The Relentless Pursuit. John Wiley & Sons (Asia) Pte Ltd., Singapore. p. 4. ISBN 978-0-470-82110-7.\n\n^ a b May, Matthew E. (2006). The Elegant Solution: Toyota's Formula for Mastering Innovation, Free Press, NY. p. 43. ISBN 0-7432-9017-8.\n\n^ a b \"Toyota Prius Chronological History\". Retrieved November 6, 2009.\n\n^ \"Toyota to take over Daihatsu Motor\". The Japan Times. August 28, 1998. Retrieved December 27, 2016.\n\n^ \"Ex-UFJ execs in scandal avoid prison\". Japan Times Weekly. Japan. April 30, 2005. Archived from the original on September 29, 2007.\n\n^ UFJ Holdings Inc., company profile Archived January 29, 2008, at the Wayback Machine Yahoo Finance. Retrieved on May 8, 2007.\n\n^ \"Forbes Global 2000\". Forbes. Archived from the original on May 24, 2006. Retrieved December 27, 2008.\n\n^ \"Toyota Claims World's Best-Selling Automaker Title\". Automotive. US News. April 24, 2008. Archived from the original on October 29, 2008. Retrieved December 27, 2008.\n\n^ Vlasic, Bill; Fackler, Martin (December 23, 2008). \"Car Slump Jolts Toyota, Halting 70 Years of Gain\". The New York Times. Archived from the original on September 4, 2015. Retrieved January 6, 2009.\n\n^ Fackler, Martin (January 7, 2009). \"Toyota to Shut Factories for 11 Days\". The New York Times. Archived from the original on February 6, 2016. Retrieved January 6, 2009.\n\n^ a b \"Amended Recall: Potential Floor Mat Interference with Accelerator Pedal\" (Press release). Toyota. September 29, 2009. Archived from the original on December 21, 2009.\n\n^ a b Healey, James R. (February 17, 2010). \"Toyota deaths reported to safety database rise to 37\". USA Today. Retrieved February 11, 2011.\n\n^ a b Haq, Husna (January 29, 2010). \"Toyota recall update: dealers face full lots, anxious customers\". The Christian Science Monitor. Archived from the original on February 2, 2010. Retrieved January 30, 2010.\n\n^ a b Hirsch, Jerry; Bensinger, Ken (October 25, 2013). \"Toyota settles acceleration lawsuit after $3-million verdict\". Los Angeles Times. Retrieved November 24, 2013.\n\n^ a b Zalubowski, David (December 26, 2012). \"Toyota settlement in sudden-acceleration case will top $1 billion\". Los Angeles Times. Retrieved December 27, 2012.\n\n^ a b Vlasic, Bill; Apuzzo, Matt (March 19, 2014). \"Toyota Is Fined $1.2 Billion for Concealing Safety Defects\". The New York Times. Retrieved March 20, 2014.\n\n^ \"Akio Toyoda bio\". Toyota Motor Corporation. Retrieved August 5, 2021.\n\n^ \"Toyota names Akio Toyoda as next president\". UPI.com. January 9, 2009. Archived from the original on March 28, 2019. Retrieved July 25, 2009.\n\n^ \"Toyota's Financials Hit By Earthquake\". Thetruthaboutcars.com. August 2, 2011. Archived from the original on October 17, 2013. Retrieved May 11, 2013.\n\n^ \"This Is A Tsunami Wave\". Thetruthaboutcars.com. July 29, 2011. Archived from the original on October 17, 2013. Retrieved May 11, 2013.\n\n^ Dunckley, Mathew (February 10, 2014). \"Toyota confirms exit from Australian manufacturing in 2017\". Port Macquarie News. Archived from the original on February 21, 2014. Retrieved February 10, 2014.\n\n^ a b \"Toyota Australia Announces Future Plan For Local Manufacturing\" (Press release). Australia: Toyota. February 10, 2014. Archived from the original on February 22, 2014. Retrieved February 10, 2014.\n\n^ \"Toyota Australia announces its future plans\" (Press release). Australia: Toyota. December 3, 2014. Archived from the original on March 24, 2016. Retrieved March 18, 2016.\n\n^ \"World biggest carmaker tag retained by Toyota\". The Japan News.Net. Archived from the original on August 8, 2014. Retrieved July 31, 2014.\n\n^ \"Anti-trust probe forces Toyota to cut auto spare parts prices in China\". Asia Pacific Star. August 21, 2014. Archived from the original on August 26, 2014. Retrieved August 22, 2014.\n\n^ Kelly, Heather (November 5, 2015). \"Toyota to invest $1 billion into artificial intelligence\". CNNMoney. Archived from the original on November 9, 2015. Retrieved November 10, 2015.\n\n^ Hawkins, Andrew J. (May 24, 2016). \"Toyota is establishing a 'strategic partnership' with Uber, which is a really big deal\". The Verge. Vox Media. Archived from the original on August 5, 2017. Retrieved May 25, 2016.\n\n^ \"Toyota holds $293 million stake in Uber, governance report shows\". Reuters. US. June 24, 2020. Retrieved November 8, 2020.\n\n^ \"\"ガリバー\"ヤマハの牙城を崩せるか!? トヨタとヤンマーがプレジャーボートでタッグ\" [\"Gulliver\" Can you break down the stronghold of Yamaha? Toyota and Yanmar join to make a pleasure boat]. My Navi (in Japanese). March 10, 2016. Archived from the original on August 9, 2017. Retrieved August 26, 2017.\n\n^ \"Toyota completes full takeover of Daihatsu\". The Japan Times. Retrieved August 1, 2016.\n\n^ \"Toyota To Invest $500 Mln Uber To Develop Driverless Car: WSJ\". Business Insider. August 27, 2018. Archived from the original on August 28, 2018. Retrieved August 28, 2018.\n\n^ a b c \"Toyota beats Volkswagen to become World's No.1 car seller in 2020\". Yahoo. January 28, 2021. Archived from the original on January 28, 2021.\n\n^ Toh, Michelle. \"Toyota overtakes Volkswagen as world's biggest automaker\". CNN.\n\n^ Lambert, Fred (April 2, 2020). \"Toyota launches new electric car company with BYD\". Electrek. Retrieved September 28, 2020.\n\n^ \"Toyota and Isuzu to take stake in each other to co-develop new vehicles\". Japan Times. March 25, 2021. Retrieved April 6, 2021.\n\n^ \"Toyota to buy Lyft unit in boost to self-driving plans\". Reuters. April 26, 2021. Retrieved April 28, 2021.\n\n^ Choi, Joseph (June 27, 2021). \"Toyota defends donations to lawmakers who objected to certifying election\". TheHill. Retrieved June 28, 2021.\n\n^ \"Toyota is the no. 1 donor to 2020 election objectors — by far\". news.yahoo.com. Retrieved June 28, 2021.\n\n^ Markay, Lachlan. \"Toyota to cease donations to election objectors\". Axios. Retrieved July 8, 2021.\n\n^ Toyota to boost hiring of software engineers to 50% of technical staff intake, The Japan Times, 26 April 2021\n\n^ a b c \"Toyota ditches signature 'just-in-time' to fight chip crunch\". Nikkei Asia. September 15, 2021. Retrieved September 16, 2021.\n\n^ a b c d e f g \"Toyota Product Line up 2009\" (PDF). Archived (PDF) from the original on July 22, 2011. Retrieved September 11, 2010.\n\n^ \"New Toyota Land Cruiser is 200 kg lighter, more advanced than its predecessor\". CarWale. June 13, 2021.\n\n^ \"Top Gear – Episode Archive – Series 3\". BBC. November 23, 2003. Archived from the original on November 6, 2009. Retrieved July 25, 2009.\n\n^ \"75 Years of TOYOTA - Part 2, Chapter 2, Section 5, Item 4. Expansion of Sales Networks in the United States\". Toyota Motor Corporation. Retrieved June 28, 2021.\n\n^ a b Smith, Steven Cole (June 12, 2020). \"Tested: 1995 Toyota T100 Xtracab DX Inches Closer to Becoming a Real Full-Size Pickup\". Car and Driver. Retrieved July 20, 2021.\n\n^ Stone, Matt. \"2000 Toyota Tundra - Road Test & Review\". Motor Trend. Retrieved July 20, 2021.\n\n^ \"Worldwide Sales of Toyota Hybrids Surpass 9 Million Units\" (Press release). Toyota City, Japan: Toyota. May 20, 2016. Archived from the original on May 23, 2016. Retrieved May 22, 2016.\n\n^ Klippenstein, Matthew (August 22, 2013). \"Does Toyota's Hybrid Leadership Blind It To Electric Cars?\". Green Car Reports. Archived from the original on May 15, 2016. Retrieved May 22, 2016.\n\n^ a b \"Worldwide Sales of Toyota Hybrids Surpass 10 Million Units\" (Press release). Toyota City, Japan: Toyota Europe. January 14, 2017. Archived from the original on February 16, 2017. Retrieved January 15, 2017.\n\n^ Abuelsamid, Sam (December 14, 2009). \"Toyota officially launches plug-in Prius program, retail sales in 2011\". Autoblog Green. Retrieved December 22, 2009.\n\n^ Toyota News Release (February 28, 2012). \"Prius Plug-In eligibile for a $1,500 California consumer incentive plus $2,500 Federal tax credit\". Green Car Congress. Retrieved February 29, 2012.\n\n^ Berman, Brad (May 1, 2015). \"Toyota Halts Production of Prius Plug-in Hybrid Until Late 2016\". Plugincars.com. Retrieved June 20, 2015.\n\n^ Undercoffler, David (March 23, 2016). \"Toyota looks to boost Prius with all-new plug-in Prime\". Automotive News. Retrieved March 24, 2016.\n\n^ Blanco, Sebastian (March 23, 2016). \"Toyota Prius Prime plugs in with 22 EV miles\". Autoblog.com. Retrieved March 24, 2016.\n\n^ Tajitsu, Naomi (February 15, 2017). \"Toyota sees plug-in hybrids catching on faster than conventional hybrids\". Automotive News. Reuters. Retrieved February 19, 2017. Around 75,000 first generation Prius plug-ins have been sold since its launch in 2012.\n\n^ Beard, David (July 2, 2020). \"Tested: 2021 Toyota RAV4 Prime Is Quicker Than Supra 2.0\". Car and Driver. Retrieved July 28, 2021.\n\n^ Tabuchi, Hiroko (July 25, 2021). \"Toyota Led on Clean Cars. Now Critics Say It Works to Delay Them\". The New York Times. ISSN 0362-4331. Retrieved July 27, 2021.\n\n^ Motavalli, Jim (July 16, 2010). \"Toyota and Tesla Plan an Electric RAV4\". The New York Times. Archived from the original on July 18, 2010. Retrieved July 18, 2010.\n\n^ \"Toyota Concept Vehicles-- RAV4 EV\". Toyota USA. Archived from the original on January 23, 2012. Retrieved January 22, 2012.\n\n^ Sherry Boschert (2006). Plug-in Hybrids: The Cars that will Recharge America. New Society Publishers, Gabriola Island, Canada. ISBN 978-0-86571-571-4. Archived from the original on December 31, 2008. Retrieved September 7, 2019.\n\n^ \"Toyota RAV4 EV key for meeting California ZEV requirements; Tesla powertrain uses Model S components\". Green Car Congress. August 10, 2012. Retrieved August 4, 2012.\n\n^ \"Toyota Wraps Up Production of RAV4 EV\". PluginCars.com. September 29, 2014. Retrieved August 28, 2018.\n\n^ \"Don't look for a Toyota RAV4 EV successor anytime soon\". Roadshow. April 3, 2018. Retrieved August 28, 2018.\n\n^ Trudell, Craig; Ohnsman, Alan (August 7, 2014). \"Why the Tesla-Toyota Partnership Short-Circuited\". Bloomberg News. Retrieved July 28, 2021.\n\n^ \"Toyota officially confirms 2012 launch of electric Scion iQ\". Autoblog. July 1, 2011. Archived from the original on October 23, 2012. Retrieved July 15, 2011.\n\n^ a b \"Toyota beefs up green vehicles, plans electric car for this year, fuel cell vehicle by 2015\". Toledo Blade. Associated Press. September 24, 2012. Archived from the original on March 2, 2017. Retrieved June 20, 2016.\n\n^ White, Addison (July 30, 2020). \"Toyota Once Partnered With Tesla to Make a Disappointing Electric RAV4\". MotorBiscuit. Retrieved October 31, 2021.\n\n^ \"Toyota Premieres Toyota-brand Battery Electric Vehicles Ahead of 2020 China Launch\" (Press release). Toyota. Retrieved October 31, 2021.\n\n^ \"Toyota C-HR Electric fails to excite customers in China\". ElectricVehicleWeb. July 6, 2021. Retrieved October 31, 2021.\n\n^ Padeanu, Adrian (October 17, 2019). \"Toyota Reveals Tiny Production EV Ahead Of Late 2020 Launch\". Motor1.com. Archived from the original on October 18, 2019. Retrieved October 17, 2019.\n\n^ Szymkowski, Sean (October 17, 2019). \"Teeny-weeny Toyota electric city car will hit Japanese streets next year\". Roadshow. Archived from the original on October 18, 2019. Retrieved October 17, 2019.\n\n^ \"Toyota announces its new BEV series, Toyota bZ, in establishment of a full line-up of electrified vehicles\" (Press release). Toyota. Retrieved April 19, 2021.\n\n^ Gauthier, Michael (April 19, 2021). \"Toyota's bZ4X Concept Previews An Electric SUV Coming In 2022\". Carscoops. Retrieved April 19, 2021.\n\n^ \"Toyota Reveals Global Electrification Strategy in Shanghai\" (Press release). Australia: Toyota. Retrieved April 19, 2021.\n\n^ \"Toyota's Already Testing Its Solid-State Battery Tech on Public Roads\". MotorTrend. September 8, 2021. Retrieved October 31, 2021.\n\n^ \"Toyota's Already Testing Its Solid-State Battery Tech on Public Roads\". MotorTrend. September 8, 2021. Retrieved October 31, 2021.\n\n^ \"Toyota FCHV Fact Sheet\" (Press release). Toyota USA. September 11, 2008. Archived from the original on October 23, 2012. Retrieved January 13, 2013.\n\n^ \"Toyota to Begin Leasing Advanced Fuel Cell Hybrid Vehicle\" (Press release). Toyota Japan. August 29, 2008. Archived from the original on April 25, 2013. Retrieved January 13, 2013.\n\n^ Bowman, Zach (November 30, 2011). \"Toyota FCV-R Concept is otherworldly\". Autoblog. Archived from the original on October 17, 2012. Retrieved April 20, 2013.\n\n^ Priddle, Alisa (March 17, 2013). \"Toyota to start selling hydrogen fuel-cell car in 2015\". USA Today. Archived from the original on August 11, 2012. Retrieved August 8, 2012.\n\n^ Muller, Joann (August 29, 2013). \"Toyota Unveils Plans For 15 New Or Improved Hybrids (It Already Has 23)\". Forbes. Archived from the original on October 6, 2014. Retrieved August 31, 2013.\n\n^ Millikin, Mike (November 17, 2014). \"Akio Toyoda announces name of Toyota's new fuel cell sedan in web video: Mirai\". Green Car Congress. Archived from the original on November 17, 2014. Retrieved November 17, 2014.\n\n^ \"Toyota Mirai production to be increased\" (Press release). UK: Toyota. January 22, 2015. Archived from the original on September 4, 2015. Retrieved February 11, 2015.\n\n^ Moritsugu, Ken (November 18, 2014). \"oyota to start sales of fuel cell car next month\". Fox News Chicago. Associated Press. Archived from the original on November 29, 2014. Retrieved November 19, 2014.\n\n^ Voelcker, John (November 18, 2014). \"2016 Toyota Mirai Priced At $57,500, With $499 Monthly Lease\". Green Car Reports. Archived from the original on November 18, 2014. Retrieved November 19, 2014.\n\n^ Cobb, Jeff (November 17, 2014). \"Toyota Mirai To Be Priced From $57,500\". HybridCars.com. Archived from the original on November 20, 2014. Retrieved November 19, 2014.\n\n^ \"Toyota Ushers In The Future With Launch Of 'Mirai' Fuel Cell Sedan\" (Press release). Europe: Toyota. November 1, 2014. Archived from the original on December 5, 2014. Retrieved November 18, 2014.\n\n^ Nelson, Gabe (January 5, 2015). \"Toyota opens up 5,600 hydrogen-related patents to advance fuel cell technology\". Autoweek. US. Archived from the original on April 30, 2016. Retrieved April 28, 2016.\n\n^ Hasegawa, Takahiko; Imanishi, Hiroyuki; Nada, Mitsuhiro; Ikogi, Yoshihiro (April 5, 2016). \"Development of the Fuel Cell System in the Mirai FCV\". SAE Technical Paper Series. 1. US: SAE. doi:10.4271/2016-01-1185. Archived from the original on April 28, 2016. Retrieved April 28, 2016.\n\n^ Mizutani, Nobuaki; Ishibashi, Kazunobu (April 5, 2016). \"Enhancing PtCo Electrode Catalyst Performance for Fuel Cell Vehicle Application\". SAE Technical Paper Series. 1. US: SAE. doi:10.4271/2016-01-1187. Archived from the original on April 28, 2016. Retrieved April 28, 2016.\n\n^ Kato, Hisao (April 5, 2016). \"In-Situ Liquid TEM Study on the Degradation Mechanism of Fuel Cell Catalysts\". SAE International Journal of Alternative Powertrains. US: SAE. 5: 189–194. doi:10.4271/2016-01-1192. Archived from the original on April 28, 2016. Retrieved April 28, 2016.\n\n^ a b \"Toyota's Vision of Autonomous Cars Is Not Exactly Driverless – Bloomberg\". Bloomberg. September 19, 2018. Archived from the original on January 17, 2019.\n\n^ \"Toyota's billion-dollar AI research center has a new self-driving car\". March 3, 2017. Retrieved June 28, 2021.\n\n^ \"Toyota starts a new $2.8 billion company to develop self-driving software\". The Verge. March 2, 2018. Archived from the original on January 17, 2019.\n\n^ \"Toyota Is Launching a $2.8 Billion Self-Driving Car Company\". Futurism. March 3, 2018. Archived from the original on January 17, 2019.\n\n^ \"Toyota is buying Lyft's autonomous car division for $550 million\". The Verge. April 26, 2021. Retrieved June 28, 2021.\n\n^ \"Toyota to invest $500m in Uber in driverless car deal\". BBC. August 27, 2018. Archived from the original on January 17, 2019.\n\n^ \"Toyota to invest $500m in Uber for self-driving car programme\". The Guardian. August 28, 2018. Archived from the original on January 17, 2019.\n\n^ \"Toyota steers $400 million to self-driving startup Pony.ai\". February 25, 2020. Retrieved June 28, 2021.\n\n^ \"INGDAN.com Partners with Toyota to Build New Smart Car Ecosystem That Will Empower Technology Upgrades Across the Automotive Industry\". The Wall Street Journal. January 16, 2019. Archived from the original on March 28, 2019.\n\n^ \"Akio Toyoda Visits the e-Palette Operation Support Team on the Opening Ceremony Day\". TOYOTA TIMES (Press release). Retrieved August 5, 2021.\n\n^ \"Toyota Unveils Their e-Palette Self-Driving Shuttles\". Retrieved June 28, 2021.\n\n^ \"Toyota e-Palette autonomous vehicles to be rolled out \"within the next few years\"\". caradvice. February 11, 2021. Retrieved June 28, 2021.\n\n^ \"A City Tailor-Made for Self-Driving Cars? Toyota Is Building One\". www.bloomberg.com. Retrieved June 14, 2021.\n\n^ Poon, Linda. \"Can Toyota Turn Its Utopian Ideal Into a 'Real City'?\". City Lab. Archived from the original on January 28, 2020. Retrieved January 28, 2020.\n\n^ \"Toyota to sink $67.2 mln in Mitsubishi passenger jet, China Economic Net, May 23, 2008\". En.ce.cn. Archived from the original on May 18, 2011. Retrieved September 11, 2010.\n\n^ Toyota press release of first flight Archived September 30, 2007, at the Wayback Machine\n\n^ \"MRJ Program Schedule Announcement\". Archived from the original on October 16, 2015. Retrieved May 25, 2015.\n\n^ \"Toyota Marine\". Toyota Marine. Toyota Motor Corporation. Archived from the original on September 26, 2017. Retrieved September 23, 2017.\n\n^ \"Lexus pleasure boat introduced\". Nikkei Inc. Archived from the original on September 24, 2017. Retrieved September 23, 2017.\n\n^ \"Toyota: Supporting Our Communities\". Toyota. Archived from the original on August 12, 2015. Retrieved August 7, 2015.\n\n^ \"Toyota: Supporting Our Communities | Education Outreach\". Toyota. Archived from the original on August 10, 2015. Retrieved August 7, 2015.\n\n^ \"Toyota: Supporting Our Communities | Local Support\". Toyota. Archived from the original on August 11, 2015. Retrieved August 7, 2015.\n\n^ El-Naggar, Mona (July 26, 2013). \"In Lieu of Money, Toyota Donates Efficiency to New York Charity\". The New York Times. Archived from the original on July 31, 2013.\n\n^ \"トヨタ | 社会貢献活動\" (in Japanese). Toyota. Archived from the original on August 7, 2015. Retrieved August 7, 2015.\n\n^ \"Prospectus and History | The Toyota Foundation\". The Toyota Foundation. Archived from the original on July 17, 2015. Retrieved August 7, 2015.\n\n^ a b \"Toyota Education\". Toyota Motor Corporation. 2001. Archived from the original on October 15, 2007.\n\n^ \"Technology | Robot trumpets Toyota's know-how\". BBC News. March 11, 2004. Archived from the original on December 14, 2009. Retrieved July 25, 2009.\n\n^ a b \"Toyota Developing A Wheelchair Driven By The Mind\". PopSci.com.au. July 1, 2009. Archived from the original on April 1, 2012. Retrieved July 1, 2009.\n\n^ Etherington, Darrell (2017). \"You can virtually inhabit Toyota's new humanoid robot\". TechCrunch. Archived from the original on December 6, 2018. Retrieved December 8, 2018.\n\n^ Heater, Brian (December 1, 2018). \"Toyota taps Docomo 5G to remotely control its humanoid robot\". TechCrunch. Archived from the original on December 2, 2018. Retrieved December 3, 2018.\n\n^ \"History of TOYOTA home-use sewing machine\". www.aisin.co.jp. Retrieved July 21, 2021.\n\n^ a b Harden, Blaine (July 13, 2008). \"Japan's Killer Work Ethic\". The Washington Post Foreign Service. Archived from the original on June 15, 2017. Retrieved June 29, 2017.\n\n^ \"Nagoya court rules Toyota employee died from overwork\". The Japan Times. December 1, 2007. Archived from the original on February 11, 2018. Retrieved June 29, 2017.\n\n^ Mattera, Phil (February 11, 2010). \"Toyota totals its corporate social responsibility cred\". Facing South. US. Retrieved January 15, 2021.\n\n^ a b c Tabuchi, Hiroko (January 14, 2021). \"Toyota to Pay a Record Fine for a Decade of Clean Air Act Violations\". The New York Times. Retrieved January 15, 2021.\n\n^ a b Prang, Allison (January 14, 2021). \"Toyota to Pay $180 Million to Settle Complaint Over Delayed Emissions Defect Reports\". WSJ. US. Retrieved January 15, 2021.\n\n^ \"Toyota to pay $180 million fine for failing to report and fix pollution control defects\". The Associated Press. US. January 14, 2021. Retrieved January 15, 2021 – via Dallas News.\n\n^ Atiyeh, Clifford (November 13, 2014). \"Massive Takata Airbag Recall: Everything You Need to Know, Including Full List of Affected Vehicles\". Car and Driver. Archived from the original on November 29, 2014. Retrieved November 15, 2014.\n\n^ \"Toyota advances plans to replace Takata airbags in 65,000 vehicles\". Reuters. December 12, 2018. Archived from the original on December 12, 2018. Retrieved December 12, 2018.\n\n^ \"Strike halts production at Denso plant in China\". June 23, 2010. Archived from the original on February 11, 2018. Retrieved June 25, 2017.\n\n^ Hsu, Tiffany (October 29, 2019). \"Toyota's Support of Trump Emissions Rules Shocks Californians\". The New York Times. ISSN 0362-4331. Archived from the original on November 2, 2019. Retrieved November 2, 2019.\n\n^ Grandoni, Dino (July 17, 2020). \"Analysis - The Energy 202: Toyota faces revolt from eco-conscious customers after siding with Trump\". Washington Post. Archived from the original on November 6, 2019. Retrieved January 15, 2021. [Toyota] is not the only car company taking the Trump administration’s side in the high-stakes legal fight. But Toyota’s position may be particularly risky since it has spent decades cultivating an environmentally conscious reputation for pioneering the Prius, the first mass-market hybrid in the United States, along with other hybrid cars. Some Toyota owners, drawn to what they thought was a green brand, are in open revolt against the automaker. They're sending complaints to the company, taking to social media to call for boycotts and promising to buy cars that sided with California in its fight with President Trump.\n\n^ \"'Greenwashing' automakers are failing to support electric cars, putting future viability in jeopardy, study says\". www.forbes.com. Forbes Journal. November 14, 2019.\n\n^ \"These 12 car companies are setting the world on fire\". www.greenpeace.com. Greenpeace. September 10, 2019.\n\n^ \"Toyota's chief says electric vehicles are overhyped\". www.wsj.com. The Wall Street Journal. December 17, 2020.\n\n^ \"Volvo and VW the only European carmakers on track to electrify on time - study\". www.transportenvironment.com. Transport & Environment. June 16, 2021.\n\n^ \"Toyota doubles down on hydrogen with a new mirai and commercial trucks\". www.autoweek.com. Autoweek. December 21, 2020.\n\n^ \"Toyota doubles down on hybrids despite china's subsidies snub\". www.bloomberg.com. Bloomberg. April 24, 2016.\n\n^ \"Hydrogen cars won't overtake electric vehicles because they're hampered by the laws of science\". www.theconversation.com. The Conversation. June 3, 2020.\n\n^ \"Why are we still talking about hydrogen?\". Forbes. June 6, 2021.\n\n^ \"Roadmap to climate-friendly land freight and buses in Europe\" (PDF). www.transportenvironment.org. Transport & Environment. June 6, 2017.\n\n^ \"Chart: Why battery electric vehicles beat hydrogen electric vehicles without breaking a sweat\". www.cleantechnica.com. CleanTechnica. February 1, 2021.\n\n^ \"Toyta's self-charging hybrid ads deemed misleading, banned in Norway\". www.insideevs.com. InsideEVs. January 27, 2020.\n\n^ \"Don't' fall for the self-charging hybrid con\". Forbes. October 24, 2020.\n\n^ \"Toyota hybrid falls foul of ad rules after misleading cost saving claim\". www.journal.ie. The Journal. September 5, 2019.\n\n^ \"Toyota's 'self-charging hybrid' ad is banned in Norway, deemed a lie\". www.electrek.com. Electrek. January 24, 2020.\n\n^ \"Toyota's self-charging hybrid ad banned by this country\". www.ibtimes.com. International Business Times. January 24, 2020.\n\n^ \"Plug-in hybrid emissions 2.5 times higher than official tests indicate – environmental groups claim\". www.irishtimes.com. The Irish Times. September 16, 2020.\n\n^ \"The plug-in hybrid con\". www.transportenvironment.com. Transport Environment. September 15, 2020.\n\n^ \"Plug-in hybrid cars burn more fuel than test record, says Which?\". The Guardian. March 2, 2021.\n\n^ \"Plug-in hybrids in new emissions scandal as tests show higher pollution than claimed\". www.transportenvironment.org. Transport & Environment. November 23, 2020.\n\n^ \"Car companies are 'greenwashing' their plug-in hybrid vehicles\". www.thenextweb.com. The Next Web. May 31, 2021.\n\n^ \"Ricardo study demonstrates importance of whole life vehicle CO2 emissions\". www.ricardo.com. Ricardo. June 7, 2011.\n\n^ \"Unveiling the hybrid and \"self-charging\" myth\". www.irishevs.com. IrishEVs. July 15, 2020.\n\n^ \"Most Toyotas will still use gasoline in 2030, company says\". www.wsj.com. Wall Street Journal. May 12, 2021.\n\n^ \"Toyota's greenwashing conceals worsening fleet MPG, shows why they oppose MPG standards\". www.electrek.com. Electrek. October 31, 2019.\n\n^ \"Toyota's greenwashing leads to record $180m fine for emissions lies\". www.electrek.com. Electrek. January 14, 2021.\n\n^ \"Toyota to pay a record fine for a decade of clean air act violations\". The New York Times. January 14, 2021.\n\n^ \"Toyota to pay $180m for failing to report emissions defects\". www.abnews.com. ABC News. January 14, 2021.\n\n^ \"Claims about environmental benefits of hybrid vehicles 'greenwashing'\". www.irishexaminer.com. Irish Examiner. May 29, 2021.\n\n^ \"Irish Examiner view: Verification has huge role in climate wars\". www.irishexaminer.com. Irish Examiner. May 29, 2021.\n\n^ \"We Need To Talk About Toyota\". www.irishevs.com. IrishEVs. May 25, 2021.\n\n^ a b \"Overview\". Global website. Toyota Motor Corporation. March 31, 2014. Archived from the original on February 13, 2015. Retrieved February 6, 2015.\n\n^ Jacob, Vinod (August 18, 2006). \"In Toyota land\". The Hindu – Business Line. Archived from the original on July 21, 2010. Retrieved May 9, 2013.\n\n^ Greimel, Hans (May 6, 2013). \"Dreary HQ city is a handicap in global glitz plan\". Automotive News. Archived from the original on June 16, 2013. Retrieved May 9, 2013.\n\n^ a b \"Sales, Production, and Export Results | Profile | Company\". Toyota Motor Corporation Official Global Website. Retrieved November 17, 2020.\n\n^ \"Mazda and Toyota Establish Joint-Venture Company \"Mazda Toyota Manufacturing, U.S.A., Inc.\"\" (Press release). Mazda. Retrieved November 26, 2020.\n\n^ \"Is Toyota planning on introducing a diesel-powered vehicle?\". Toyota.com. Archived from the original on October 14, 2013. Retrieved October 12, 2013.\n\n^ \"Toyota's Woodstock plant opens\". Canadiandriver.com. December 4, 2008. Archived from the original on January 25, 2009. Retrieved July 25, 2009.\n\n^ Hinocanada.com Archived January 4, 2009, at the Wayback Machine\n\n^ \"Toyota's European manufacturing plants\". Toyota Motor Europe. Retrieved August 3, 2021.\n\n^ \"Toyota closes manufacturing operations\" (Press release). Australia: Toyota. October 3, 2017. Archived from the original on December 15, 2018. Retrieved December 13, 2018.\n\n^ Wallace, Rick; Ferguson, John (February 10, 2014). \"Toyota to stop making cars in Australia, follows Ford and Holden\". The Australian. Archived from the original on April 28, 2014. Retrieved February 14, 2014.\n\n^ \"Toyota for investors, Frequently Asked Questions\". Japan: Toyota Motor Corporation. February 2, 2007. Archived from the original on June 17, 2008. Retrieved July 2, 2008.\n\n^ \"Toyota Way 2001\". 75 Years of TOYOTA. Retrieved August 3, 2021.\n\n^ Liker, Jeffrey (2004). \"The 14 Principles of the Toyota Way: An Executive Summary of the Culture Behind TPS\" (PDF). University of Michigan. p. 36. Archived from the original (PDF) on September 15, 2012. Retrieved March 25, 2021.\n\n^ Spear, Steven (January 1999). The Toyota Production System: An Example of Managing Complex Social/Technical Systems (Thesis). US: Harvard University. Archived from the original on September 27, 2019. Retrieved March 20, 2020.\n\n^ ibidem,  p. 11 ff.\n\n^ ibidem,  p. 25 ff.\n\n^ How Toyota Became #1: Leadership Lessons from the World's Greatest Car Company Archived January 1, 2016, at the Wayback Machine By David Magee. Penguin Group. 2007\n\n^ How Toyota Became #1: Leadership Lessons from the World's Greatest Car Company Archived January 1, 2016, at the Wayback Machine By David Magee. Penguin Group. 2007\n\n^ Kaizen Event Implementation Manual Archived January 1, 2016, at the Wayback Machine By Geoffrey L. Mika; 2006\n\n^ a b \"Toyota Logo History\". Carlogos.org. April 30, 2020. Retrieved August 6, 2021.\n\n^ New brand for Toyota Queensland Transport News October 26, 1989 page 11\n\n^ \"Company > Vision & Philosophy > Nov/Dec 2004\" (Press release). Japan: Toyota. Archived from the original on October 22, 2009. Retrieved October 31, 2009.\n\n^ \"Passion\" (Press release). Toyota. Archived from the original on August 12, 2011. Retrieved August 8, 2011.\n\n^ \"Crown Motors Ltd. (Hong Kong) Corporate Information\" (in Chinese). 2010. Archived from the original on February 17, 2010. Retrieved March 19, 2010.\n\n^ \"Toyota China\". Toyota.com.cn. Archived from the original on August 13, 2010. Retrieved September 11, 2010.\n\n^ Toyota headquarters image (cropped to show logo), September 7, 2012, retrieved August 6, 2021\n\n^ Kierstein, Alex (August 3, 2021). \"Toyota Celebrates the Land Cruiser's 70-Year Run\". MotorTrend. Retrieved August 6, 2021.\n\n^ \"IANA — Delegation Report for .toyota\".\n\n^ \"Commercial Partners | Cricket Australia\". www.cricketaustralia.com.au. Archived from the original on August 3, 2017. Retrieved August 2, 2017.\n\n^ Long, Michael (May 18, 2015). \"English cricketers to drive Toyotas under new ECB deal\". SportsPro. Retrieved August 2, 2017.\n\n^ \"Toyota signs on as premier partner for three more years – AFL.com.au\". afl.com.au. August 31, 2016. Archived from the original on August 3, 2017. Retrieved August 2, 2017.\n\n^ \"IOC Announces Toyota as TOP Partner to 2024\". Olympic News (Press release). March 13, 2015. Archived from the original on January 7, 2017. Retrieved January 7, 2017.\n\n\nExternal links[edit]\n\n\n\nWikimedia Commons has media related to Toyota Motor Corporation.\n\nOfficial website\nBusiness data for Toyota Motor Corp: SEC filings\n\n\nvteToyota Motor CorporationCurrent marques\nToyota\nDaihatsu (Perodua)\nLexus\nHino\nLeahead1\nRanz2\nFormer marques\nScion\nWiLL\nToyopet\nSubsidiariesAsia-Pacific\nToyota Motor East Japan\nCentral Motors3\nKanto Auto Works3\nToyota Motors Tohoku3\nToyota Motor Manufacturing Indonesia\nToyota Australia\nToyota Auto Body\nToyota Central R&D Labs\nToyota Kirloskar Motor\nToyota Motor Philippines\nToyota Motor Thailand\nHino Motors\nAfrica\nToyota Kenya\nToyota South Africa Motors\nAmericas\nToyota Argentina\nToyota do Brasil\nToyota Motor North America\nCalty Design Research\nToyota de Venezuela\nEurope\nToyota Motor Europe\nToyota Motor Manufacturing Czech Republic\nToyota Motor Manufacturing France\nToyota Gazoo Racing Europe\nToyota GB\nToyota Ireland\nToyota Motor Manufacturing Russia\nToyota Manufacturing UK\nToyota Motor Manufacturing Poland\nToyota Motor Manufacturing Turkey\nGlobal\nToyota Financial Services\nAffiliates\nSubaru Corporation (20%)\nMitsubishi Aircraft Corporation (10%)\nMazda (5%)\nSuzuki (4.9%)\nJoint ventures\nWiLL\nFAW Toyota (50%)\nGAC Toyota (50%)\nToyota-Astra Motor (50%)\nToyota Indus\nMazda Toyota Manufacturing USA (50%)\nNUMMI (defunct)\nUMW Toyota Motor (49%)\nToyota Motor Vietnam\nCurrent modelsKei cars\nC+pod\nCOMS\nCopen GR Sport\nPixis Epoch\nPixis Joy\nPixis Mega\nPixis Truck\nPixis Van\nCars\nAgya/Wigo\nAqua\nAvalon\nAygo\nCamry\nCentury\nCorolla\nAllion\nAltis\nAxio\nFielder\nCorolla Sport\nCorolla Touring\nLevin\nCrown\nEtios\nGlanza/Starlet\nGR 86\nGR Supra\nJPN Taxi\nMirai\nPasso\nPrius\nPrius PHV/Prime\nProbox\nVios\nYaris\nXP150\nXP210\nGR Yaris\nPickup trucks/Utilities\nHilux\nLand Cruiser 79 series\nTacoma\nTownAce Truck\nTundra\nSUVs/Crossovers\n4Runner\nbZ4X\nC-HR/IZOA\nCorolla Cross\nFJ Cruiser\nFortuner/SW4\nHarrier/Venza\nHighlander/Kluger\nLand Cruiser\n70 series\n300 series\nPrado\nRaize\nRAV4/Wildlander\nRush\nSequoia\nUrban Cruiser\nYaris Cross\nMinivans/Vans\nAlphard/Vellfire\nAvanza/Veloz\nCalya\nHiAce/GranAce/Majesty/Granvia\nHiMedic\nInnova\nNoah/Esquire/Voxy\nProAce\nProAce City\nRoomy\nRumion\nSienna\nSienta\nTownAce\nCommercial trucks\nDyna\nType 73 Medium Truck\nBuses\nCoaster\nSora\nDiscontinued  models\n1000\n1900\n2000\n2000GT\nAA\nAB\nAC\nAE\nAllex\nAltezza\nAristo\nAurion\nAuris/Corolla iM\nAvensis\nAvensis Verso\nBA\nBandeirante\nbB\nBelta\nBlade\nBlizzard\nBrevis\nBriska\nCaldina\nCami\nCamry Coupe\nCamry Solara\nCarina\nCarina E\nCarina ED\nCarina FF\nCarina Surf\nCarina II\nCelica\nCelica Camry\nCelica Supra\nCelica XX\nCelsior\nChaser\nClassic\nComfort\nCorolla Ceres\nCorolla II\nCorolla Levin\nCorolla Rumion\nCorolla Spacio\nCorolla Sprinter\nCorolla SR5\nCorolla Verso\nCorona\nCorona Absolute\nCorona Exsior\nCorona EXiV\nCorona Mark II\nCorona SF\nCorsa\nCressida\nCresta\nCrown Comfort\nCrown Majesta\nCurren\nCynos\nDA\nDuet\nEcho/Platz\nEstima/Previa\nFA\nFJ40\nFunCargo\nGaia\nGrand HiAce\nHilux Surf\nIpsum/Picnic\niQ\nIsis\nist\nKijang\nLexcen\nLight Stout\nLiteAce\nMacho\nMark II\nMark II Blit\nMark II Qualis\nMark X\nMark X ZiO\nMaster\nMasterAce\nMasterline\nMatrix\nMega Cruiser\nMiniAce\nModel F\nMR2\nMR-S\nNadia\nOpa\nOrigin\nPaseo\nPixis Space\nPorte/Spade\nPremio/Allion\nPrius c\nPrius v/+/α\nProgrès\nPronard\nPublica\nQuick Delivery\nRactis\nRaum\nRegius\nRevo\nRH\nRK\nRR\nSA\nSai\nSB\nScepter\nSD\nSera\nSF\nSG\nSoarer\nSolara\nSoluna\nSpace Cruiser\nSparky\nSports 800\nSportsVan\nSprinter\nSprinter Carib\nSprinter Cielo\nSprinter Marino\nSprinter Trueno\nStallion\nStarlet\nStout\nSu-Ki\nSucceed\nSunChaser\nSuper\nT100\nTamaraw\nTank\nTarago\nTercel\nTiara\nToyoAce\nVan\nVanWagon\nVerossa\nVerso\nVerso-S\nVienta\nVista\nVitz\nVoltz\nWindom\nWish\nYaris (DJ/DL)\nYaris Verso\nZelas\nConcepts and  prototypes\n1957 Sports\n4500GT\nA-BAT\nAlessandro Volta\nAuris HSD Full Hybrid Concept\nAvalon\nAXV-II\nToyota AXV-III\nAXV-IV\nbZ4X Concept\nCAL-1\nCamry TS-01\nCelica Cruising Deck\nCelica XYR\nCentury GT45\nC-HR concept\nCorona 1500S Convertible\nCorona 1900S Sporty Sedan\nCorona Sports Coupe\nCrown Convertible\nCS&S\nCX-80\nDMT\nDream Car\nDream Car Model\neCom\nElectronics Car\nES3\nEX-I\nEX-II\nEX-III\nEX-7\nEX-11\nF101\nF110\nF1/Ultimate Celica\nF3R\nFCHV\nFine-N\nFine-S\nFine-X\nFSC\nFT-1\nFT-86\nFT-CH\nFT-EV\nFT-HS\nFT-SX\nFTX\nFX-1\nFXV\nFXV-II\nFXS\nGTV\nHC-CV\nHybrid X\ni-foot\ni-real\ni-swing\ni-unit\nMarinetta\nMarinetta 10\nMotor Triathlon Race Car\nMP-1\nNLSV\nPM\nPod\nPrius c Concept\nPrius Custom Plus Concept\nProject Go\nPublica Sports\nRiN\nRSC\nRV-1\nRV-2\nRV-5\nSport\nSportivo Coupe\nSports 800 Gas Turbine Hybrid\nSports X\nStreet Affair\nSV-1\nSV-2\nSV-3\nTAC3\nUltra-Compact BEV\nVM180 Zagato\nWinglet\nX\nX-Runner\nBy year\n1935–1969\n1970–1979\n1980–1989\n1990–1999\n2000–2009\n2010–2019\n2020–2029\n\nMotorsports\nGazoo Racing (GR)\nFormula Toyota\nTOM'S\nToyota Racing Series\nToyota Finance 86 Championship\nToyota Team Australia\nToyota Team Europe\nToyota Racing (Formula One team)\nToyota Racing Development\nOther\nToyota Group\nList\nvehicles\nengines\ntransmissions\nmanufacturing facilities\nmodel codes\nDealerships (Japan)\nHybrid Synergy Drive\nToyota bZ series\nToyota New Global Architecture\nG-Book telematics\nEntune Telematics\nTTC\nToyota flowers\n.toyota\n\n1A brand of GAC Toyota\n2A brand of FAW Toyota\n3Defunct companies merged into Toyota Motor East Japan\n Category\n Commons\n\nToyota Navigational boxes\nvteToyopet / Toyota road car timeline, Japanese market, 1980–present\n\n\nType\n\n1980s\n\n1990s\n\n2000s\n\n2010s\n\n2020s\n\n\nModel year\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n\n\nSubcompact car\n\n\n\n\n\n\n\nPasso M300\n\nPasso M600\n\nPasso M700\n\n\n\n\nStarlet KP60\n\nStarlet KP70\n\nStarlet KP80\n\nVitz XP10\n\nVitz XP90\n\nVitz XP130\n\nYaris XP210\n\n\n\n\n\n\nStarlet KP90\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAqua NHP10\n\n\n\n\nCorolla II L20\n\nCorolla II L30\n\nCorolla II L40\n\nCorolla II L50\n\nPlatz\n\nBelta\n\n\n\n\n\n\n\n\nCorsa L20\n\nCorsa L30\n\nCorsa L40\n\nCorsa L50\n\n\n\n\n\n\n\n\n\n\n\n\nCorolla FX E80\n\nCorolla FX E90\n\nCorolla FX E100\n\n\n\n\n\nCorolla RunX\n\nAuris E150\n\nAuris E180\n\nCorolla Sport E210\n\n\nSprinter E70\n\nSprinter E80\n\nSprinter E90\n\n\n\n\n\nAllex\n\nBlade\n\n\n\n\n\n\n\n\nSprinter Trueno E80\n\n\n\n\n\nSprinter Marino\n\n\n\n\n\n\n\n\n\n\nCorolla E70\n\nCorolla E80\n\nCorolla E90\n\n\n\n\n\n\n\n\n\n\nCorolla Levin E70\n\nCorolla Levin E80\n\nCorolla Levin E90\n\n\n\n\n\n\n\n\n\n\nSubcompact wagon\n\nCorolla E70\n\n\n\n\n\nFuncargo\n\nRactis XP100\n\nRactis XP120\n\n\n\n\n\n\n\n\n\n\nbB XP30\n\nbB QNC20\n\nTank/Roomy M900\n\n\nSubcompact SUV/crossover\n\n\n\n\n\nCami J100\n\nRush J200\n\n\n\nRaize A200\n\n\n\n\n\n\n\n\nist XP60\n\nist XP110\n\n\n\nYaris Cross\n\n\n\n\n\n\n\n\nVoltz\n\n\n\n\n\nC-HR\n\n\nCompact car\n\n\n\n\n\nCorolla E100\n\nCorolla E110\n\nCorolla E120\n\nCorolla E140\n\nCorolla E160\n\nCorolla E210\n\n\nCorona T130\n\nCorona T150\n\nCorona T170\n\nCorona T190\n\nCorona T210\n\nCorona Premio\n\nPremio\n\n\n\n\nCorona EXIV\n\nCorona EXIV\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCynos\n\nCynos\n\n\n\n\n\n\n\n\nCelica Camry A40\n\nCamry V10\n\nCamry V20\n\nCamry V30\n\nCamry V40\n\n\n\n\n\nAvensis T250\n\nAvensis T270\n\nCamry XV70\n\n\n\n\nVista V10\n\nVista V20\n\nVista V30\n\nVista V40\n\nVista V50\n\n\n\n\n\n\n\n\n\n\n\n\nPrius XW10\n\nPrius XW11\n\nPrius XW20\n\nPrius XW30\n\nPrius XW50\n\n\nCompact luxury car\n\n\n\n\n\nAltezza\n\n\n\n\n\n\n\n\n\n\n\n\nProgress\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBrevis\n\n\n\n\n\n\n\n\nCompact wagon\n\n\n\n\n\nAltezza Gita\n\n\n\n\n\n\n\n\n\n\n\n\nCorolla E100\n\n\n\n\n\n\n\n\n\n\n\n\nCarina Surf\n\nCaldina T190\n\nCaldina T210\n\nCaldina T240\n\n\n\n\n\n\n\n\nCompact SUV/crossover\n\n\n\n\n\nRAV4 XA10\n\nRAV4 XA20\n\nRAV4 XA30\n\n\n\nRAV4 XA50\n\n\n\n\n\n\nVanguard XA30\n\n\n\n\nCompact luxury crossover\n\n\n\n\n\nHarrier XU10\n\nHarrier XU30\n\nHarrier XU60\n\nHarrier XU80\n\n\nMid-size car\n\n\n\n\n\nCamry XV20\n\nCamry XV30\n\nCamry XV40\n\n\n\n\n\n\n\n\n\n\nScepter\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWindom XV10\n\nWindom XV20\n\nWindom XV30\n\n\n\n\n\n\n\n\n\n\n\n\nAristo S140\n\nAristo S160\n\nMark X X120\n\nMark X X130\n\n\n\n\nMark II X60\n\nMark II X70\n\nMark II X80\n\nMark II X90\n\nMark II X100\n\nMark II X110\n\n\n\n\nMid-size sport\n\nChaser X60\n\nChaser X70\n\nChaser X80\n\nChaser X90\n\nChaser X100\n\nVerossa X110\n\n\n\n\nMid-size luxury\n\nCresta X60\n\nCresta X70\n\nCresta X80\n\nCresta X90\n\nCresta X100\n\n\n\n\nMid-size wagon\n\nMark II X60\n\nMark II X70\n\nMark II Qualis XV20\n\nMark II Blit X110\n\nMark X Zio AA10\n\n\n\n\n\n\n\n\n\n\nCamry Gracia XV20\n\n\n\n\n\n\n\n\nFull-size\n\nCrown S110\n\nCrown S120\n\nCrown S130\n\nCrown S130/S140\n\nCrown S150\n\nCrown S170\n\nCrown S180\n\nCrown S200\n\nCrown S210\n\nCrown S220\n\n\n\n\nCelsior XF10\n\nCelsior XF20\n\nCelsior XF30\n\n\n\n\n\n\n\n\nMid-size SUV/crossover\n\n\n\n\n\nKluger XU20\n\n\n\n\n\n\n\n\n\n\nHilux Surf N60\n\nHilux Surf N120\n\nHilux Surf N180\n\n\n\n\n\n\n\n\nFlagship car\n\nCentury G35\n\nCentury G40\n\nCentury G50\n\n\n\nCentury G60\n\n\nSport compact\n\nCelica A40\n\nCelica A60\n\nCelica T160\n\nCelica T180\n\nCelica T200\n\nCelica T230\n\n\n\n\n\n\n\n\nCarina A40\n\nCarina A60\n\n\n\n\n\nCavalier\n\n\n\n\n\n\n\n\n\n\nCarina T150\n\nCarina T170\n\nCarina T190\n\nCarina T210\n\nAllion T240\n\nAllion T260\n\n\n\n\nCarina ED T160\n\nCarina ED T180\n\nCarina ED T200\n\n\n\n\n\n\n\n\n\n\nSports\n\n\n\nSoarer Z10\n\nSoarer Z20\n\nSoarer Z30\n\nSoarer Z40\n\n\n\n\n\n\n\n\nCelica XX A40\n\nCelica XX A60\n\nSupra A70\n\nSupra A80\n\n\n\n\n\nSupra J29\n\n\nRoadster\n\n\n\nMR2 W10\n\n\n\nMR2 W20\n\n\n\nMR-S W30\n\n\n\n\n\n\n\n\nLimited edition\n\n\n\nSera\n\nClassic\n\nOrigin\n\n\n\n\n\n\n\n\nvte« previous — Toyota road car timeline, North American market, 1980–2009 (model years) — next »\n\n\nType\n\n1980s\n\n1990s\n\n2000s\n\n\nModel year\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n\nSubcompact\n\nTercel\n\nTercel\n\nTercel\n\nTercel\n\nTercel\n\n\n\nEcho\n\n\n\nYaris Sedan\n\n\n\n\nTercel 4WD Wagon\n\n\n\n\n\n\n\nYaris Liftback\n\n\n\n\nStarlet\n\n\n\nCorolla FX\n\n\n\n\n\n\n\n\nCorolla\n\nCorolla\n\nCorolla\n\n\n\n\n\nPrius\n\n\n\n\nCompact\n\n\n\n\n\nCorolla\n\nCorolla\n\nCorolla\n\nCorolla\n\n\n\n\n\n\n\n\nMatrix\n\nMatrix\n\n\nCorona\n\nCamry\n\nCamry\n\n\n\n\n\nPrius\n\n\nMid-size\n\nCressida\n\nCressida\n\nCressida\n\nCressida\n\n\n\nCamry Solara\n\nCamry Solara\n\n\n\n\n\n\n\n\nCamry\n\nCamry\n\nCamry\n\nCamry\n\n\nFull-size\n\n\n\n\n\nAvalon\n\nAvalon\n\nAvalon\n\n\nSport compact\n\n\n\nCorolla SR5/GT-S\n\nCorolla SR5/GT-S\n\nPaseo\n\nPaseo\n\nPaseo(C)\n\n\n\n\nCelica\n\nCelica\n\nCelica\n\nCelica\n\nCelica\n\nCelica\n\n\n\n\n\n\nSports car\n\nCelica Supra\n\nCelica Supra\n\n\n\n\n\n\n\n\n\n\nSupra\n\nSupra\n\n\n\n\n\n\n\n\nMR2\n\n\n\nMR2\n\n\n\nMR2 Spyder\n\n\n\n\nLegend/Notes\n\n\n     (C) Vehicles exclusive to Canada\n\n\nvte« previous — Toyota road car timeline, North American market, 2010–present (model years)\n\n\nType\n\n2010s\n\n2020s\n\n\nModel year\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n1\n2\n\n\nSubcompact\n\nYaris Sedan\n\nYaris Sedan(M)\n\nYaris Sedan(M)\n\n\n\n\nYaris HB(M)\n\n\nYaris Liftback\n\nYaris Liftback\n\nYaris Liftback(C)\n\nYaris Hatchback(C+US)\n\n\n\n\n\n\nYaris iA/R/Sedan\n\n\n\n\n\n\nPrius c\n\nPrius c(M)\n\n\n\n\nCompact\n\nCorolla\n\nCorolla\n\nCorolla\n\n\nMatrix\n\n\n\nCorolla iM\n\nCorolla Hatchback\n\n\nPrius\n\nPrius\n\n\n\n\nPrius Plug-in Hybrid\n\nPrius Prime\n\n\nMid-size\n\n\n\nPrius v\n\n\n\n\n\n\nCamry\n\nCamry\n\nCamry\n\n\n\n\nMirai(C+US)\n\nMirai(C+US)\n\n\nFull-size\n\nAvalon\n\nAvalon\n\nAvalon\n\n\nSports car\n\n\n\n86\n\n\n\nGR 86\n\n\n\n\n\n\nGR Yaris(M)\n\n\n\n\nSupra\n\n\nLegend/Notes\n\n\n     (M) Vehicles exclusive to Mexico\n     (C) Vehicles exclusive to Canada\n     (C+US) Vehicles exclusive to Canada and U.S.\n\n\nvteToyota light truck timeline, North American market, 1980s–present (model years)\n\n\nType\n\n1980s\n\n1990s\n\n2000s\n\n2010s\n\n2020s\n\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n1\n2\n\n\nSubcompact crossover\n\n\n\n\n\nRAV4 (XA10)\n\nRAV4 (XA20)\n\n\n\n\n\nC-HR (AX10)\n\n\nCompact crossover\n\n\n\n\n\n\n\n\n\n\n\nCorolla Cross\n\n\n\n\n\n\n\n\nRAV4 (XA30)\n\nRAV4 (XA40)\n\nRAV4 (XA50)\n\n\nMid-size crossover\n\n\n\n\n\n\n\nVenza (AV10)\n\n\n\n\n\nVenza (XU80)\n\n\n\n\n\n\n\n\nHighlander (XU20)\n\nHighlander (XU40)\n\nHighlander (XU50)\n\nHighlander (XU70)\n\n\nCompact SUV\n\n\n\n4Runner (N60)\n\n4Runner (N120/N130)\n\n4Runner (N180)\n\n\n\nFJ Cruiser (XJ10)\n\n\n\n\n\n\nMid-size SUV\n\n\n\n\n\n\n\n4Runner (N210)\n\n4Runner (N280)\n\n\nFull-size SUV\n\nLand Cruiser (J60)\n\nLand Cruiser (J80)\n\nLand Cruiser (J100)\n\nLand Cruiser (J200)\n\n\n\n\n\n\n\n\n\n\nSequoia (XK30/XK40)\n\nSequoia (XK60)\n\n\nMinivan\n\n\n\nVan (R20/R30)\n\n\n\nPrevia (XR10)\n\nSienna (XL10)\n\nSienna (XL20)\n\nSienna (XL30)\n\nSienna (XL40)\n\n\nPickup\n\nPickup (N30/N40)\n\nPickup (N50/N60/N70)\n\nPickup (N80/N90/N100/N110)\n\nTacoma (N140/N150/N160/N170/N190)\n\nTacoma (N220/N240/N250/N260/N270)\n\nTacoma (N300)\n\n\n\n\n\n\nT100 (XK10/XK20)\n\n\n\nTundra (XK30/XK40)\n\nTundra (XK50)\n\nTundra (XK70)\n\n\nvteToyota vehicle timeline, United Kingdom market, 2000–present (model years)\n\n\nType\n\n2000s\n\n2010s\n\n2020s\n\n\nModel year\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n1\n\n\nA-segment\n\n\n\nAygo\n\nAygo\n\n\n\n\niQ\n\n\n\n\n\n\nB-segment\n\nYaris\n\nYaris\n\nYaris\n\nYaris\n\n\nC-segment\n\nCorolla\n\nCorolla\n\nAuris\n\nAuris\n\nCorolla\n\n\nPrius\n\n\n\n\n\n\n\n\nD-segment\n\n\n\nPrius\n\nPrius\n\nPrius\n\n\nAvensis\n\nAvensis\n\nAvensis\n\n\n\n\n\n\nCamry\n\n\n\n\n\nCamry\n\n\n\n\n\n\nMirai\n\nMirai\n\n\nB-segment crossover SUV\n\n\n\nUrban Cruiser\n\n\n\nYaris Cross\n\n\n\n\n\n\nC-HR\n\n\nRAV4\n\n\n\n\n\n\n\n\nC-segment crossover SUV\n\n\n\nRAV4\n\nRAV4\n\nRAV4\n\n\nD-segment crossover SUV\n\n\n\n\n\n\n\nHighlander\n\n\nF-segment SUV\n\nLand Cruiser Colorado\n\nLand Cruiser\n\nLand Cruiser\n\n\nLand Cruiser Amazon\n\n\n\n\n\n\n\n\nC-segment pickup truck\n\nHilux\n\n\n\n\n\n\n\n\nD-segment pickup truck\n\n\n\nHilux\n\nHilux\n\n\nMini MPV\n\nYaris Verso\n\n\n\n\n\n\n\n\nCompact MPV\n\n\n\nCorolla Verso\n\nCorolla Verso\n\nVerso\n\n\n\n\n\n\nPicnic\n\nAvensis Verso\n\n\n\n\n\nPrius+\n\n\n\n\nLarge MPV\n\nPrevia\n\n\n\n\n\nProace Verso\n\n\nCompact van\n\n\n\n\n\nProace City\n\n\nMedium van\n\nHiace\n\nProace\n\nProace\n\n\nSports car\n\nCelica\n\n\n\n\n\nGT86\n\nGR 86\n\n\n\n\n\n\n\n\nGR Supra\n\n\nMR2\n\n\n\n\n\n\n\n\n\nvte« previous — Toyota road cars timeline, international markets, 1985–2014 — next »\nSee also\nLight truck/SUV/crossover\nVan/minivan\n\n\n\nType\n\n1980s\n\n1990s\n\n2000s\n\n2010s\n\n\nCalendar year\n\n5\n6\n7\n8\n9\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n1\n2\n3\n4\n\n\nKei car\n\n\n\n\n\n\n\n\n\nPixis Epoch LA300\n\n\n\n\n\n\n\n\n\n\nPixis Space L575\n\n\nSubcompact car\n\n\n\n\n\n\n\niQ AJ10\n\n\n\n\n\n\n\n\nPorte AP10\n\nPorte/Spade XP140\n\n\n\n\n\n\n\n\n\n\nAgya/Wigo B100\n\n\n\n\n\n\n\n\nAygo AB10\n\nAygo AB40\n\n\n\n\n\n\nDuet M100\n\nPasso AC10\n\nPasso AC30\n\n\n\n\n\n\n\n\n\n\nEtios AK10\n\n\nStarlet P70\n\nStarlet P80\n\nStarlet P90\n\nVitz/Yaris XP10\n\nVitz/Yaris XP90\n\nVitz/Yaris XP130\n\n\n\n\n\n\n\n\n\n\nYaris XP150\n\n\n\n\n\n\nSoluna L50\n\nVios XP40\n\nBelta/Vios/Yaris sedan XP90\n\nVios/Yaris sedan/Yaris Ativ XP150\n\n\nTercel/Corolla II/Corsa L20\n\nTercel/Corolla II/Corsa L30\n\nTercel/Corolla II/Corsa L40\n\nTercel/Corolla II/Corsa L50\n\nPlatz/Yaris sedan/Echo XP10\n\n\n\n\n\n\n\n\n\n\n\n\nAqua/Prius C XP10\n\n\nSprinter Carib L20\n\n\n\n\n\nFunCargo XP20\n\nRactis XP100\n\nRactis/Verso-S XP120\n\n\n\n\n\n\nbB XP30\n\nbB QNC2x\n\n\n\n\n\n\n\n\nCorolla Rumion/Rukus E150\n\n\nCompact car\n\nCorolla/SprinterE80\n\nCorolla/SprinterE90\n\nCorolla/SprinterE100\n\nCorolla/SprinterE110\n\nCorollaE120/130\n\nCorolla E140/E150\n\nCorolla E170/E180\n\n\nCorolla Axio E140\n\nCorolla Axio E160\n\n\n\n\n\n\n\n\nAllex E120\n\nAuris E150\n\nAuris E180\n\n\nCorolla FX E80\n\nCorolla FX E90\n\nCorolla FX E100\n\n\n\n\n\nCorolla RunX E120\n\n\n\n\n\n\n\n\n\n\nCynos/Paseo L40\n\nCynos/Paseo L50\n\n\n\n\n\n\n\n\n\n\nPrius XW10\n\nPrius XW11\n\nPrius XW20\n\nPrius XW30\n\n\nCompact luxury car\n\n\n\n\n\nAltezza XE10\n\nBlade E150\n\n\n\n\n\n\nCorona EXIV T180\n\nCorona EXIV T200\n\nProgrès XG10\n\n\n\nSai AZK10\n\n\nCarina ED ST160\n\nCarina ED ST180\n\nCarina ED ST200\n\nBrevis XG10\n\n\n\n\nCompact wagon\n\nCorolla Van (wagon) E70\n\nCorolla Van (wagon) E90\n\nCorolla Van (wagon) E100\n\n\n\n\n\n\n\n\n\n\nCorolla Fielder E120\n\nCorolla Fielder E140\n\nCorolla Fielder E160\n\n\n\n\nSprinter Carib E90\n\nSprinter Carib E110\n\n\n\n\n\n\n\n\n\n\nAltezza Gita XE10\n\n\n\n\n\n\n\n\n\n\nNadia XN10\n\nOpa XT10\n\n\n\n\n\n\nCarina Surf T150\n\nCarina Surf T170\n\nCaldina T190\n\nCaldina T210\n\nCaldina T240\n\n\n\n\n\n\nMid-size car\n\nCorona T150\n\nCorona T170\n\nCorona T190\n\nCorona T210\n\nPremio T240\n\nPremio T260\n\n\n\n\nCorona EXIV T180\n\nCorona EXIV T200\n\n\n\n\n\n\n\n\n\n\n\n\nCamry Solara XV20\n\nCamry Solara XV30\n\n\n\n\n\n\n\n\n\n\nAvensis T220\n\nAvensis T250\n\nAvensis T270\n\n\nCamry/Vista V10\n\nCamry/Vista V20\n\nCamry/Vista V30\n\nCamry/Vista V40\n\nCamry/Vista V50\n\n\n\n\n\n\n\n\n\n\nScepter/Camry XV10\n\nCamry XV20\n\nCamry XV30\n\nCamry XV40\n\nCamry XV50\n\n\n\n\n\n\n\n\nWindom XV10\n\nWindom XV20\n\nWindom XV30\n\nAurion XV40\n\nAurion XV50\n\n\nMark II/Cressida/Chaser/Cresta X70\n\nMark II/Cressida/Chaser/Cresta X80\n\nMark II/Chaser/Cresta X90\n\nMark II/Chaser/Cresta X100\n\nMark II/Verossa X110\n\nMark X X120\n\nMark X X130\n\n\n\n\n\n\nAristo S140\n\nAristo S160\n\n\n\n\n\nMirai JPD10\n\n\nMid-size wagon\n\nMark II Wagon X70\n\nMark II Qualis XV20\n\nMark II Blit X110\n\nMark X ZiO AA10\n\n\n\n\n\n\n\n\nCamry Gracia XV20\n\n\n\n\n\n\nFull-size car\n\n\n\n\n\nAvalon XX10\n\nAvalon XX20\n\nAvalon XX30\n\nAvalon XX40\n\n\n\n\nLexcen T1/T2/T3/T4/T5\n\n\n\n\n\n\n\n\nCrown S120\n\nCrown S130\n\nCrown S140\n\nCrown S150\n\nCrown S170\n\nCrown S180\n\nCrown S200\n\nCrown S210\n\n\n\n\n\n\nCrown Majesta S140\n\nCrown Majesta S150\n\nCrown Majesta S170\n\nCrown Majesta S180\n\nCrown Majesta S200\n\nCrown Majesta S210\n\n\n\n\nCelsior XF10\n\nCelsior XF20\n\nCelsior XF30\n\n\n\n\n\n\nLimousine\n\nCentury G40\n\nCentury G50\n\n\nSport compact car\n\nCelica A60\n\nCelica T160\n\nCelica T180\n\nCelica T200\n\nCelica T230\n\n\n\n\n\n\n\n\n\n\nCurren T200\n\n\n\n\n\n\n\n\nCarina A60\n\n\n\n\n\nCavalier TJG00\n\n\n\n\n\n\nCarina T150\n\nCarina T170\n\nCarina T190\n\nCarina T210\n\nAllion T240\n\nAllion T260\n\n\nCarina ED T160\n\nCarina ED T180\n\nCarina ED T200\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nZelas AT20\n\n\nSports car\n\n\n\n\n\n\n\n\n\n86 ZN6\n\n\nCelica Supra A60\n\nSupra A70\n\nSupra A80\n\n\n\n\n\n\nGrand tourer\n\nSoarer Z10\n\nSoarer Z20\n\nSoarer Z30\n\nSoarer Z40\n\n\n\n\n\n\nRoadster\n\nMR2 W10\n\n\n\nMR2 W20\n\n\n\nMR-S W30\n\n\n\n\n\n\nTaxi\n\n\n\n\n\nCrown Comfort XS10\n\n\nLimited edition\n\n\n\n\n\nSera EXY10\n\nClassic YN86\n\nOrigin JCG17\n\n\n\n\n\n\n\n\n5\n6\n7\n8\n9\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n1\n2\n3\n4\n\n\n1980s\n\n1990s\n\n2000s\n\n2010s\n\n\nLegend/Notes\n\n\n     Non-Toyota platform\n\n\nvteLexus, a division of Toyota Motor Corporation, vehicle production timeline\n\n\nType\n\nLine\n\n1980s\n\n1990s\n\n2000s\n\n2010s\n\n2020s\n\n\n9\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n0\n1\n\n\nCompact\n\nCT\n\n\n\n\n\n\n\n\n\nZWA10\n\n\nHS\n\n\n\n\n\n\n\nANF10\n\n\n\n\n\n\nIS\n\n\n\n\n\nXE10\n\nXE20\n\nXE30\n\n\nMid-size\n\nES\n\n\n\nV20\n\nXV10\n\nXV20\n\nXV30\n\nXV40\n\nXV60\n\nXZ10\n\n\nGS\n\n\n\n\n\nS140\n\nS160\n\nS190\n\nL10\n\n\n\n\nFull-size\n\nLS\n\n\n\nXF10\n\nXF20\n\nXF30\n\nXF40\n\nXF50\n\n\nCrossover\n\nUX\n\n\n\n\n\n\n\n\n\nZA10\n\n\nNX\n\n\n\n\n\n\n\n\n\nAZ10\n\nAZ20\n\n\nRX\n\n\n\n\n\nXU10\n\nXU30\n\nAL10\n\nAL20\n\n\nSUV\n\nGX\n\n\n\n\n\n\n\nJ120\n\nJ150\n\n\nLX\n\n\n\n\n\nJ80\n\nJ100\n\nJ200\n\nJ300\n\n\nCoupé\n\nIS C\n\n\n\n\n\n\n\nXE20\n\n\n\n\n\n\nRC\n\n\n\n\n\n\n\n\n\nXC10\n\n\nSC\n\n\n\n\n\nZ30\n\nZ40\n\n\n\n\n\n\nLC\n\n\n\n\n\n\n\n\n\nXZ100\n\n\nLFA\n\n\n\n\n\n\n\n\n\nLFA10\n\n\n\n\n\n\nMinivan\n\nLM\n\n\n\n\n\n\n\n\n\nAH30\n\n\nvte Panasonic Toyota Racing\nPersonnel\nOve Andersson\nGustav Brunner\nJohn Howett\nMike Gascoyne\nJan Monchaux\nJulien Simon-Chautemps\nTsutomu Tomita\nPascal Vasselon\nTadashi Yamashina\nNoted drivers\n Timo Glock\n Kamui Kobayashi\n Cristiano da Matta\n Allan McNish\n Olivier Panis\n Mika Salo\n Ralf Schumacher\n Jarno Trulli\n Ricardo Zonta\nFormula One cars\nTF101\nTF102\nTF103\nTF104\nTF104B\nTF105\nTF105B\nTF106\nTF106B\nTF107\nTF108\nTF109\nTF110\n\nvteToyota sportscar racers (1968–present)Group 7 (1968–1970)\n7\nGroup 5 (1977–1982)\nCelica LB Turbo\nTOM'S Corolla G5\nDome Celica Turbo\nGroup C (1982–1993)\nTOM'S Celica C\n82C\n83C\n84C\n85C\n86C\n87C\n88C\n88C-V\n89C-V\n90C-V\n91C-V\n92C-V\nTS010\n93C-V\nIMSA GTP (1988–1993)\nMk. I\n88C\nHF89\nMkIII\nGT1 / LMGTP / LMP / LMH (1994–)\n94C-V\nTOM'S LMP\nGT-One (TS020)\nTS030 Hybrid\nTS040 Hybrid\nTS050 Hybrid\nGR010 Hybrid\n\nvte Automotive industry in Japan\nAutomotive industry\nEconomy of Japan\nTransport in Japan\nCompaniesVehicle producers\nAspark\nASL\nDuesen Bayern\nGLM\nHonda\nAcura\nMarusho\nIsuzu\nUD Trucks\nJiotto\nKawasaki\nKawasaki Motorcycle & Engine\nMazda\nAmati\nAutozam\nẼfini\nEunos\nM2\nXedos\nMitsubishi\nMitsubishi Heavy Industries\nMitsubishi Motors (66%)\nMitsubishi Fuso (10.71%)\nMitsuoka\nNissan\nCony\nDatsun\nInfiniti\nKurogane\nOhta\nOtomo\nPrince\nShatai\nTama\nSubaru Corporation\nBlitzen\nSubaru\nSuzuki\nHope\nTajima\nTakeoka\nToyota\nDaihatsu\nScion\nLexus\nHino\nWiLL\nYamaha\nActive factories\nToyota Factories\nDefunct factories\nZama\nComponents\nAisin Seiki\nAkebono Brake\nBridgestone\nCalsonic Kansei\nClarion\nDenso\nFujitsu Ten\nGS Yuasa\nHitachi\nHKS\nIHI Corporation\nJatco\nJECS\nJTEKT\nKawasaki\nKayaba Industry\nKeihin Corporation\nMabuchi Motor\nMikuni\nMitsuba Corporation\nNachi-Fujikoshi\nNGK\nNHK Spring\nNidec\nNisshinbo\nNissin Kogyo\nNSK\nNTN Corporation\nPIAA\nShindengen Electric Manufacturing\nSHOWA Corporation\nStanley Electric\nSumitomo Riko\nSumitomo Rubber Industries\nTakata Corporation\nTHK\nTokico\nTopre\nTopy Industries\nToyo Tire & Rubber Company\nToyota Boshoku\nTsubakimoto Chain\nYanmar\nYazaki Corporation\nYokohama Rubber Company\nZexel\nMotorsport andtuners\n5Zigen\nActive\nA'PEXi\nAmuse\nAutech\nAutoSelect\nBlitz\nBomex\nCar Make T&E\nCentral 20\nDome\nEnkei\nEsprit\nGarage Fukui SPL\nGReddy\nHKS\nHonda Racing F1\nI-mac\nImpul\nJAM\nJUN Auto\nKansai Service\nKojima\nKuhl Racing\nMazdaspeed\nMine's\nMugen Motorsports\nNismo\nRalliart\nRauh-Welt Begriff\nRays Engineering\nRE Amemiya\nRS Watanabe\nSARD\nSpoon Sports\nSubaru Tecnica International\nTanabe\nSpeed Star Racing\nTein\nToda Racing\nTomei\nTommykaira\nTop Fuel\nTop Secret\nTOM'S\nToyota Gazoo Racing\nToyota Racing Development\nUras\nVaris\nVeilside\nWALD International\nWedsSport\nWORK Wheels\nYashio Factory\nServices\nAutobacs Seven\nYanase Imported Cars\nRelated topics\nJapan Automobile Manufacturers Association\nTokyo Motor Show\nTokyo Auto Salon\nUsed vehicle exporting\nJ-NCAP\nNational Highway\nExpressways\n\n Category\n Commons\nNote: defunct companies and marques above are shown in italics\n\nvteBus manufacturing companies of AsiaActive\nAnkai\nAshok Leyland\nBharatBenz\nBonluck Bus\nBYD Auto\nDaewoo Bus\nEicher Motors\nForce\nFoton\nGanja Auto Plant\nGemilang Coachworks\nGhandhara\nGAG Bus\nHICOM AM\nHindustan\nHuanghai Bus\nHyundai Motor Group\nHyundai Motor Company\nKia Corporation\nFujian Motors Group\nKing Long\nXiamen Golden Dragon\nHiger Bus\nIran Khodro Diesel\nIsuzu\nJAC\nLaksana\nMahindra\nMahindra Navistar\nSsangYong\nMaster\nMitsubishi Fuso\nMudan\nNissan\nNanjing Golden Dragon Bus\nSaipa Diesel\nSHL Coach\nSunlong Bus\nSwaraj Mazda\nTata\nTata Daewoo\nTata Marcopolo\nToyota\nHino\nHinopak\nUD Trucks\nVinFast\nZhongtong Bus\nDefunct\nBakAZ\nChangzhou Changjiang\nFuji Heavy Industries\nGhandhara Nissan\nSamsung\n\nvte Nikkei 225 companies of Japan\n7&i\nAdvantest\nÆON\nAGC\nAjinomoto\nAlps\nANA\nAmada\nAozora Bank\nAsahi Breweries\nAsahi Kasei\nAstellas\nBandai Namco Holdings\nBridgestone\nCanon\nCasio\nChiba Bank\nChiyoda\nChuden\nChugai\nCitizen Holdings\nComsys\nConcordia Financial\nCredit Saison\nDai-ichi Life\nDaiichi Sankyo\nDaikin\nDainippon Screen\nDainippon Sumitomo Pharma\nDaiwa House\nDaiwa Securities\nDenka\nDenso\nDentsu\nDNP\nDowa\nEbara\nEisai\nEneos\nFanuc\nFast Retailing\nFuji Electric\nFujifilm\nFujikura\nFujitsu\nFukuoka Financial\nFurukawa Group\nFurukawa Electric\nGS Yuasa\nHeiwa Real Estate\nHino\nHitachi\nHitachi Construction Machinery\nHitz\nHokuetsu Paper\nHonda\nIHI\nINPEX\nIsetan-Mitsukoshi\nIsuzu\nItochu\nJFE\nJ. Front Retailing\nJGC\nJR Central\nJR East\nJR West\nJSW\nJT\nJTEKT\nKajima\nKEPCO\nKao\nKawasaki\nKDDI\nKeio\nKeisei\nKeyence\nKikkoman\nKirin\nK Line\nKobelco\nKomatsu\nKonami\nKonica Minolta\nKubota\nKuraray\nKyocera\nKyowa Hakko Kirin\nMarubeni\nMaruha Nichiro\nMarui\nMatsui Securities\nMazda\nMeidensha\nMeiji Holdings\nMES\nMinebea\nMitsubishi Chemical\nMitsubishi Corporation\nMitsubishi Electric\nMitsubishi Estate\nMitsubishi Heavy Industries\nMitsubishi Logistics\nMitsubishi Materials\nMitsubishi Motors\nMitsui & Co\nMitsui Chemicals\nMitsui Fudosan\nMitsui Kinzoku\nMitsumi Electric\nMizuho\nMOL\nMS&AD\nMUFG\nMurata Manufacturing\nNEC\nNexon\nNEG\nNGK\nNichirei\nNikon\nNintendo\nNippon Express\nNippon Kayaku\nNippon Light Metal\nNippon Ham\nNippon Paper Industries\nNippon Soda\nNippon Suisan\nNissan Motor Company\nNissan Chemical\nNisshin Seifun\nNisshin Steel\nNittobo\nNitto Denko\nSompo Japan Nipponkoa Holdings\nNomura\nNSG\nNSK\nNSSMC\nNTN\nNTT\nNTT Data\nNYK\nObayashi\nOdakyu\nOji Holdings Corporation\nOKI\nOkuma\nOlympus\nOsaka Gas\nPacific Metals\nPanasonic\nPioneer\nResona\nRicoh\nSapporo Holdings\nSecom\nSekisui House\nSharp\nShimz\nShin-Etsu\nShinsei Bank\nShionogi\nShiseido\nShizuoka Bank\nShowa Denko\nShowa Shell\nSoftBank\nSojitz\nSony\nSubaru Corporation\nSUMCO\nSumitomo Chemical\nSumitomo Corporation\nSumitomo Electric\nSumitomo Heavy Industries\nSumitomo Metal Mining\nSumitomo Mitsui Financial\nSumitomo Mitsui Trust\nSumitomo Osaka Cement\nSumitomo Realty\nSuzuki\nT&D\nTaiheiyo Cement\nTaisei\nTaiyo Yuden\nTakara\nTakashimaya\nTakeda\nTDK\nTeijin\nTEPCO\nTerumo\nTobu\nToho\nToho Zinc\nTokai Carbon\nTokuyama Corporation\nTokio Marine\nTokyo Dome\nTokyo Electron\nTokyo Gas\nTokyo Tatemono\nTokyu\nTokyu Land\nToppan\nToray\nToshiba\nTosoh\nToto\nToyobo\nToyota\nToyota Tsusho\nTrend Micro\nUbe\nUnitika\nUny\nYahoo! Japan\nYamaha\nYamato Transport\nYasakawa\nYokogawa Electric\nYokohama Rubber\n\nvteTOPIX 100 companies of JapanCore 30\nAstellas\nCanon\nDenso\nFANUC\nHitachi\nHonda\nJR Central\nJR East\nJT\nKDDI\nMitsubishi Corporation\nMitsubishi Estate\nMitsui & Co\nMitsui Fudosan\nMizuho\nMUFG\nMurata\nNissan\nNomura\nNTT\nNTT Docomo\nPanasonic\nSeven & i\nShin-Etsu\nSoftBank\nSony\nSumitomo Mitsui Financial\nTakeda\nTokio Marine\nToyota\nLarge 70\nÆON\nAjinomoto\nANA\nAsahi Breweries\nAsahi Kasei\nBandai Namco Holdings\nBridgestone\nChubu Electric Power\nConcordia Financial\nDai-ichi Life\nDaiichi Sankyo\nDaikin\nDaito Trust Construction\nDaiwa House\nDaiwa Securities\nEisai\nFast Retailing\nEneos Holdings\nFujifilm\nFujitsu\nHoya\nInpex\nIsuzu\nItochu\nJapan Airlines\nJR West\nJFE\nKao\nKEPCO\nKeyence\nKirin\nKomatsu\nKubota\nKyocera\nMarubeni\nMazda\nMitsubishi Chemical\nMitsubishi Electric\nMitsubishi Heavy Industries\nMS&AD\nNidec\nNintendo\nNitto Denko\nNippon Steel\nOno Pharmaceutical\nOriental Land\nOrix\nOsaka Gas\nOtsuka Pharmaceutical\nRakuten\nResona\nSecom\nSekisui House\nShionogi\nShiseido\nSMC\nSompo Holdings\nSubaru\nSumitomo Corporation\nSumitomo Electric\nSumitomo Metal Mining\nSumitomo Chemical\nSumitomo Mitsui Trust\nSumitomo Realty\nSuzuki\nT&D Holdings\nTokyo Electron\nTokyo Gas\nToray\nToshiba\nUnicharm\nYamato Transport\n\nvte Automotive industry in Japan\nAutomotive industry\nEconomy of Japan\nTransport in Japan\nCompaniesVehicle producers\nAspark\nASL\nDuesen Bayern\nGLM\nHonda\nAcura\nMarusho\nIsuzu\nUD Trucks\nJiotto\nKawasaki\nKawasaki Motorcycle & Engine\nMazda\nAmati\nAutozam\nẼfini\nEunos\nM2\nXedos\nMitsubishi\nMitsubishi Heavy Industries\nMitsubishi Motors (66%)\nMitsubishi Fuso (10.71%)\nMitsuoka\nNissan\nCony\nDatsun\nInfiniti\nKurogane\nOhta\nOtomo\nPrince\nShatai\nTama\nSubaru Corporation\nBlitzen\nSubaru\nSuzuki\nHope\nTajima\nTakeoka\nToyota\nDaihatsu\nScion\nLexus\nHino\nWiLL\nYamaha\nActive factories\nToyota Factories\nDefunct factories\nZama\nComponents\nAisin Seiki\nAkebono Brake\nBridgestone\nCalsonic Kansei\nClarion\nDenso\nFujitsu Ten\nGS Yuasa\nHitachi\nHKS\nIHI Corporation\nJatco\nJECS\nJTEKT\nKawasaki\nKayaba Industry\nKeihin Corporation\nMabuchi Motor\nMikuni\nMitsuba Corporation\nNachi-Fujikoshi\nNGK\nNHK Spring\nNidec\nNisshinbo\nNissin Kogyo\nNSK\nNTN Corporation\nPIAA\nShindengen Electric Manufacturing\nSHOWA Corporation\nStanley Electric\nSumitomo Riko\nSumitomo Rubber Industries\nTakata Corporation\nTHK\nTokico\nTopre\nTopy Industries\nToyo Tire & Rubber Company\nToyota Boshoku\nTsubakimoto Chain\nYanmar\nYazaki Corporation\nYokohama Rubber Company\nZexel\nMotorsport andtuners\n5Zigen\nActive\nA'PEXi\nAmuse\nAutech\nAutoSelect\nBlitz\nBomex\nCar Make T&E\nCentral 20\nDome\nEnkei\nEsprit\nGarage Fukui SPL\nGReddy\nHKS\nHonda Racing F1\nI-mac\nImpul\nJAM\nJUN Auto\nKansai Service\nKojima\nKuhl Racing\nMazdaspeed\nMine's\nMugen Motorsports\nNismo\nRalliart\nRauh-Welt Begriff\nRays Engineering\nRE Amemiya\nRS Watanabe\nSARD\nSpoon Sports\nSubaru Tecnica International\nTanabe\nSpeed Star Racing\nTein\nToda Racing\nTomei\nTommykaira\nTop Fuel\nTop Secret\nTOM'S\nToyota Gazoo Racing\nToyota Racing Development\nUras\nVaris\nVeilside\nWALD International\nWedsSport\nWORK Wheels\nYashio Factory\nServices\nAutobacs Seven\nYanase Imported Cars\nRelated topics\nJapan Automobile Manufacturers Association\nTokyo Motor Show\nTokyo Auto Salon\nUsed vehicle exporting\nJ-NCAP\nNational Highway\nExpressways\n\n Category\n Commons\nNote: defunct companies and marques above are shown in italics\n\n\n\nAuthority control General\nIntegrated Authority File (Germany)\nISNI\n1\nVIAF\n1\nWorldCat\nNational libraries\nFrance (data)\nUnited States\nJapan\nCzech Republic\nOther\nSUDOC (France)\n1\n\n\n\n\n\nRetrieved from \"https://en.wikipedia.org/w/index.php?title=Toyota&oldid=1055811827\"\nCategories: TOPIX 100ToyotaBelgian Royal Warrant holdersCar brandsCar manufacturers of JapanCompanies listed on the Fukuoka Stock ExchangeCompanies listed on the London Stock ExchangeCompanies listed on the Nagoya Stock ExchangeCompanies listed on the New York Stock ExchangeCompanies listed on the Tokyo Stock ExchangeConglomerate companies established in 1937Conglomerate companies of JapanCross listed companiesDefense companies of JapanElectric vehicle manufacturers of JapanJapanese brandsJapanese Imperial Warrant holdersMotor vehicle manufacturers of JapanMotor vehicle engine manufacturersMultinational companies headquartered in JapanLuxury motor vehicle manufacturersMarine engine manufacturersMilitary vehicle manufacturersRobotics companies of JapanSewing machine brandsTechnology companies established in 1937Toyota GroupVehicle manufacturing companies established in 1937Engine manufacturers of JapanJapanese companies established in 1937Diesel engine manufacturersHidden categories: Pages with non-numeric formatnum argumentsWebarchive template wayback linksCS1 Japanese-language sources (ja)CS1 Chinese-language sources (zh)Articles with short descriptionShort description is different from WikidataUse mdy dates from February 2021Articles containing Japanese-language textArticles containing potentially dated statements from December 2020All articles containing potentially dated statementsArticles with specifically marked weasel-worded phrases from November 2021All articles with unsourced statementsArticles with unsourced statements from November 2021Articles containing potentially dated statements from March 2021Pages using multiple image with auto scaled imagesArticles containing potentially dated statements from January 2020Articles containing potentially dated statements from 2017Commons category link is on WikidataArticles with GND identifiersArticles with ISNI identifiersArticles with VIAF identifiersArticles with BNF identifiersArticles with LCCN identifiersArticles with NDL identifiersArticles with NKC identifiersArticles with SUDOC identifiersArticles with WORLDCATID identifiers\n\n\n\n\n\n\nNavigation menu\n\n\n\nPersonal tools\n\n\nNot logged inTalkContributionsCreate accountLog in\n\n\n\n\n\nNamespaces\n\n\nArticleTalk\n\n\n\n\n\nVariants\nexpanded\ncollapsed\n\n\n\n\n\n\n\n\n\nViews\n\n\nReadEditView history\n\n\n\n\n\nMore\nexpanded\ncollapsed\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNavigation\n\n\nMain pageContentsCurrent eventsRandom articleAbout WikipediaContact usDonate\n\n\n\n\nContribute\n\n\nHelpLearn to editCommunity portalRecent changesUpload file\n\n\n\n\nTools\n\n\nWhat links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageWikidata item\n\n\n\n\nPrint/export\n\n\nDownload as PDFPrintable version\n\n\n\n\nIn other projects\n\n\nWikimedia CommonsWikinews\n\n\n\n\nLanguages\n\n\nAfrikaansالعربيةAsturianuAzərbaycancaتۆرکجهবাংলাBân-lâm-gúБеларускаяБеларуская (тарашкевіца)БългарскиBosanskiCatalàČeštinaCymraegDanskDeutschEestiΕλληνικάEspañolEsperantoEuskaraفارسیFrançaisGalegoGĩkũyũ한국어HausaՀայերենहिन्दीHrvatskiBahasa IndonesiaÍslenskaItalianoעבריתJawaKaszëbscziҚазақшаKreyòl ayisyenKurdîLatinaLatviešuLietuviųLingálaLa .lojban.MagyarМакедонскиMalagasyമലയാളംमराठीمصرىBahasa MelayuМонголမြန်မာဘာသာNāhuatlNederlands日本語NordfriiskNorsk bokmålNorsk nynorskOʻzbekcha/ўзбекчаਪੰਜਾਬੀپنجابیPiemontèisPolskiPortuguêsQaraqalpaqshaRomânăРусскийСаха тылаScotsShqipSimple EnglishسنڌيSlovenčinaSlovenščinaSoomaaligaکوردیСрпски / srpskiSrpskohrvatski / српскохрватскиSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوVènetoTiếng Việt吴语Yorùbá粵語ZazakiZeêuws中文\nEdit links\n\n\n\n\n\n\n This page was last edited on 17 November 2021, at 23:25 (UTC).\nText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\nPrivacy policy\nAbout Wikipedia\nDisclaimers\nContact Wikipedia\nMobile view\nDevelopers\nStatistics\nCookie statement\n\n\n\n\n\n\n\n\n\n",
    "\n\n\n\nкрузер — Викисловарь\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nкрузер\n\nМатериал из Викисловаря\nТекущая версия (не проверялась)\n\n\n\nПерейти к навигации\nПерейти к поиску\nСодержание\n\n1 Русский\n\n1.1 Морфологические и синтаксические свойства\n1.2 Произношение\n1.3 Семантические свойства\n\n1.3.1 Значение\n1.3.2 Синонимы\n1.3.3 Антонимы\n1.3.4 Гиперонимы\n1.3.5 Гипонимы\n\n\n1.4 Родственные слова\n1.5 Этимология\n1.6 Фразеологизмы и устойчивые сочетания\n1.7 Перевод\n1.8 Библиография\n\n\n\n\nРусский[править]\nМорфологические и синтаксические свойства[править]\nкру́-зер\nСуществительное, неодушевлённое, мужской род (тип склонения ??  по классификации А. А. Зализняка).\nКорень: --.\n\nПроизношение[править]\n\n\nСемантические свойства[править]\nЗначение[править]\nавтомоб.жарг. автомобиль «Toyota Land Cruiser» ◆ А вор как раз «крузер» нам отдал...  Юлия Латынина, «Промзона», 2003 г. \n\nСинонимы[править]\nкрузак\n\nАнтонимы[править]\n\n\nГиперонимы[править]\n\n\nГипонимы[править]\n\n\nРодственные слова[править]\n\n\nБлижайшее родство\n\n\n\n\n\n\nЭтимология[править]\nОт ??\n\nФразеологизмы и устойчивые сочетания[править]\n\nПеревод[править]\n\n\nСписок переводов\n\n\n\n\n\n\n\nБиблиография[править]\n\n\n\n\n\n Для улучшения этой статьи желательно:\nУточнить парадигму словоизменения, используя более конкретный шаблон словоизменения\nДобавить описание морфемного состава с помощью {{морфо-ru}}\nДобавить транскрипцию в секцию «Произношение» с помощью {{transcriptions-ru}}\nДобавить гиперонимы в секцию «Семантические свойства»\nДобавить сведения об этимологии в секцию «Этимология»\nДобавить хотя бы один перевод в секцию «Перевод» \n\n\n\n\n\n\n\n\nИсточник — https://ru.wiktionary.org/w/index.php?title=крузер&oldid=11412578\nКатегории: Русский языкРусские лексемыРусские существительныеНеодушевлённые/ruМужской род/ruПрозвища автомобильных марок/ruСлова из 6 букв/ruСкрытые категории: Нужна классификация по Зализняку/ruНет сведений о составе слова/ruНужно произношениеНужна аудиозапись произношения/ruНужна этимологияСтатьи, нуждающиеся в доработке/ruНужны сведения о морфологии/ruНужно произношение/ruНужны сведения о семантике/ruНужно указать гиперонимы/ruНужна этимология/ruНужен перевод\n\n\n\nНавигация\n\n\n\nПерсональные инструменты\n\n\nВы не представились системеОбсуждениеВкладСоздать учётную записьВойти\n\n\n\n\n\nПространства имён\n\n\nСтатьяОбсуждение\n\n\n\n\n\nВарианты\nexpanded\ncollapsed\n\n\n\n\n\n\n\n\n\nПросмотры\n\n\nЧитатьПравитьИстория\n\n\n\n\n\nЕщё\nexpanded\ncollapsed\n\n\n\n\n\n\n\n\nПоиск\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nНавигация\n\n\nЗаглавная страницаПолный индексКатегорииНовые страницыСвежие правкиСлучайная страницаСтатистикаСправкаСообщить об ошибке\n\n\n\n\nСообщество\n\n\nФорумТекущие событияПожертвовать\n\n\n\n\nИнструменты\n\n\nСсылки сюдаСвязанные правкиСлужебные страницыПостоянная ссылкаСведения о страницеЦитировать страницу\n\n\n\n\nПечать/экспорт\n\n\nСоздать книгуСкачать как PDFВерсия для печати\n\n\n\n\nНа других языках\n\n\nУкраїнська\n\n\n\n\n\n\n Эта страница в последний раз была отредактирована 15 апреля 2020 в 21:53.\nТекст доступен по лицензии Creative Commons Attribution-ShareAlike, в отдельных случаях могут действовать дополнительные условия. Подробнее см. Условия использования.\n\n\nПолитика конфиденциальности\nОписание Викисловаря\nОтказ от ответственности\nМобильная версия\nРазработчики\nСтатистика\nЗаявление о куки\n\n\n\n\n\n\n\n\n",
    "\n\n\n\nЛентапедия/Буркотов, Сергей — Викитека\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nСкачать\n\nЛентапедия/Буркотов, Сергей\n\nМатериал из Викитеки — свободной библиотеки\n< ЛентапедияНепроверенная\n\n\n\nПерейти к навигации\nПерейти к поиску\n←  Бурджанадзе, НиноБуркотов, СергейЛентапедияБуртовой, Юрий →Список статей Лентапедии  •  Последнее обновление: 21.02.2007, 19:08:51  •  Статья на сайте Lenta.ru  •  Архив\n\n\n\n\nВнимание! Данная статья содержит сведения, бывшие актуальными на момент ее публикации (1 декабря 2012 г.). Эти сведения частично устарели и могут не соответствовать текущему моменту. Тем не менее, текст статьи является законченным опубликованным произведением. Просьба не вносить в него обновлений, дополнений и прочих смысловых исправлений.\n\n\nВикипроекты:  Википедия\n←  Бурджанадзе, НиноЛентапедияБуртовой, Юрий →\n\n\nБуркотов, Сергей[править]\nБывший глава управы района Черемушки города Москвы\nБывший глава управы района Черемушки Юго-Западного административного округа города Москвы, секретарь политсовета района Черемушки московского городского регионального отделения партии «Единая Россия». C 1991 года работал в районной управе Северное Бутово, в 1998-2003 годах был ее главой. В январе 2004 года был назначен главой управы района Черемушки. В феврале 2007 года был убит.\nСергей Иванович Буркотов родился 31 марта 1958 года в Москве. В 1981 году окончил Московский авиационно-технологический институт. Работал в научно-производственном объединении «Красная Звезда»[1].\nС октября 1991 года Буркотов работал в районной управе Северное Бутово Юго-Западного административного округа города Москвы: занимал должности заместителя супрефекта и первого заместителя главы управы[1]. В феврале 1998 года Буркотов стал главой управы района Северное Бутово[2][1].\nВ январе 2004 года Буркотов был назначен главой управы района Черемушки, тоже расположенного в Юго-Западном административном округе Москвы[1]. Кроме того, он занимал пост секретаря политсовета района Черемушки московского городского регионального отделения партии «Единая Россия»[3].\n19 февраля 2007 года Буркотов и его водитель Дмитрий Самохвалов были убиты в Ленинском районе Московской области. Около 9 часов вечера их автомобиль Toyota Camry попал в засаду и был расстрелян двумя киллерами из автоматов Калашникова. В тот же день прокуратура Московской области возбудила уголовное дело по двум статьям Уголовного кодекса РФ: «Убийство двух или более лиц» и «Незаконное хранение оружия». Согласно предварительной версии следствия, убийство могло быть связано с конфликтами между Буркотовым и застройщиками, которые вели работы по реконструкции и строительству жилья на территории управы района Черемушки[4].\n\nИспользованные материалы[править]\n\n\n↑ а б в г Андрей Малов. Адрес новоселий — Черемушки. — Тверская,13, 16.03.2004. — № 31\n\n↑ Андрей Харитонов. Северное Бутово: любовь с первого взгляда. — Московская перспектива, 13.07.1999. — № 28\n\n↑ Буркотов Сергей Иванович. — Московское городское региональное отделение партии «Единая Россия» (mos-partya.ru)\n\n↑ Александр Жеглов. На главу района «Черемушки» не нашли управу. — Коммерсант, 20.02.2007. — № 27 (3603)\n\n\n\n\n\n\n\n\n\nИсточник — https://ru.wikisource.org/w/index.php?title=Лентапедия/Буркотов,_Сергей&oldid=1056545\nКатегория: ЛентапедияСкрытые категории: 75%Ручная ссылка:Википедия\n\n\n\nНавигация\n\n\n\nПерсональные инструменты\n\n\nВы не представились системеОбсуждениеВкладСоздать учётную записьВойти\n\n\n\n\n\nПространства имён\n\n\nСтатьяОбсуждение\n\n\n\n\n\nВарианты\nexpanded\ncollapsed\n\n\n\n\n\n\n\n\n\nПросмотры\n\n\nЧитатьПравитьИстория\n\n\n\n\n\nЕщё\nexpanded\ncollapsed\n\n\n\n\n\n\n\n\nПоиск\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nНавигация\n\n\nЗаглавная страницаСлучайная страницаСвежие правкиСтатистикаНовые страницы\n\n\n\n\nУчастие\n\n\nФорумНовости сайтаАнонсыЛит. известияТрибуна читателяСправкаПожертвовать\n\n\n\n\nИнструменты\n\n\nСсылки сюдаСвязанные правкиСлужебные страницыПостоянная ссылкаСведения о страницеЦитировать страницу\n\n\n\n\nПечать/экспорт\n\n\nСоздать книгуВерсия для печатиСкачать EPUBСкачать MOBIСкачать PDFДругие форматы\n\n\n\n\nНа других языках\n\n\n\nДобавить ссылки\n\n\n\n\n\n\n Эта страница в последний раз была отредактирована 25 августа 2013 в 16:53.\nТекст доступен по лицензии Creative Commons Attribution-ShareAlike, в отдельных случаях могут действовать дополнительные условия. Подробнее см. Условия использования.\n\n\nПолитика конфиденциальности\nОписание Викитеки\nОтказ от ответственности\nМобильная версия\nРазработчики\nСтатистика\nЗаявление о куки\n\n\n\n\n\n\n\n\n",
    "\n\n\n\nДмитрий Павлович Губин — Викицитатник\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nДмитрий Павлович Губин\n\nМатериал из Викицитатника\n\n\n\nПерейти к навигации\nПерейти к поиску\n\n\nДмитрий Павлович Губин\n\n\n\n\n\n Статья в Википедии\n\n\n Медиафайлы на Викискладе\n\n\nДми́трий Па́влович Гу́бин (22 марта 1964, Иваново) — советский и российский журналист, радио- и телеведущий. Как пишущий журналист и колумнист работал в журналах «Аврора», «Огонёк», «GQ», «Elle», был главным редактором мужского журнала «FHM» (For Him Magazine). \nКак радио-журналист вёл ток-шоу на «Радио России», «Маяке», «Вести-FM». Как тележурналист вёл программы на РТР и ТВЦ. Лауреат премии «Золотой микрофон», а также премий журналов «Огонёк» и «Elle». Работает в Москве, живёт в Петербурге.\n\nСодержание\n\n1 Цитаты\n\n1.1 О политике\n1.2 О культуре и искусстве\n1.3 О Петербурге\n1.4 о себе\n\n\n2 Ссылки\n3 Источники\n\n\nЦитаты[править]\nО политике[править]\n\n\n \n\nНельзя было критиковать укореняющуюся власть, нельзя было сомневаться в её вертикальной устойчивости. Более того, если в 97-м году легко приходили разные люди, от Явлинского до Зюганова (и я до сих пор вспоминаю моего первого Явлинского, моего первого Зюганова!), то к 2004-му году оставалась лишь тоскливейшая «Единая Россия»... Которая боялась отвечать даже на вопрос «Который час?» А я был колючий... Так вот, поскольку убивать меня было негуманно, мои друзья-начальники решили меня отправить в ссылку. Поскольку в Шушенском тогда вакансий не случилось, меня спровадили в Лондон, на полугодовой контракт на Би-би-си, рассчитывая, я так полагаю, втайне, что оттуда я уже не вернусь.\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\nЯ в 1999-м короткое время вёл «Вести» российского телевидения, интервьюировал гостей в студии. И вот однажды после одной особо удачной шуточки по поводу трогательного единения коммунистов с «медведями» при разделе портфелей в Думе награда нашла героя. Борис Абрамович, которому приписывают отцовство «Единой России», позвонил в гневе Александру Стальевичу, Александр Стальевич позвонил Михаилу Юрьевичу, Михаил Юрьевич позвонил Михаилу Ефимовичу, — и меня в эфире не стало. Хотя тему шуточки я заранее согласовал с Геннадием Николаевичем Селезнёвым...\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\nТогда Селезнёв был ещё вполне действующим председателем, и за два часа до эфиров с его участием к нам приезжала Федеральная служба охраны и убирала со стола мою минеральную воду, чтобы я председателя Госдумы не опоил отравленным «Святым источником»...\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\nЯ предпочитаю работать с открытым забралом. Если у меня есть злой вопрос, я заранее говорю, что вот на такую-то тему хочу говорить. Я, например, на питерском телевидении говорил в 96-м Собчаку накануне выборов: «Знаете, Анатолий Александрович, все в городе только и говорят, что вы своей племяннице сделали бесплатно квартиру, и я не могу не спросить об этом». «Спрашивайте, — говорил он, — только у меня нет никакой племянницы». И я, заранее получив эту информацию, знал, как вести эфир, чтобы не выглядеть дураком...\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\nВообще, если я собираюсь спрашивать о чём-то запредельном, то стараюсь границы запредельного заранее прощупать. Перед записью Кабаевой во «Временно доступен», я, улучив в гримёрке момент, спросил, на кого похож её ребёнок: на маму или на папу? Ответ был, как про племянницу Собчака: Кабаева сказала, что никогда не рожала и ближайшие девять месяцев рожать не собирается... Дело в том, что глупые журналисты (а глупость — болезнь заразительная) свои запредельные темы обычно выкапывают на сайте compromat.ru. А потом умные гости их разделывают под орех. Лучше уж подстраховаться...\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\nПосле Лондона я вспомнил боевую молодость и решил, что хочу быть главным редактором глянцевого журнала, коль публичная политика в стране умерла. И кинул клич по друзьям в глянце. Меня немножечко знали, я к тому времени был колумнистом GQ, вытеснив своей колонкой ни много ни мало Тони Парсонса. Колонка была в рубрике «Мораль» и строилась на простом приёме. Я писал крайне убедительный текст, уводил такую лестницу в небеса, убеждая читателя, что, скажем, надо забыть про возраст, что ночная жизнь, мотоциклы, молодые волчата и волчицы — это круто. А в последнем абзаце я у него лестницу вышибал. Заявляя впрямую: да ты урод, да ты потому и тратишь жизнь на свои беспонтовые тусовки, что не можешь ни создать, ни удержать, ни поддержать семью, а вернее её и ценнее её не будет ничего, и фишка не в том, чтобы в 50 лет колбаситься, а чтобы извлечь из каждого возраста максимальное достоинство. Мне сотрудничество с глянцем нравилось очень, хотя как главред я был тогда просто нулевой, я умел писать и редактировать, я умел выпускать таблоид в 32 страницы, но я представления не имел, что такое толстый глянцевый журнал.\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\nНо мы делали и серьёзные вещи. Мы выходили с заголовком «Путин не президент России». В скобках — «Настоящий президент Петросян — смотри рейтинги». <...> Это было честное отражение реальности. Мы сказали, что есть две страны — «Россия 1» и «Россия 2», и что переходные пункты находятся возле любого мента на улице — достаточно подойти, и он переведёт тебя, куда надо. Глянец ведь действительно много себе позволяет, в этом причина популярности Esquire и GQ, этих двух бьющих под дых политических изданий. Если я правильно понимаю, на том же самом хефнеровский Playboy поднялся. Не потому, что там были голые тёлочки, и именно потому, что тёлочки и серьёзная политика, наука, литература ставились на равных.\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\nЯ же назвал идиотской идею Медведева по установке рамок на вокзалах. Я же сказал, что идиотизм по их установке происходит, наверное, потому, что Медведев не знает, как устроены вокзалы: он никогда не выезжал сам, покупая билет через интернет или в кассе, и он не оставлял вещи в камере хранения. Если бы путешествовал по миру сам, то знал бы, что на европейских вокзалах рамка и сканер стоят перед входом в камеру хранения: ты не можешь оставить сумку, чтобы её не просветили, а тебя не прозвонили. В этом есть логика. А на входе в аэропорт, в аэровокзал рамки бессмысленны. Очередь перед рамкой – это новая привлекательная мишень для террористов.\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\nЯ сказал, что меня пугает власть не потому, что она мерзкая, бездушная и бесчеловечная, хотя она мерзкая, бездушная и бесчеловечная, а то, что это власть никаких не засланных людей, то есть не оккупационная, и не власть касты (не брахманы, которые существовали в Индии, и не аристократы в России), а власть абсолютно народная, потому что во главе страны стоит сын Кухара и медсестры. А это значит, что мерзость власти питается мерзостью воспроизводящего её народа. Я думал, что мне за этого «кухара» вставят, хотя я просто использовал незакавыченную ленинскую цитату.\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\nО культуре и искусстве[править]\n Дмитрий Губин и Юрий Ханон во время съёмок телепередачи (Ленинград, 1990)\n\n\n \n\nОдним из трёх композиторов» Юрий Ханина назвал Союз кинематографистов. После музыки к фильмам Александра Сокурова «Дни затмения» и «Спаси и сохрани» было признано, что Ханин — «один из трёх композиторов, вошедших в номинацию за 1988 год». Я тоже не знаю, что такое номинация, но ещё двумя вошедшими были Шнитке и Гребенщиков. Запад, как водится, оценил Ханина выше, присудив в том же году и за ту же музыку Евро-Оскара, и не сомневаюсь, что «Полидор», «ЭМИ» или «Филипс» запишут Ханина раньше, чем «Мелодия».[1]\n\n\n\n\n \n\n— «Игра в дни затмения», 1990\n\n\n \n\nПассивизм не опишешь через внешние приметы: как процесс он скорее отсутствие всякого процесса. Пассивиты ― подростки из вечной категории «лохов», не могущие «въехать», «врубиться» в самые простые вещи и потому вечно обречённые на роль люмпенизированного арьергарда. Ну, посмотреть «те́лек», ну под вечер погулять лениво в компании таких же «нормальных» ребят ― таков выраженный через вековечное нашенское «ну» образ жизни маленьких сомнамбулят. Не случайно при Брежневе заметить пассивизм как явление было невозможно: мёртвые в мёртвом царстве не бросались в глаза. Выраженьице «трудный подросток» прикрыло всех: и юных профессионалов-воров, и бунтовщиков-неформалов, и наших лохов. Андрей Малахов из нашумевшей повести Валерия Аграновского «Остановите Малахова!» ― в сущности, просто несчастный лох. Никто не думал, что это струя! Марионетки всё же двигались: «как все» играли в «морской бой» на последних партах плохо проветренных классов; ковыряли жирными ложками мерзейшие котлеты; подымали рваненькими кедами пыль на дворовой спортплощадке. Часто мимикрировали под положительного героя, прилежного комсомольца.[2]\n\n\n\n\n \n\n— Александр Файн, Дмитрий Губин, «О племени младом и незнакомом», 1991\n\n\n \n\nВсе талантливые, держащие в руках жизнь мужчины нередко любят поиграть в шпану, эдаких разлюли-хулиганчиков, хотя на самом деле — и это вполне нормально — они просто любят славу, свою работу, деньги или женщин. Таково хулиганство, скажем, двух Никит — Михалкова и Богословского. Ханон — хулиган иного типа. Он щекочет, трансформирует, вышучивает и сплавляет с музыкой собственную жизнь, играя со всем и вся и давно зная, что истинна и противоположность каждой истины. (Как и заметил вполне справедливо Герман Гессе). Он абсолютно естественен в своих эскападах, а вот ни я, ни вы так, увы, естественны быть не можем. Что проводит между нами черту. Так что давайте, что ли, с уваженнием относиться к тем, кто играет по другому счёту, кто может отрезать себе ухо — как Ван Гог, или сказать «Горит бессмыслицы звезда, она одна без дна» — как Хармс. [3]\n\n\n\n\n \n\n— «Лобзанья пантер и гиен», 1991\n\n\n \n\nНекоторое время назад наш респектабельный «Огонёк» заказал Ханину статью о композиторе Скрябине. Мы, конечно, знали, на что шли, но всё же, получив заказ, икнули. И считаем необходимым сделать следующее предупреждение. Дамы и господа! Перед вами, с нашей точки зрения, не статья, не очерк, а текст, который получился, когда Ханон на время заменил фортепиано пишущей машинкой. <...> Не пугайтесь и не требуйте объяснений. Это специальный текст для икания. Постарайтесь понять, что могут быть и такие тексты, хотя, чтобы объяснить это, приходится спускаться от Ханина на несколько ступенек вниз. Но всё же спускаться ещё ниже вряд ли имеет резон. [3]\n\n\n\n\n \n\n— «Лобзанья пантер и гиен», 1991\n\n\n \n\nУ меня в памяти до сих пор чеканные строки Ленинградской «Вечёрки», обвинившей Ханина в неуважении ко всем и вся («увы, журнал «Огонёк» не хочет извиниться»). «Вечёрка» могла, конечно, и напрямую написать, что Ханин — потрясающий музыкальный хулиган, но почему-то не сумела. По истечении полутора лет я убедился, что Ханин — не просто выдающийся музыкальный хулиган, он — выдающийся композитор.[3]\n\n\n\n\n \n\n— «Лобзанья пантер и гиен», 1991\n\n\n \n\nИнформационные законы кажутся ближе к школьным урокам, чем к ядерной физике, но это не так. Например, в интернете действует свой принцип неопределённости: работая с информацией, мы должны выбирать, что нам важнее: качество, скорость или объём, потому что три вещи вместе не совмещаются.\nВот почему глупо пенять Википедии на ошибки. Википедия обеспечивает широту охвата за счёт качества, и по-иному быть не может. Зато в Википедии есть статьи и про Антона Лихоманова, и про Вернера Гейзенберга, но наверняка с неточностями. При этом про Гейзенберга ошибок, скорее всего, больше, чем про Лихоманова. Просто потому, что про Гейзенберга статья большая, а про Лихоманова крохотная. Но, повторяю: в интернете либо количество, либо качество.\n\n\n\n\n \n\n— «Дурак не понимает, что такое Википедия»\n\n\n \n\n...лучшее, что могут сделать сегодня и «Публичка», и «Ленинка», и прочие библио-гранды, — это оцифровать и выложить в открытый доступ книги из своих хранилищ, начиная со специализированных энциклопедий и словарей. Их электронные тексты должны быть эталонными, сверенными с оригиналами.  Так библиотеки могут помочь специалистам, которым важнее качество, чем количество. Но пока что сайт Российской национальной библиотеки в этом смысле мёртв, — в отличие, скажем, от сайта Библиотеки Конгресса США.\n\n\n\n\n \n\n— «Дурак не понимает, что такое Википедия»\n\n\n \n\nСамое смешное, что я с Минкультом в определении русской цивилизации согласен, и сам это не раз писал: Россия не Европа. Современной русской культуре не свойственны ни европейская логика, ни европейское равенство перед законом, ни ценности западного негероического христианства. Наша культура: «Слабых — бьют». Западная культура: «Слабых бьют негодяи».\nПоэтому я нынешнюю отдельность русской культуры от Запада (а культура — это всё то, что человек производит, минус гены) воспринимаю как трагедию. А министерство современной русской культуры — похоже, как повод для восторга.\n\n\n\n\n \n\n— «Россия не Европа, а культ – не культура»\n\n\n \n\nЯ прочитанные книги конспектирую самым неудачным, однако практически удобным для журналиста способом: выписываю цитаты. Конспект в колонку не вставишь, а вот цитату — запросто. Как-то я даже предложил Ивану Засурскому написать для «Частного корреспондента» рецензию на книгу, состоящую из одних цитат. Засурский впал от нового жанра в ажитацию, однако текст так и не вышел. Это легко понять: цитата упускает контекст, в отличие от конспекта.\n\n\n\n\n \n\n— «Россия не Европа, а культ – не культура»\n\n\n \n\nДля меня Гоголь-центр – это даже не театр родной, а продолжение дома. Я туда хожу, как дачник идет на веранду: поваляться на диване, почитать книжку, полюбоваться игрой солнца и сосен. <...>\nВидимо, Гоголь-центр, где молодая кровь вливается в любое забредшее тело, обожаю не я один. Там хлопают в конце спектаклей на разрыв ладонных связок. Там влюбляются. Там не влюбляться вообще невозможно.\n\n\n\n\n \n\n— «Уходя, уходи» (латышские гастроли в Гоголь-центре)\n\n\n \n\nС тех пор, как там появился Серебренников, и худший театр Москвы превратился в лучший театр Москвы, свежий как клинок, рассекающий влёт утреннюю траву в росе, на меня снизошло абсолютно театральное счастье. И когда Дима Киселёв топтался и перделся именно на Серебренникове, это было для меня показателем. Киселёв — умный человек с тонким европейским вкусом. Гоголь-центр ему должен нравиться очень: я с Киселёвым четверть века знаком. И то, что он топтался, выдаёт в нём умного человека, который понимает: служить злу — так уж до конца, безоглядно, изгаляясь именно там тем, что лично тебе по душе. Заказчику с копытом ни на 5%, ни на 95% служить невозможно — только уж на 100%. Уж коли на крыле храма вы совершили сделку: ты ему целуешь жопу, а он тебе отдаёт весь телемир... это так, к слову.\n\n\n\n\n \n\n— «Уходя, уходи» (латышские гастроли в Гоголь-центре)\n\n\n \n\nСеребренников сегодня — лучший сценограф страны, а, быть может, и мира. Так, как он сцену, умел чувствовать кадр, быть может, Бунюэль, когда понимал, что, вот, пора через супружескую спальню пробегать страусу. И сценография «Войцека» замечательна. Это не просто сценография — телография, звукография, светография.\n\n\n\n\n \n\n— «Уходя, уходи» (латышские гастроли в Гоголь-центре)\n\n\n \n\n<Книга> «Рождение Европы» чрезвычайно важна для современного российского сознания, т.е. сознания эпохи наступающего и глумящегося обскурантизма, и важна по двум причинам.\nПервая причина в том, что бесконечность российских споров, является ли Россия Европой, основана на непонимании того, что такое Европа, каков европейский фундамент. А эту идею сформулировал ещё в 1922 году Поль Валери. Европа — это Афины, Рим и Иерусалим. Это античная Греция, Римская империя и появление среди народа Израилева Иисуса из Назарета. Европу связывают в единое ценностное целое именно эти обручи: греческая логика, римское право и негосударственное западное христианство, в котором слабость побеждает силу и в котором несть эллина и иудея. И об этом Ле Гофф пишет так страстно и так наглядно, что в глупый спор о России и Европе уже не хочется встревать. Мы не Европа, хотя и носим европейский наряд. В отличие от Финляндии, которая абсолютно Европа, потому что, не зная Афин и Рима, приняла наследство Афин и Рима.\n\n\n\n\n \n\n— «Жак ле Гофф: тот, кто создал европейскую цивилизацию»\n\n\n \n\nЯ не ожидал, что смерть 90-летнего французского интеллектуала вызовет у меня слёзы. Слёзы должна вызывать не смерть интеллектуала, но смерть интеллекта, а в эпоху мракобесия она косит людей, что твоя средневековая чума, и для меня моя страна, от моря до моря, — звон чумных колокольчиков.\nНет больше в Европе Жака Ле Гоффа.\nЕсть повод, как противоядие от чумы, прочитать его книги.\n\n\n\n\n \n\n— «Жак ле Гофф: тот, кто создал европейскую цивилизацию»\n\n\n \n\nЗамечательная книга знаменитого биолога Ричарда Докинза «Эгоистичный ген» является особенно замечательной потому, что она написана как бы с точки зрения гена. И тогда многие вещи начинают выглядеть по-другому. Например, мы с точки зрения генов — всего лишь человеческие машины, доставляющие гены к месту их репликации.\nЭтот приём — смещённая точка зрения — позволяет на многое посмотреть на другому.\nЧто бы сказали наши смартфоны, коммуникаторы и ноутбуки, если бы им пришлось оценивать, скажем, вокзалы, аэропорты, поезда и самолёты?\n\n\n\n\n \n\n— «С точки зрения розетки. Где прикурить в новом Пулково?»\n\n\n \n\nГлавное удобство современного путешественника — это вовсе не буфет, мягкие кресла и вообще всё то неуловимое, что называется «сервисом».\nГлавное удобство – возможность подзарядить ноутбук или смартфон.\nИ я давно на все новые вокзалы и аэровокзалы, самолёты и поезда смотрю исключительно с этой точки зрения. И поэтому, скажем, скоростной поезд «Аллегро» мною любим: там розетка у каждого кресла. А любимый другими «Сапсан» для меня — сплошная дискриминация на колёсах: там розетки положены лишь бизнес-классу. <…> В сияющем новом «Пулково», являющем несомненный прогресс на фоне старого отвратительного аэропорта, я никаких розеток не обнаружил. А в ответ получил упрёки в отсутствии патриотизма и низкопоклонстве, однако ни одного совета по поводу того, где в «Пулково» можно дать моему ноутбуку прикурить.\n\n\n\n\n \n\n— «С точки зрения розетки. Где прикурить в новом Пулково?»\n\n\n \n\nАмериканский фантаст Артур Кларк прогнозировал, что уже в 2016 году мир перейдёт на новую валюту, и этой валютой будет киловатт-час.\nПохоже, он не сильно ошибался: в мире на вес золота заряженная батарейка, дающая возможность оставаться на связи в любую минуту.\nСтоит ли удивляться, что в обществах с гигантским социальным расслоением даже зарядка батарейки воспринимается как привилегия и достаётся не всем?\n\n\n\n\n \n\n— «С точки зрения розетки. Где прикурить в новом Пулково?»\n\n\n \n\nЯ довольно быстро понял, что мне в FHM нужны не революции, а просто развитие того, что сделал до меня Бахтин. Он придумал, например, рубрику «Все без ума от Леры». Это было такое на разворот секс-интервью, обильно проиллюстрированное как бы на «поляроиде» сделанными снимками бывшей жены владельца «Сердождя» Дмитрия Савицкого Леры, которая расспрашивала очередную тинэйджерскую звезду о том, как часто тот мастурбирует и во сколько лет впервые трахнулся. И Дима Билан в ответ трогательно рассказывал о сексе сразу с двумя тёлочками, которым, по версии Билана, он сказал: «Пойдем, пососёмся», — ну вот и понеслось.\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\nЯ занимался маленькими переделками журнала. У нас была, например, в начале номера рубрика «Секс», которую правильней было назвать «Ню», там публиковались отличные снимки из альбомов издательства «Taschen» — там много чего попадалась любопытного, какая-нибудь вековой давности порнография, очень трогательная: женщины в корсетах, усатые мужчины. Но эта рубрика всех рекламодателей вводила в ступор. Компания Toyota никак не хотела размещать рекламу на соседней полосе с группой дореволюционных циркачек без трусов. А первая треть журнала – она самая лакомая и самая дорогая, и, если вы хотите просчитать коммерческий потенциал журнала, можете пролистать первую треть. Ну, я взял и передвинул рубрику в последнюю треть журнала.\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\nГлянец — это выдуманный мир, и не нужно в него лезть с неглянцевыми правилами. Дима Быковъ вёл ещё одну рубрику — «Это твоя бывшая девушка». В ней помещались рассказ о брошенной девице, полосной снимок девицы в бикини, а в правом нижнем углу ставился заголовок «Кусай локти, такой-то!», где добавлялась фамилия любого литературного персонажа — например, «Кусай локти, Тимур Командов!». Первое попавшееся фото кусателя бралось из интернета, а девушки в бикини были девушками из модельного агентства, которым мы не платили, но которые на халяву получали снимок в портфолио и вечную славу. Монологи брошенных девушек Быковъ сочинял примерно так: «Моя леденящая душу, но находящая отклик в тонко организованных людях история началась в колхозе имени Светлого пути в Гуантанамо в 5:27 утра тёплого майского дня прошлого года. Голосисто заливались петухи...» Потом я узнал, что многие в эту упоительную чушь верили, включая суровых мужчин из колоний строгого режима, обуреваемых жаждой знакомства и прочими мужскими инстинктами.\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\n...я знаком с учеником Ролдугина, подтвердившим, что тот очень хороший виолончелист. «А какой это человек, — добавил он, — я даже говорить не хочу». Но, знаете ли, в музыке гений и злодейство ещё как совмещаются![4]\n\n\n\n\n \n\n— «Всё что было живого...»\nО Петербурге[править]\n\n\n \n\nВ 1987-м уехал в Ленинград. Полгода ночевал на диванчике главного редактора журнала «Аврора», окружённый Зимним дворцом, Марсовым полем и прочими красотами. В результате получил свою дозу великодержавного петербургского шовинизма.\n\n\n\n\n \n\n— «Хоморик этого, Губина»\n\n\n \n\nПять лет я езжу на работу из Петербурга в Москву, наблюдая превращение второй столицы в Рим при варварах: местные пейзане (гордые римляне) пасут коз на развалинах Колизея. Сходство — внутреннее. Грязь, дороги перекопаны, каждый ремонт – триумф хамства, указателей – ноль. По набережным — битые бутылки, на дороге фиг кто уступит, и даже в музыкальных магазинах продавцы не пританцовывают, а тупо смотрят в пространство. Минор.\n\n\n\n\n \n\n— «Хоморик этого, Губина»\n\n\n \n\nЭкономической географией упадок не объяснить. Транспортный узел, граница с Финляндией, промышленность, ВУЗы. Не объяснение – и некоторая, хм... чудаковатость нынешних обитателей Смольного. Ну да, «твёрдый хозяйственник» Яковлев, если судить по хозяйству – жидок до газообразности, но среди мэров остальных 16 городов — что, чудаки не встречаются?..\nБоюсь, главная причина в том, что Петербург — интеллигентский оплот постсоветской России. А интеллигенция – это не социальный, а политический класс, миссия которого – не производить, а быть в оппозиции к власти. Только по этой причине в СССР академик-стукач из интеллигенции исключался, а шоферюга, читающий самиздат – туда же записывался. Отсюда — презрение к результату труда...\n\n\n\n\n \n\n— «Хоморик этого, Губина»\n\n\n \n\nТо, что интеллигенты сохранялись благодаря советской власти — очевидно. В Европе их братья по разуму вымерли в начале 20-х, образовав класс востребованных реальностью специалистов и self employed. После 1991-го и у нас оставаться интеллигентом — глупо. Однако интеллигентские настроения живы, и недооценивать их опасно. Собчака свалила именно интеллигенция: его внутренней, не всегда сознаваемой идеей было отстроить город-фиесту, Рим ХХ века...\n\n\n\n\n \n\n— «Хоморик этого, Губина»\n\n\n \n\n...Яковлев, надо отдать ему должное, чаяния интеллигенции удовлетворил. Он создал миф о жадной, бесчестной, укравшей все деньги Москве. И Питер с мрачным восторгом воспрянул: вот почему всё так плохо! Зато мы! Духовная столица! Высокая культура! Великая история! Архитектура! Идейные наследники! Хотя ни к великой истории, ни к великой архитектуре нынешние горожане отношения не имеют. Они имеют отношение к облупленным фасадам, загаженным подъездам, славе криминальной столицы и улицам разбитых фонарей.\n\n\n\n\n \n\n— «Хоморик этого, Губина»\n\n\n \n\nХватит при слове «культура» закатывать глаза: культура — это не когда читают «Каштанку», а когда на улицах есть урны. Пора убить интеллигента в себе, иначе он воссоздаст в голове советский строй, как СССР благополучно воссоздан в Петербурге.\nПли.\n\n\n\n\n \n\n— «Хоморик этого, Губина»\n\n\n \n\n Но я же не называл Медведева фашистом. Или Путина. Потому что, скажем так, на месте своей работы ни Путин, ни Медведев не делают того, во что превращён Петербург. Для меня есть вещи, определяемые однозначно. В Петербурге был уникальнейший памятник — Кировский стадион, феноменальное Сталинской архитектуры сооружение. Он был спроектирован по античным канонам. Для этого на стрелке Крестовского острова насыпали огромную гору, в кратере которого устроили стадион в виде классического амфитеатра, а по внешним сторонам кратера шли по спирали дорожки. И наверх каждый мог въехать на велосипеде или роликах. И для тебя постепенно, с каждый кругом, открывался вид на Финский залив. Феноменальная вещь, нигде больше в мире. И это было уничтожено, чтобы построить там «Газпром-Арену». Дело не в том, что строительство сначала оценивалось в 6 миллиардов, а сейчас уже в 33, — а в том, что взяли общественное, фантастической красоты место и заменили его газпромовским. Кто как не фашисты эти люди? Фашизм — это уничтожение общественного и замена его партийным. Нацизм — уничтожение мира в пользу одной нации.\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\n Медведев и Путин не устраивал так, что будет задавлена снегоуборщиком 80-летняя жительница блокадного Ленинграда, мама моего друга и соавтора Лёвы Лурье. Что будет со сложнейшим переломом ног в больнице валяться Стас Пылев, с которым я когда-то делал первое своё ток-шоу на питерском телевидении. И ни Путину, ни Медведеву я не могу предъявить упрёк, состоящий в том, что консьержка в нашем доме, блокадница, говорит: «Димочка, такое было только в блокаду, и то тогда город расчищался лучше».\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\n Валентина Матвиенко меня волнует меньше, потому что это очень простое явление. Она такая Елена Батурина, которая искренне убеждена, что Венеция — говно, где каналы воняют, домишки старые, и, конечно, нужно всю эту рухлядь снести и заменить монолитным железобетоном. Ведь снаружи всё то же самое будет, даже лучше! Она не понимает, что такое история. Она не понимает, что в старых вещах есть смысл. Старые туфли ведь выбрасывают, не так ли?\nНо проблема, повторяю, не в ней. Да я бы Матвиенко в задницу целовал, если бы она одна такой была, а все вокруг про Питер понимали. Когда я читаю интервью Вуди Аллена, который говорит, что Петербург — один из самых потрясающих городов мира, и что это – одна из мировых жемчужин, но что это понимает он, а не жители Петербурга, я плачу. Я читал его интервью в «Ведомостях» и рыдал: Вуди Аллен это понимает, я понимаю, а этого не понимает не Матвиенко какая-то (да и бог совсем с ней), а сами петербуржцы.\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\n ...меня уволили... Первой реакцией коллег было: «Ты не мог придержать язык за зубами?» Но как вы представляете себе радиожурналиста с языком за зубами? Вторая реакция: «Ты в деньгах много потерял?» Слушайте, у меня отбирают исторический город, который называется Санкт-Петербург, и этот город стóит в миллиарды миллиардов раз больше, чем зарплата Димы Губина за всю его жизнь. У меня сокровище отбирают, настоящее сокровище и превращают его в новодел! Поэтому, конечно, я ору.\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\n Я действительно испытываю сильные чувства к Валентине Матвиенко.\nМой роман с ней вошел в эндшпиль в конце второй по счёту питерской блокадной зимы, когда я сказал всё, что о думал о ней как о наместнице, гауляйтерше, в эфире радиостанции «Вести FM», где я вёл утренний эфир в одной линейке с Владимиром Соловьёвым.\n\n\n\n\n \n\n— «Как я попал в чёрные списки»\nо себе[править]\n\n\n \n\n ...я вообще парень не из грошовых, как говорит в подобных случаях мой коллега Дима Дибров.\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\nМеня зовут Дмитрий Губин. Отчество — Павлович.\nЯ родился в 1964 году в Иваново в окружении угрюмых ткачей, разбитных ткачих и любящей родни, не имеющей к первым двум категориям отношения.\nВ 12 лет понял, что за самовыражение можно получать не только шишки, но и деньги, и начал печататься в местных газетах.\nПримерно с той же целью в 1981-м поступил на факультет журналистики МГУ, откуда несколько раз пытались выгнать примерно по той же причине. Окончилось ссылкой в Волоколамск по распределению, в редакцию районной газеты с пробрежневским названием «Заветы Ильича».\n\n\n\n\n \n\n— «Хоморик этого, Губина»\n\n\n \n\nПоехали! То есть, здравствуйте, дамы и господа.\nНе то чтобы идеальная форма обращения, но так я когда-то выходил каждый день в эфир. Композитор Ханин, например, ко всем обращается «Мужик!», независимо от пола, возраста и количества. Было время, когда меня в эфир ещё пускали. Не так, если разобраться, и давно. Раз вы это читаете, то значит, либо ошиблись IP-адресом, либо хотите со мной связаться, либо что-нибудь разузнать.\n\n\n\n\n \n\n— «Хоморик этого, Губина»\n\n\n \n\nДо весны 2007-го <я> был главным редактором журнала «FHM» (5-го в списке мужского глянца, между прочим) — и, как ни смешно, многим до сих пор интересен только в этом качестве. А до того я вёл программы на радио, писал колонку в «GQ» и в миллионы других изданий, тусовал где можно и где нельзя (там особенно нравилось).\n\n\n\n\n \n\n— «О себе»\n\n\n \n\n Ныне я, подобно Диме Быкову, искренне пожимаю плечами при слове «гламур», а также профессионально многостаночничаю, являясь разом обозревателем «Огонька», ведущим программы «Временно доступен» на ТВЦентре (веду вместе с Димой Дибровым), «Большая семья» на «России» (веду вместе с Димой Харатьяном) и, вот, только начал вести утренний эфир по пнд и пт на «Вестях ФМ» (в одной линейке с Володей Соловьевым — у него вт, ср, чт)... А ещё по ночам, когда Дима Быков пишет романы, я бомблю у Ярославского вокзала! И, конечно же, немного шью.\n\n\n\n\n \n\n— «О себе»\n\n\n \n\n ...второе потрясение было связано с набором людей. Я взял одного парня, с которым был знаком по Петербургу, — мужчину тяжёлой судьбы: алкоголь, разбитый мотоцикл, но он поклялся, что пить в будни не будет. Он лихо довольно писал про мужские забавы — кулачные бои, шрамирование, про диггеров, скалолазов. Ему для обустройства в Москве не хватало денег, я дал ему в долг. А после получки он вдруг пропал. Телефон отключен. Где живёт — неизвестно. А у нас вовсю сдача номера. И вдруг получаю от него e-mail: «Я в Сочи, прошу журналистом меня больше не считать». Я в ярости сделал два круга по кабинету, причём, как потом определили по моим следам, прямо по стенам и потолку.\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\n Благодаря глянцу я объездил полмира. Не в каждой жизни случится ужинать в Парижской Grand Opera Garnier, когда по левую руку от тебя в бриллиантах Ильзе Лиепа, а по правую — в бриллиантах Рената Литвинова, и все вы пьёте Perrier-Jouet Belle Epoque. Я нажрался ночных клубов, тусовок так, что никакими коврижками теперь не заманишь. Кстати, ещё приказ о назначении не был подписан, а у меня на столе уже лежали подарки от рекламодателей и приглашения (в первый рабочий день!) на вечеринки. Я, конечно, как полный идиот пошёл в клуб «Осень» к указанному времени сбора гостей. Я никогда не забуду это ощущение, сравнимое с тем, когда, стоя на сцене, обнаруживаешь расстёгнутую ширинку, а из неё рубашка торчит — ты один в клубе. В Москве только ведь лохи и свежеиспеченные главреды по приглашениям являются вовремя.\nНастало время, когда я обожрался настолько, что одну редколлегию начал словами: «Коллеги, у меня для вас очень хорошая новость — только что сгорел клуб «Дягилев».\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\n Главные редакторы — рабы на галерах, но жизнь главного редактора дает эгоистическую возможность посмотреть мир. Благодаря редакторству я узнал Германию, полюбил эту страну, я прощупал её автобаны низкопрофильной резиной на скорости 310 километров в час. Я несколько раз побывал в Америке, съездил в Китай. Я горные лыжи и сноуборд благодаря глянцу освоил, потому что, когда первый раз получил приглашение в Куршевель, решил, что все там офигенные спортсмены и стал брать уроки!\nА ещё в начальниках я увидел массу вещей, которые раньше не замечал и не понимал. Я знал, что такое редактировать тексты, но не знал, что такое увольнять людей, и какое это мучение. Однажды я подошел к фон Шлиппе проинформировать об увольнении сотрудника, а он мне сказал: «Во-первых, это не его ошибка, а ваша — вы его взяли на работу, и вы должны помнить, что сейчас ценой карьеры другого человека будете исправлять свою ошибку; во-вторых, вы обязаны поговорить с человеком три раза — объяснить, что к нему есть претензии, второй раз — объяснить то же самое, если он не понял, и только третий раз вы должны обсудить условия расставания».\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\n Может, у меня в тот момент, благодаря Соловьёву, который много чего позволяет, была иллюзия – я забыл атмосферу страха. Хотя получал каждый день эсэмэски: «Дмитрий, судя по всему, сегодня — ваш последний эфир», «Жалко, но, судя по всему, сегодня последний эфир». И глаза коллег, ужасом объятые... Ребят, что я говорю? Вещи, которые общественно значимы. Я очень хорошо понимаю Леонида Парфёнова, когда он сказал, что он не занимался политикой, и что он был снят с эфира не из-за политики, а — из-за профессии. У него такая профессия — интервьюировать и задавать вопросы, имеющие общественный интерес.\n\n\n\n\n \n\n— «Крупный план на среднем фоне»\n\n\n \n\n Когда я узнал, что больше не веду «Временно доступен» (а ещё в июне меня уверяли, что всё ОК, и что в конце августа записи возобновятся), то, на всякий случай, позвонил N. \nN. замечателен тем, что его любят все — и правые, и левые — и никто не смеет ему отказать. \nЯ попросил N. узнать, в чём дело. Это требование Старой площади или перестраховка того самого Пономарёва, с которым я не знаком? \n«Старик, поздравляю! — раздался через час в трубке хрипатый голос N. — на центральные каналы можешь даже не соваться. \nНа тебя полный запрет, тётя Валя постаралась. И всё телевидение это знает». \nВот, собственно, и вся история, и я даже не хочу добавлять, что «вот и возвратился СССР», и не хочу писать о запрете о профессии, — словом, не хочу писать ни о tempores, ни o mores.\n\n\n\n\n \n\n— «Как я попал в чёрные списки»\n\n\n \n\n В конце концов, меня убирают из эфира по политическим резонам в шестой раз. \nПервый раз это сделал в 1996-м Анатолий Собчак (я вёл «Час мэра» на «5 канале» — но тогда мне позвонил глава канала Олег Руднов и принёс извинения за Собчака, а после эмиграции извинился и сам Собчак). \nЗатем меня выгоняли из «Вестей» по распоряжению, если не ошибаюсь, Волошина (там была сложная интрига с распространением медиавлияния Березовского, и я жертвою пал, а Березовский пал позже) и из радиоэфира «Маяка 24», когда я в прямом эфире, в рамках подготовки к Олимпиаде, уговорил Леонида Тягачёва принять от меня 1000 долларов на ремонт туалета в сочинском аэропорту, с установкой над писсуаром мемориальной таблички «От Димы Губина — Олимпийским играм». Но тогда мне честно выплачивали двухмесячную компенсацию — не говоря уж о том, что действительно извинялись.\n\n\n\n\n \n\n— «Как я попал в чёрные списки»\n\n\n \n\nЧто касается меня самого, я предпочёл бы, чтобы на поминальной дате после моей смерти пели, веселились и играла музыка: Каравайчука, Десятникова и Хано́на. Но это моё личное желание.[5]\n\n\n\n\n \n\n— Дмитрий Губин, «Особое мнение», 10 августа 2015\n\n\n \n\nЯ от русской нищеты сбежал в Германию. Здесь по крайней мере продукты дешевле, а качество выше, чем в России. Здесь хоть с голоду не подохнешь. Здесь хоть поставят на довольствие. Деньги не большие, но в Германии от голода никогда не помрешь. А то, что в России Крылов подыхал с голоду, это меня потрясло. Он – человек. И я уважаю принцип государства Германии, я практически стал здесь германофилом, и я понимаю, почему многие пытались превратить Россию в Германию, начиная от Тютчева, который был абсолютным германофилом. Он 25 лет прожил в Баварии. И «люблю грозу в начале мая» — это про баварскую грозу. И «умом Россию не понять» — это попытка примирить ее с той страной, с Германией и Баварией, которую он очень любил.[6]\n\n\n\n\n \n\n— Дмитрий Губин, «Особое мнение», май 2020\nСсылки[править]\nИнтервью Дмитрия Губина петербургскому интернет-телевидению Piter.tv\nГубин Дмитрий Павлович. Краткая биография на rusperson.com\nДмитрий Губин: «Пресс-Портрет»\nСтраница журналиста на сайте журнала «Огонёк»\nДмитрий Губин — Колумнисты Gzt.ru\nСтраница ведущего на сайте журнала «Афиша»\nПодкаст «Звонок Губину» на PODстанции\nПрофайл на «Совершенно секретно ТВ»\nИсточники[править]\n\n\n↑ Дмитрий Губин, «Игра в дни затмения», «Огонёк» № 26, июнь 1990 г.\n\n↑ Александр Файн, Дмитрий Губин, «О племени младом и незнакомом», «Огонёк» № 8, февраль 1991 г.\n\n↑ 1 2 3 Юрий Ханон, «Лобзанья пантер и гиен», Москва, журнал «Огонёк» № 50, декабрь 1991, стр.21. \n\n↑ Дмитрий Губин. Интервью журналу «Собеседник»: «Всё что было живого...»\n\n↑ Дмитрий Губин, «Особое мнение» на «Эхе Москвы» (от 10 августа 2015 года)\n\n↑ Дмитрий Губин, «Особое мнение» на «Эхе Петербурга» (от 15 мая 2020 года)\n\n\n\n\n\n\nПоделитесь цитатами в социальных сетях:\n VK •\n Facebook •\n Twitter •\n LiveJournal \n\n\n\n\n\n\nИсточник — https://ru.wikiquote.org/w/index.php?title=Дмитрий_Павлович_Губин&oldid=352071\nКатегории: Персоналии по алфавитуПисатели по алфавитуПублицисты по алфавитуПисатели РоссииРусские писателиЭссеисты по алфавитуЭссеисты РоссииЖурналисты России\n\n\n\nНавигация\n\n\n\nПерсональные инструменты\n\n\nВы не представились системеОбсуждениеВкладСоздать учётную записьВойти\n\n\n\n\n\nПространства имён\n\n\nСтатьяОбсуждение\n\n\n\n\n\nВарианты\nexpanded\ncollapsed\n\n\n\n\n\n\n\n\n\nПросмотры\n\n\nЧитатьПравитьИстория\n\n\n\n\n\nЕщё\nexpanded\ncollapsed\n\n\n\n\n\n\n\n\nПоиск\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nНавигация\n\n\nЗаглавная страницаСлучайная страницаПортал сообществаФорумСвежие правкиНовые страницыСправкаПожертвовать\n\n\n\n\nИнструменты\n\n\nСсылки сюдаСвязанные правкиСлужебные страницыПостоянная ссылкаСведения о страницеЦитировать страницуЭлемент Викиданных\n\n\n\n\nПечать/экспорт\n\n\nСоздать книгуСкачать как PDFВерсия для печати\n\n\n\n\nВ других проектах\n\n\nВикискладВикипедия\n\n\n\n\nНа других языках\n\n\nБеларуская\nПравить ссылки\n\n\n\n\n\n\n Эта страница в последний раз была отредактирована 18 сентября 2020 в 14:00.\nТекст доступен по лицензии Creative Commons Attribution-ShareAlike, в отдельных случаях могут действовать дополнительные условия. Подробнее см. Условия использования.\n\n\nПолитика конфиденциальности\nО Викицитатнике\nОтказ от ответственности\nМобильная версия\nРазработчики\nСтатистика\nЗаявление о куки\n\n\n\n\n\n\n\n\n\n\n"
]